     A*****************************************************************
     A*          發票號碼設定資料檔(ARAALF01)KEY=AA02+AA01+AA03
     A*****************************************************************
     A          R AA0                       PFILE(ARAAPF)
     A          K AA02
     A**              ('發票年月')
     A          K AA01
     A**              ('公司別')
     A          K AA03
     A**              ('組別')
