     A*****************************************************************
     A*          發票號碼設定資料檔(ARAAPF)KEY=AA01+AA02+AA03
     A*****************************************************************
     A                                      REFACCPTH(ARAAPF)
     A          R AA0                       PFILE(ARAAPF)
