     A*****************************************************************
     A*          銀行帳號資料檔(ARABPF)   KEY=AB01+AB02
     A*****************************************************************
     A                                      REFACCPTH(ARABPF)
     A          R AB0                       PFILE(ARABPF)
