     A*****************************************************************
     A*          收款主檔(ARACLF01)       KEY=AC01+AC12+AC11 (S)
     A*****************************************************************
     A          R AC0                       PFILE(ARACPF)
     A          K AC01
     A**              ('公司別')
     A          K AC07
     A**              ('預計兌現日期')
     A          K AC06
     A**              ('票據號碼')
     A          S AC11                      COMP(NE 0)
