     A*****************************************************************
     A*          收款主檔(ARACLF02)       KEY=AC02-AC06 (S)
     A*****************************************************************
     A          R AC0                       PFILE(ARACPF)
     A          K AC06
     A**              ('票據號碼')
     A          S AC05                      COMP(EQ '10')
     A            AC14                      COMP(EQ 'CK')
