     A*****************************************************************
     A*          收款主檔(ARACLF03)       KEY=AC02-AC06 (S)
     A*****************************************************************
     A          R AC0                       PFILE(ARACPF)
     A          K AC02
     A**              ('客戶代號')
     A          S AC10                      COMP(NE 0)
