     A*****************************************************************
     A*          ¦¬´Ú¥DÀÉ
     A*****************************************************************
     A                                      REFACCPTH(ARACPF)
     A          R AC0                       PFILE(ARACPF)
