     A*****************************************************************
     A*          收款明細檔(ARADLF9)
     A*****************************************************************
     A          R AD0                       PFILE(ARADPF)
     A          K AD11                      DESCEND
     A**     ('發票日期')
     A          K AD02
     A          K AD03
     A          K AD04
     A          K AD05
     A          K AD06
     A          K AD07
