     A*****************************************************************
     A*          收款明細檔(ARADLF09)
     A*****************************************************************
     A          R AD0                       PFILE(ARADPF)
     A          K AD10
     A**              ('發票公司別')
     A          K AD02
     A**              ('客戶代號')
     A          K AD12
     A**               ('分配日期')
