     A*****************************************************************
     A*          ¦¬´Ú©ú²ÓÀÉ(ARADLF06)
     A*****************************************************************
     A          R AD0                       PFILE(ARADPF)
     A          K AD06
     A          O AD05                      COMP(NE '50')
     A          O AD09                      COMP(NE 'V')
