     A*****************************************************************
     A*          ¦¬´Ú©ú²ÓÀÉ(ARADLF05)
     A*****************************************************************
     A          R AD0                       PFILE(ARADPF)
     A          K AD01
     A          K AD02
     A          K AD03
     A          K AD04
     A          K AD05
     A          K AD06
     A          K AD12
     A          K AD07
     A          K AD10
