     A*****************************************************************
     A*          票據兌現主檔(ARAEPF)     KEY=AE01-AE03
     A*****************************************************************
     A          R AE0                       PFILE(ARAEPF)
     A          K AE01
     A          K AE02                      DESCEND
     A          K AE03
