     A*****************************************************************
     A*          價差折讓資料檔(ARAFPF)         KEY=AF06
     A*****************************************************************
     A          R AF0                       PFILE(ARAFPF)
     A          K AF06
