     A*****************************************************************
     A*          價差折讓資料檔(ARAFPF)         KEY=AF06
     A*****************************************************************
     A          R AF0                       PFILE(ARAFPF)
     A          K AF06
     A*          ('發票號碼')
     A          K AF02
     A*          ('折讓單號')
