     A*****************************************************************
     A*          價差折讓資料檔(ARAFPF)         KEY=AF02
     A*****************************************************************
     A          R AF0                       PFILE(ARAFPF)
     A          K AF01
     A          K AF05                      DESCEND
     A          K AF02
