     A*****************************************************************
     A*          價差折讓資料檔(ARAFPF)         KEY=AF02
     A*****************************************************************
     A                                      REFACCPTH(ARAFPF)
     A          R AF0                       PFILE(ARAFPF)
