     A*****************************************************************
     A*          銷貨折讓明細檔(ARAGLF01) KEY=AG01/03/09/10/11
     A*****************************************************************
     A          R AG0                       PFILE(ARAGPF)
     A          K AG03
     A**             ('產品代號')
     A          K AG04
     A**             ('發票號碼')
     A          K AG02
     A**             ('折讓單號')
