     A*****************************************************************
     A*          ¾P³f§éÅý©ú²ÓÀÉ(ARAGLF01) KEY=AG01/03/09/10/11
     A*****************************************************************
     A                                      REFACCPTH(ARAGLF01)
     A          R AG0                       PFILE(ARAGPF)
