     A*****************************************************************
     A*          ¾P³f§éÅý©ú²ÓÀÉ(ARAGPF)       KEY=AG02-AG04
     A*****************************************************************
     A          R AG0                       PFILE(ARAGPF)
     A          K AG02
     A          K AG03
     A          K AG04                      DESCEND
