     A*****************************************************************
     A*          銷貨折讓明細檔(ARAGLF04)
     A*****************************************************************
     A          R AG0                       PFILE(ARAGPF)
     A          K AG04
     A**             ('發票號碼')
     A          K AG02
     A**             ('折讓單號')
