     A*****************************************************************
     A*          應收月結(ARAKLF01)
     A*****************************************************************
     A          R AK0                       PFILE(ARAKPF)
     A          K AK02
     A**              ('公司別')
     A          K AK01                      DESCEND
     A**              ('年月')
