     A          R AO0
     A            AO01          10O         COLHDG('發票號碼')
     A            AO02           8  0       COLHDG('系統產生日期')
     A            AO03          12O         COLHDG('開立日期/批號')
     A            AO04           8O         COLHDG('發票開立狀態')
     A            AO05          10O         COLHDG('備註1')
     A            AO06          12O         COLHDG('前次開立/批號')
     A          K AO01
