     A*****************************************************************
     A*          產品分類代碼檔(BRBEPF)       KEY=BE06+BE01
     A*****************************************************************
     A                                      UNIQUE
     A          R BE0                       PFILE(BRBEPF)
     A          K BE06
      *                                    產品分類代碼
     A          K BE01
      *                                    產品編號
