     A*****************************************************************
     A*      產品分類代碼檔(BRBQPF)
     A*****************************************************************
     A                                      UNIQUE
     A          R BQ0
     A            BQ01           6          COLHDG('產品分類代碼')
     A          K BQ01
