     A*****************************************************************
     A*
     A*****************************************************************
     A          R DC0                       PFILE(DC01PF)
     A          K DC11
     A**              ('公司別')
     A          K DC06
     A**              ('發票日期')
     A          K DC02
     A**              ('發票號碼')
