     A*****************************************************************
     A*           DC對照檔
     A*****************************************************************
     A          R AB0
     A            AB01           3          COLHDG(' DC代號')
     A            AB02          18O         COLHDG(' DC名稱')
     A          K AB01
