     A*****************************************************************
     A*
     A*****************************************************************
     A          R DA0                       PFILE(DCDAPF)
     A          K DA11
     A**              ('辦事處')
     A          K DA06
     A**              ('發票日期')
     A          K DA13
     A**              ('發票號碼')
