     A*****************************************************************
     A*
     A*****************************************************************
     A          R DA0                       PFILE(DCDAPF)
     A          K DA13
     A**              ('µo²¼¸¹½X')
