     A*****************************************************************
     A*          年終成本檔(IMIXLF01)
     A*****************************************************************
     A          R IX0                       PFILE(IMIXPF)
     A          K IX11                      DESCEND
     A**             ('年終年月')
     A          K IX01
     A**             ('產品代號')
