     A*****************************************************************
     A*          產品庫存主檔(IMIAPF)     KEY=IA01+IA02+IA03
     A*****************************************************************
     A                                      REFACCPTH(IMIAPF)
     A          R IA0                       PFILE(IMIAPF)
