     A*****************************************************************
     A*          產品庫存主檔(IMIALF01)   KEY=IA03+IA02+IA01
     A*****************************************************************
     A          R IA0                       PFILE(IMIAPF)
     A            IA02
     A            IA03
     A            IA08
     A            IA10
     A          K IA03
     A**             ('產品代號')
