     A*****************************************************************
     A*          產品庫存主檔(IMIALF03)   KEY=IA02+IA01+IA03
     A*****************************************************************
     A          R IA0                       PFILE(IMIAPF)
     A          K IA02
     A**             ('物流點代號')
     A          K IA01
     A**             ('公司別')
     A          K IA03
     A**             ('產品代號')
