     A*****************************************************************
     A*          產品成本調整資料檔(IMIBLF03) KEY=IB04+IB02
     A*****************************************************************
     A          R IB0                       PFILE(IMIBPF)
     A          K IB04
     A**             ('調整日期')
     A          K IB02
     A**             ('公司別')
     A**SELECT 調整數量者
