     A*****************************************************************
     A*          產品成本調整資料檔(IMIBPF) KEY=IB01+IB02+IB03
     A*****************************************************************
     A          R IB0                       PFILE(IMIBPF)
     A          K IB01
     A          K IB02
     A          K IB03
     A          K IB04
     A          S IB02                      COMP(GE 'K1')
     A            IB02                      COMP(LE 'K3')
