     A*****************************************************************
     A*          產品成本調整資料檔(IMIBPF) KEY=IB02+IB04
     A*****************************************************************
     A          R IB0                       PFILE(IMIBPF)
     A          K IB02
     A**             ('公司別')
     A          K IB04
     A**             ('調整日期')
     A          S IB13                      COMP(NE 0)
     A**SELECT 調整數量者
