     A*****************************************************************
     A*          產品成本調整資料檔(IMIBPF) KEY=IB01+IB02+IB03
     A*****************************************************************
     A                                      REFACCPTH(IMIBPF)
     A          R IB0                       PFILE(IMIBPF)
