     A*****************************************************************
     A*          ¨}Ãa«~Âà´«¥DÀÉ(IMICPF) KEY=IC01+IC05
     A*****************************************************************
     A          R IC0                       PFILE(IMICPF)
     A          K IC01
     A          K IC05
