     A*****************************************************************
     A*          良壞品轉換主檔(IMICLF02) KEY=IC05+IC01
     A*****************************************************************
     A          R IC0                       PFILE(IMICPF)
     A          K IC05
     A**                    ('轉帳日期')
     A          K IC01
     A**                    ('公司別')
