     A*****************************************************************
     A*          良壞品轉換主檔(IMICPF) KEY=IC05+IC02
     A*****************************************************************
     A          R IC0                       PFILE(IMICPF)
     A          K IC05                      DESCEND
     A**              COLHDG('轉帳日期')
     A          K IC02
     A**              COLHDG('單據號碼')
