     A*****************************************************************
     A*          產品報廢主檔(IMIEPF)     KEY=IE01+IE05+IE02
     A*****************************************************************
     A          R IE0                       PFILE(IMIEPF)
     A          K IE01
     A**             ('公司別')
     A          K IE05
     A**             ('報廢日期')
     A          K IE02
     A**             ('單據號碼')
