     A*****************************************************************
     A*          產品報廢主檔(IMIEPF)     KEY=IE05+IE02
     A*****************************************************************
     A          R IE0                       PFILE(IMIEPF)
     A          K IE05                      DESCEND
     A**             ('報廢日期')
     A          K IE02
     A**             ('單據號碼')
