     A*****************************************************************
     A*          存貨調整主檔(IMIGLF02)     KEY=IG05+IG01+IG02
     A*****************************************************************
     A          R IG0                       PFILE(IMIGPF)
     A          K IG05
     A**             ('調整日期')
     A          K IG01
     A**             ('公司別')
     A          K IG02
     A**             ('單據號碼')
