     A*****************************************************************
     A*          存貨調整主檔(IMIGPF)     KEY=IG05+IG02
     A*****************************************************************
     A          R IG0                       PFILE(IMIGPF)
     A          K IG05                      DESCEND
     A**             ('調整日期')
     A          K IG02
     A**             ('單據號碼')
