     A*****************************************************************
     A*          存貨調撥主檔(IMIILF02)     KEY=II06+II01+II02
     A*****************************************************************
     A          R II0                       PFILE(IMIIPF)
     A          K II06
     A**                ('實際入庫日')
     A          K II01
     A**                ('公司別－出貨')
     A          K II02
     A**                ('單據號碼')
