     A*****************************************************************
     A*          ¶s≥fΩ’º∑•D¿…(IMIIPF)     KEY=II02
     A*****************************************************************
     A                                      REFACCPTH(IMIIPF)
     A          R II0                       PFILE(IMIIPF)
