     A*****************************************************************
     A*          ¶s≥fΩ’º∑•D¿…(IMIIPF)     KEY=II02
     A*****************************************************************
     A          R II0                       PFILE(IMIIPF)
     A          K II01
     A          K II06
     A          K II02
