     A*****************************************************************
     A*          ¦s³f½Õ¼·©ú²ÓÀÉ(IMIIPF)     KEY=IJ02+IJ03
     A*****************************************************************
     A                                      REFACCPTH(IMIJPF)
     A          R IJ0                       PFILE(IMIJPF)
