     A*****************************************************************
     A*          ¦s³f½Õ¼·©ú²ÓÀÉ(IMIIPF)     KEY=IJ02+IJ03
     A*****************************************************************
     A          R IJ0                       PFILE(IMIJPF)
     A          K IJ03
     A          S IJ05                      COMP(EQ 0)
