     A*****************************************************************
     A*          禮盒組拆主檔(IMIMLF02)     KEY=IM08+IM01
     A*****************************************************************
     A          R IM0                       PFILE(IMIMPF)
     A          K IM08
     A**                    ('確認日期')
     A          K IM01
     A**                    ('公司別')
