     A*****************************************************************
     A*          Â§²°²Õ©î¥DÀÉ(IMIMPF)     KEY=IM02
     A*****************************************************************
     A          R IM0                       PFILE(IMIMPF)
     A          K IM01
     A          K IM08
