     A*****************************************************************
     A*          禮盒組拆主檔(IMIMLF1)    KEY=IM10+IM02
     A*****************************************************************
     A          R IM0                       PFILE(IMIMPF)
     A          K IM10                      DESCEND
     A**              ('組拆日期')
     A          K IM02
     A**              ('單據號碼')
