     A*****************************************************************
     A*          ¦s³f¤ëµ²ÀÉ(IMINPF)       KEY=IN01+IN02+IN03+IN04
     A*****************************************************************
     A          R IN0                       PFILE(IMINPF)
     A            IN01L     R               COLHDG('¤½¥q§O')
     A                                      RENAME(IN01)
     A            IN02L     R               COLHDG('¦~¤ë')
     A                                      RENAME(IN02)
     A            IN03L     R               COLHDG('ª«¬yÂI¥N¸¹')
     A                                      RENAME(IN03)
     A            IN04L     R               COLHDG('²£«~¥N¸¹')
     A                                      RENAME(IN04)
     A            IN05L     R               COLHDG('´Áªì¦s³f')
     A                                      RENAME(IN05)
     A            IN06L     R               COLHDG('¶i³f')
     A                                      RENAME(IN06)
     A            IN07L     R               COLHDG('¾P³f')
     A                                      RENAME(IN07)
     A            IN08L     R               COLHDG('ÃØ«~')
     A                                      RENAME(IN08)
     A            IN09L     R               COLHDG('¸Õ¶¼')
     A                                      RENAME(IN09)
     A            IN10L     R               COLHDG('°h³f')
     A                                      RENAME(IN10)
     A            IN101L    R               COLHDG('¾P°h·fÃØ')
     A                                      RENAME(IN101)
     A            IN11L     R               COLHDG('±MÂd')
     A                                      RENAME(IN11)
     A            IN12L     R               COLHDG('±H½æ©ñ')
     A                                      RENAME(IN12)
     A            IN13L     R               COLHDG('½Õ¼·')
     A                                      RENAME(IN13)
     A            IN14L     R               COLHDG('½Õ¾ã')
     A                                      RENAME(IN14)
     A            IN15L     R               COLHDG('³ø¼o')
     A                                      RENAME(IN15)
     A            IN16L     R               COLHDG('Â§²°²Õ©î')
     A                                      RENAME(IN16)
     A            IN17L     R               COLHDG('´Á¥½¦s³f')
     A                                      RENAME(IN17)
     A            IN18L     R               COLHDG('¦¬¦^')
     A                                      RENAME(IN18)
     A            IN19L     R               COLHDG('§¹µ|')
     A                                      RENAME(IN19)
     A            IN20L     R               COLHDG('¸g°Ó¸É³f')
     A                                      RENAME(IN20)
     A*
     A            IN23L     R               COLHDG('´Áªì¦s³fFOB')
     A                                      RENAME(IN23)
     A            IN24L     R               COLHDG('´Áªì¦s³fFHI')
     A                                      RENAME(IN24)
     A            IN25L     R               COLHDG('´Áªì¦s³fDUTY')
     A                                      RENAME(IN25)
     A*
     A            IN231L    R               COLHDG('´Áªì¸Õ¶¼¦s³fFOB')
     A                                      RENAME(IN231)
     A            IN241L    R               COLHDG('´Áªì¸Õ¶¼¦s³fFHI')
     A                                      RENAME(IN241)
     A            IN251L    R               COLHDG('´Áªì¸Õ¶¼¦s³fDUTY')
     A                                      RENAME(IN251)
     A*§t¸Õ¶¼¦¨¥»¤§¥[´î
     A            IN26L     R               COLHDG('´Á¥½¦s³fFOB')
     A                                      RENAME(IN26)
     A            IN27L     R               COLHDG('´Á¥½¦s³fFHI')
     A                                      RENAME(IN27)
     A            IN28L     R               COLHDG('´Á¥½¦s³fDUTY')
     A                                      RENAME(IN28)
     A*¸Õ¶¼¦¬¦^¡×ÈÏ¡ÏÈÏ            ¸Õ¶¼¾P°â¬°ÈÏ¡ÐÈÏ
     A            IN261L    R               COLHDG('´Á¥½¸Õ¶¼¦s³fFOB')
     A                                      RENAME(IN261)
     A            IN271L    R               COLHDG('´Á¥½¸Õ¶¼¦s³fFHI')
     A                                      RENAME(IN271)
     A            IN281L    R               COLHDG('´Á¥½¸Õ¶¼¦s³fDUTY')
     A                                      RENAME(IN281)
     A*§t¸Õ¶¼¦¨¥»¤§¾P³f¦¨¥»¦s¡Ï­È
     A            IN29L     R               COLHDG('²Ö­p¾P³fFOB')
     A                                      RENAME(IN29)
     A            IN30L     R               COLHDG('²Ö­p¾P³fFHI')
     A                                      RENAME(IN30)
     A            IN31L     R               COLHDG('²Ö­p¾P³fDUTY')
     A                                      RENAME(IN31)
     A*¦s¡Ï­È
     A            IN291L    R               COLHDG('²Ö­p¸Õ¶¼FOB')
     A                                      RENAME(IN291)
     A            IN301L    R               COLHDG('²Ö­p¸Õ¶¼FHI')
     A                                      RENAME(IN301)
     A            IN311L    R               COLHDG('²Ö­p¸Õ¶¼DUTY')
     A                                      RENAME(IN311)
     A*§t¸Õ¶¼¦¨¥»¤§¾P°h¦¨¥»¦s¡Ï­È
     A            IN32L     R               COLHDG('²Ö­p¾P°hFOB')
     A                                      RENAME(IN32)
     A            IN33L     R               COLHDG('²Ö­p¾P°hFHI')
     A                                      RENAME(IN33)
     A            IN34L     R               COLHDG('²Ö­p¾P°hDUTY')
     A                                      RENAME(IN34)
     A*¦s¡Ï­È
     A            IN321L    R               COLHDG('²Ö­p¸Õ¶¼¦¬¦^FOB')
     A                                      RENAME(IN321)
     A            IN331L    R               COLHDG('²Ö­p¸Õ¶¼¦¬¦^FHI')
     A                                      RENAME(IN331)
     A            IN341L    R               COLHDG('²Ö­p¸Õ¶¼¦¬¦^DUTY')
     A                                      RENAME(IN341)
     A*
     A            IN35L     R               COLHDG('¶i³f°h¦^')
     A                                      RENAME(IN35)
     A            IN36L     R               COLHDG('°h¦^')
     A                                      RENAME(IN36)
     A*                                     ¦¬¦^«á°h¦^²£«~ÂkÄÝ¤½¥q
     A            IN37L     R               COLHDG('¸g¤í­qÁÊ')
     A                                      RENAME(IN37)
     A*                                     FOR¢Ò¢¶
     A            IN38L     R               COLHDG('¸g¤í·fÃØ')
     A                                      RENAME(IN38)
     A*                                     FOR¢Ò¢¶
     A            IN39L     R               COLHDG('¸g¤í¦X­p')
     A                                      RENAME(IN39)
     A*                                     FOR¢Ò¢·
     A            IN40L     R               COLHDG('¸Õ¶¼°h¦^')
     A                                      RENAME(IN40)
     A            IN41L     R               COLHDG('½LÂI®t²§')
     A                                      RENAME(IN41)
     A            INXXL     R               COLHDG('²§°Ê¤é´Á')
     A                                      RENAME(INXX)
     A            INYYL     R               COLHDG('²§°Ê®É¶¡')
     A                                      RENAME(INYY)
     A            INZZL     R               COLHDG('²§°ÊªÌ¡@')
     A                                      RENAME(INZZ)
     A          K IN01L
     A          K IN02L
     A          K IN03L
     A          K IN04L
     A          O IN02L                     COMP(NE 9304)
     A          O IN01L                     COMP(NE 'C')
