     A*****************************************************************
     A*          ¶s≥f§Îµ≤¿…(IMINPF)       KEY=IN01+IN02+IN03+IN04
     A*****************************************************************
     A          R IN0                       PFILE(IMINPF)
     A          K IN04
     A          K IN02
     A          S IN01                      COMP(EQ 'R')
     A            IN03                      RANGE('T    ' 'W9999')
