     A*****************************************************************
     A*          ¶s≥f§Îµ≤¿…(IMINPF)       KEY=IN01+IN02+IN03+IN04
     A*****************************************************************
     A          R IN0                       PFILE(IMINPF)
     A          K IN02
     A          K IN01
     A          K IN03
     A          K IN04
