     A*****************************************************************
     A*          ¦s³f¤ëµ²ÀÉ(IMINPF)       KEY=IN01+IN02+IN03+IN04
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R IN0
     A            IN01      R               COLHDG('¤½¥q§O')
B2CHKA            IN02      R    6 00       COLHDG('¦~¤ë')
     A            IN03      R               COLHDG('ª«¬yÂI¥N¸¹')
     A            IN04      R               COLHDG('²£«~¥N¸¹')
     A            IN05      R               COLHDG('´Áªì¦s³f')
     A            IN06      R               COLHDG('¶i³f')
     A            IN07      R               COLHDG('¾P³f')
     A            IN08      R               COLHDG('ÃØ«~')
     A            IN09      R               COLHDG('¸Õ¶¼')
     A            IN10      R               COLHDG('°h³f')
     A            IN101     R               COLHDG('¾P°h·fÃØ')
     A            IN11      R               COLHDG('±MÂd')
     A            IN12      R               COLHDG('±H½æ©ñ')
     A            IN13      R               COLHDG('½Õ¼·')
     A            IN14      R               COLHDG('½Õ¾ã')
     A            IN15      R               COLHDG('³ø¼o')
     A            IN16      R               COLHDG('Â§²°²Õ©î')
     A            IN17      R               COLHDG('´Á¥½¦s³f')
     A            IN18      R               COLHDG('¦¬¦^')
     A            IN19      R               COLHDG('§¹µ|')
     A            IN20      R               COLHDG('¸g°Ó¸É³f')
     A*
     A            IN23      R               COLHDG('´Áªì¦s³fFOB')
     A            IN24      R               COLHDG('´Áªì¦s³fFHI')
     A            IN25      R               COLHDG('´Áªì¦s³fDUTY')
     A*
     A            IN231     R               COLHDG('´Áªì¸Õ¶¼¦s³fFOB')
     A            IN241     R               COLHDG('´Áªì¸Õ¶¼¦s³fFHI')
     A            IN251     R               COLHDG('´Áªì¸Õ¶¼¦s³fDUTY')
     A*§t¸Õ¶¼¦¨¥»¤§¥[´î
     A            IN26      R               COLHDG('´Á¥½¦s³fFOB')
     A            IN27      R               COLHDG('´Á¥½¦s³fFHI')
     A            IN28      R               COLHDG('´Á¥½¦s³fDUTY')
     A*¸Õ¶¼¦¬¦^¡×ÈÏ¡ÏÈÏ            ¸Õ¶¼¾P°â¬°ÈÏ¡ÐÈÏ
     A            IN261     R               COLHDG('´Á¥½¸Õ¶¼¦s³fFOB')
     A            IN271     R               COLHDG('´Á¥½¸Õ¶¼¦s³fFHI')
     A            IN281     R               COLHDG('´Á¥½¸Õ¶¼¦s³fDUTY')
     A*§t¸Õ¶¼¦¨¥»¤§¾P³f¦¨¥»¦s¡Ï­È
     A            IN29      R               COLHDG('²Ö­p¾P³fFOB')
     A            IN30      R               COLHDG('²Ö­p¾P³fFHI')
     A            IN31      R               COLHDG('²Ö­p¾P³fDUTY')
     A*¦s¡Ï­È
     A            IN291     R               COLHDG('²Ö­p¸Õ¶¼FOB')
     A            IN301     R               COLHDG('²Ö­p¸Õ¶¼FHI')
     A            IN311     R               COLHDG('²Ö­p¸Õ¶¼DUTY')
     A*§t¸Õ¶¼¦¨¥»¤§¾P°h¦¨¥»¦s¡Ï­È
     A            IN32      R               COLHDG('²Ö­p¾P°hFOB')
     A            IN33      R               COLHDG('²Ö­p¾P°hFHI')
     A            IN34      R               COLHDG('²Ö­p¾P°hDUTY')
     A*¦s¡Ï­È
     A            IN321     R               COLHDG('²Ö­p¸Õ¶¼¦¬¦^FOB')
     A            IN331     R               COLHDG('²Ö­p¸Õ¶¼¦¬¦^FHI')
     A            IN341     R               COLHDG('²Ö­p¸Õ¶¼¦¬¦^DUTY')
     A*
     A            IN35      R               COLHDG('¶i³f°h¦^')
     A            IN36      R               COLHDG('°h¦^')
     A*                                     ¦¬¦^«á°h¦^²£«~ÂkÄÝ¤½¥q
     A            IN37      R               COLHDG('¸g¤í­qÁÊ')
     A*                                     FOR¢Ò¢¶
     A            IN38      R               COLHDG('¸g¤í·fÃØ')
     A*                                     FOR¢Ò¢¶
     A            IN39      R               COLHDG('¸g¤í¦X­p')
     A*                                     FOR¢Ò¢·
     A            IN40      R               COLHDG('¸Õ¶¼°h¦^')
     A            IN41      R               COLHDG('½LÂI®t²§')
B2CHKA            INXX      R    8 00       COLHDG('²§°Ê¤é´Á')
     A            INYY      R               COLHDG('²§°Ê®É¶¡')
     A            INZZ      R               COLHDG('²§°ÊªÌ¡@')
     A          K IN01
     A          K IN02
     A          K IN03
     A          K IN04
