     A*****************************************************************
     A*          ΩL¬I≥Ê¿…¿…(IMIOLF02)
     A*****************************************************************
     A          R IO0                       PFILE(IMIOPF)
     A          K IO02
     A          K IO03
     A          K IO01
     A          K IO04
     A          O IO11                      COMP(NE ' ')
