     A*****************************************************************
     A*          ΩL¬I≥Ê¿…¿…(IMIOLF01)
     A*****************************************************************
     A          R IO0                       PFILE(IMIOPF)
     A          K IO01
     A          K IO02
     A          K IO04
     A          K IO03
