     A*****************************************************************
     A*          ΩL¬I≥Ê¿…¿…(IMIOLF)
     A*****************************************************************
     A                                      REFACCPTH(IMIOLF03)
     A          R IO0                       PFILE(IMIOPF)
