     A*****************************************************************
     A*          產品庫存主檔(IMITLF01)   KEY=IT02+IT01+IT03
     A*****************************************************************
     A          R IT0                       PFILE(IMITPF)
     A          K IT02
     A**             ('物流點代號')
     A          K IT01
     A**             ('公司別')
     A          K IT03
     A**             ('產品代號')
