     A*****************************************************************
     A*          盤盈虧檔(IMIULF01)       KEY=IU04+IU01+IU02
     A*****************************************************************
     A          R IU0                       PFILE(IMIUPF)
     A          K IU04
     A**                ('盤點日期')
     A          K IU01
     A**                ('公司別')
     A          K IU02
     A**                ('單據號碼')
