     A*****************************************************************
     A*          盤盈虧檔(IMIULF02)       KEY=IU04+IU05+IU03
     A*****************************************************************
     A          R IU0                       PFILE(IMIUPF)
     A          K IU04                      DESCEND
     A**                ('盤點日期')
     A          K IU05
     A**                ('產品代號')
     A          K IU03
     A**                ('物流點代號')
