     A*****************************************************************
     A*          年終庫存檔(IMIYLF01)   KEY=IY03+IY02+IY01
     A*****************************************************************
     A          R IY0                       PFILE(IMIYPF)
     A          K IY15
     A**             ('年終年月')
     A          K IY03
     A**             ('產品代號')
     A          K IY02
     A**             ('物流點代號')
     A          K IY01
     A**             ('公司別')
