     A*****************************************************************
     A*          產品基本資料檔(MTMALF02) KEY=MA10+MA01
     A*****************************************************************
     A          R MA0                       PFILE(MTMAPF)
     A          K MA10
     A          K MA01
