     A*****************************************************************
     A*          產品基本資料檔(MTMAPF)   KEY=MA01
     A*****************************************************************
     A                                      REFACCPTH(MTMAPF)
     A          R MA0                       PFILE(MTMAPF)
