     A*****************************************************************
     A*          產品基本資料檔(MTMALF03) KEY=MA01
     A*****************************************************************
     A          R MA0                       PFILE(MTMAPF)
     A          K MA01
     A          S MA58                      COMP(EQ 'I')
