     A*****************************************************************
     A*          產品基本資料檔(MTMALF06) KEY=MA12
     A*****************************************************************
     A          R MA0                       PFILE(MTMAPF)
      *
     A          K MA12
