     A*****************************************************************
     A*          產品基本資料檔(MTMALF05) KEY=MA10+MA11
     A*****************************************************************
     A          R MA0                       PFILE(MTMAPF)
     A            MA10      R               COLHDG('產品品牌')
     A            MA11      R               COLHDG('產品等級')
     A          K MA10
     A          K MA11                      DESCEND
