     A*****************************************************************
     A*          費用商基本資料檔(MTMBLF01) KEY=MB03+MB01
     A*****************************************************************
     A          R MB0                       PFILE(MTMBPF)
     A          K MB03
     A**             ('費用商簡稱')
     A          K MB01
     A**             ('費用商代號')
     A          S MB24                      COMP(EQ '0')
