     A*****************************************************************
     A*          供應商基本資料檔(MTMBPF) KEY=MB02
     A*****************************************************************
     A          R MB0                       PFILE(MTMBPF)
     A          K MB01
     A**             ('供應商代號')
     A          O MB24                      COMP(EQ '0')
