     A*****************************************************************
     A*          供應商基本資料檔(MTMBLF01) KEY=MB03+MB01
     A*****************************************************************
     A          R MB0                       PFILE(MTMBPF)
     A          K MB03
     A**             ('供應商簡稱')
     A          K MB01
     A**             ('供應商代號')
     A          O MB24                      COMP(EQ '0')
