     A*****************************************************************
     A*          員工基本資料檔(MAMCPF)   KEY=MC03+MC01
     A*****************************************************************
     A          R MC0                       PFILE(MTMCPF)
     A          K MC03
     A**             ('部門組別')
     A          K MC01
     A**             ('員工代號')
     A          S MC06                      COMP(EQ 0)
