     A*****************************************************************
     A*          員工基本資料檔(MAMCPF)   KEY=MC01
     A*****************************************************************
     A                                      REFACCPTH(MTMCPF)
     A          R MC0                       PFILE(MTMCPF)
