     A*****************************************************************
     A*          員工基本資料檔(MAMCPF)   KEY=MC01
     A*****************************************************************
     A          R MC0                       PFILE(MTMCPF)
     A          K MC02
     A**             ('員工姓名')
     A          K MC01
     A**             ('員工代號')
     A          S MC06                      COMP(EQ 0)
