     A*****************************************************************
     A*          客戶基本資料檔(MTMDPF)   KEY=MD06
     A*****************************************************************
     A          R MD0                       PFILE(MTMDPF)
     A          K MD06
