     A*****************************************************************
     A*          客戶基本資料檔(MTMDPF)   KEY=MD01
     A*****************************************************************
     A                                      REFACCPTH(MTMDPF)
     A          R MD0                       PFILE(MTMDPF)
