     A*****************************************************************
     A*          客戶基本資料檔(MTMDLF01) KEY=MD07+MD08+MD01
     A*****************************************************************
     A          R MD0                       PFILE(MTMDPF)
     A          K MD07
     A**             ('通路')
     A          K MD08
     A**             ('型態')
     A          K MD01
     A**             ('客戶代號')
