     A*****************************************************************
     A*          客戶分店資料檔(MTMEPF)   KEY=ME04
     A*****************************************************************
     A          R ME0                       PFILE(MTMEPF)
     A          K ME04
     A**             ('分店簡稱')
