     A*****************************************************************
     A*          客戶分店資料檔(MTMEPF)   KEY=ME01+ME02
     A*****************************************************************
     A                                      REFACCPTH(MTMEPF)
     A          R ME0                       PFILE(MTMEPF)
