     A*****************************************************************
     A*          客戶分店資料檔(MTMEPF)   KEY=ME01
     A*****************************************************************
     A          R ME0                       PFILE(MTMEPF)
     A          K ME01
     A**             ('客戶代號')
     A          K ME02
     A**             ('分店代號')
     A          S ME01                      RANGE('Z0000' 'Z9999')
     A**             ('員工檔')
