     A*****************************************************************
     A*          客戶分店資料檔(MTMEPF)   KEY=ME03
     A*****************************************************************
     A          R ME0                       PFILE(MTMEPF)
     A          K ME03
     A          K ME01
     A          K ME02
     A**             ('分店簡稱')
