     A*****************************************************************
     A*          客戶分店資料檔(MTMEPF)   KEY=ME01
     A*****************************************************************
     A          R ME0                       PFILE(MTMEPF)
     A          K ME01
     A**             ('客戶代號')
     A          K ME02
     A**             ('分店代號')
     A          S ME20                      COMP(EQ 'I')
     A**             ('往來狀態－INACTION')
