     A*****************************************************************
     A*          Â§²°µ²ºc¸ê®ÆÀÉ(MTMFLF)   KEY=MF01+MF02
     A*****************************************************************
     A          R MF0                       PFILE(MTMFPF)
     A          K MF01
     A          K MF02
     A          S MF07                      COMP(NE 'Y')
