     A*****************************************************************
     A*          Â§²°µ²ºc¸ê®ÆÀÉ(MTMFLF)   KEY=MF01+MF02
     A*****************************************************************
     A                                      REFACCPTH(MTMFPF)
     A          R MF0                       PFILE(MTMFPF)
