     A*****************************************************************
     A*          專櫃ＰＬＵ檔(MTMGLF)   KEY=MG02
     A*****************************************************************
     A          R MG0                       PFILE(MTMGPF)
     A          K MG02
     A*               ('產品代號')
