     A*****************************************************************
     A*          ±MÂd¢Þ¢Ú¢ãÀÉ(MTMGLF)   KEY=MG01
     A*****************************************************************
     A                                      REFACCPTH(MTMGPF)
     A          R MG0                       PFILE(MTMGPF)
