     A*****************************************************************
     A*          ±MÂdPLUÀÉ (MTMGPF)   KEY=MG03 + MG01
     A*****************************************************************
     A          R MG0                       PFILE(MTMGPF)
     A          K MG03
     A          K MG01
