     A*****************************************************************
     A*          產品基本資料檔(MTMHLF04) KEY=MA01
     A*****************************************************************
     A          R MA0                       PFILE(MTMHPF)
     A          K MA01
     A          O MA26                      COMP(NE 0)
     A          O MA27                      COMP(NE 0)
     A          O MA28                      COMP(NE 0)
