     A*****************************************************************
     A*          產品基本資料檔(MTMHLF01) KEY=MA01
     A*****************************************************************
     A          R MA0                       PFILE(MTMHPF)
     A          K MA01
     A          S MA54                      COMP(EQ 'Y')
