     A*****************************************************************
     A*          產品基本資料檔(MTMHPF)   KEY=MA01
     A*****************************************************************
     A          R MA0L                      PFILE(MTMHPF)
     A            MA01L     R               COLHDG('產品代號')
     A                                      RENAME(MA01)
     A            MA15L     R               COLHDG('容積')
     A                                      RENAME(MA15)
     A          K MA01L
