     A*****************************************************************
     A*          產品基本資料檔(MTMHLF03) KEY=MA01
     A*****************************************************************
     A          R MA0                       PFILE(MTMHPF)
     A          K MA01
     A          S MA58                      COMP(EQ 'I')
