     A*****************************************************************
     A*          產品基本資料檔(MTMHPF)   KEY=MA01
     A*****************************************************************
     A                                      REFACCPTH(MTMHPF)
     A          R MA0                       PFILE(MTMHPF)
