     A*****************************************************************
     A*          產品基本資料延伸檔
     A*****************************************************************
     A          R MI0                       PFILE(MTMIPF)
     A          K MA01
