     A*****************************************************************
     A*          產品基本資料檔(MTMQPF)   KEY=MQ01
     A*****************************************************************
      *針對轉檔資料有問題的資料(只提供給轉檔程式用)
     A                                      UNIQUE
     A          R MQ0
     A            MQ01           9A         COLHDG('產品代號')
     A*
     A          K MQ01
