     A*****************************************************************
     A*          產品單位成本工作檔
     A*****************************************************************
      *
     A                                      UNIQUE
     A          R WF0
     A            WF01           1A         COLHDG('公司別')
     A            WF02           9A         COLHDG('產品代號')
     A            WF03           7S 2       COLHDG('單位成本')
     A*
     A          K WF02
