     A*****************************************************************
     A*          費用代碼對照檔(NPNGPF)       KEY=NG02
     A*****************************************************************
     A                                      UNIQUE
     A          R NG0                       PFILE(NPNGPF)
     A          K NG02
      *                                    ＡＭＰCODE
