     A                                      UNIQUE
     A          R P68R
     A            P6801          2S 0       COLHDG('PRT CODE')
     A            P6803         10A         COLHDG('PRT NAME')
     A            P6804         10A         COLHDG('OUTQ')
     A            P6805         22O         COLHDG('PRT DEST')
     A          K P6801
