     A*****************************************************************
     A*          單別資料檔(PA#2LF01)     KEY=#201+#202
     A*****************************************************************
     A          R #20                       PFILE(PA#2PF)
     A          K #202
     A          S #221                      COMP(EQ 'Y')
