     A*****************************************************************
     A*          部門品牌對照資料檔(PA#CPF) KEY=#C01+#C02
     A*****************************************************************
     A                                      REFACCPTH(PA#3PF)
     A          R #30                       PFILE(PA#3PF)
