     A*****************************************************************
     A*          部門成本中心對照資料檔(PA#4LF) KEY=#401
     A*****************************************************************
     A                                      REFACCPTH(PA#4PF)
     A          R #40                       PFILE(PA#4PF)
