     A*****************************************************************
     A*          試飲Ａ＆Ｐ對照資料檔(PA#5LF) KEY=#501
     A*****************************************************************
     A                                      REFACCPTH(PA#5PF)
     A          R #50                       PFILE(PA#5PF)
