     A*****************************************************************
     A*          部門品牌對照資料檔(PA#CPF) KEY=#C01+#C02
     A*****************************************************************
     A                                      REFACCPTH(PA#6PF)
     A          R #60                       PFILE(PA#6PF)
