     A*****************************************************************
     A*          新產品種類代碼檔(PA#7PF)       KEY=#702
     A*****************************************************************
     A          R #70                       PFILE(PA#7PF)
     A          K #702
