     A*****************************************************************
     A*          格式代碼資料檔(PA#9PF)   KEY=#902+#903
     A*****************************************************************
     A          R #90                       PFILE(PA#9PF)
     A**
     A          K #902
     A**             ('格式代碼')
     A          K #903
     A**             ('格式說明')
     A          S #902                      RANGE('31' '36')
     A**             ('格式代碼')        銷項格式
