     A*****************************************************************
     A*          稅別代碼資料檔(PA#9PF)   KEY=#902+#903
     A*****************************************************************
     A          R #90                       PFILE(PA#9PF)
     A**
     A          K #902
     A**             ('稅別代碼')
     A          K #903
     A**             ('稅別說明')
     A          S #901                      COMP(EQ 'DUTY')
     A**             ('代碼欄位')
