     A*****************************************************************
     A*          ³W«h¥N½XÀÉ(PA#APF)       KEY=#A01+#A02
     A*****************************************************************
     A                                      REFACCPTH(PA#APF)
     A          R #A0                       PFILE(PA#APF)
