     A*****************************************************************
     A*          容量代碼檔　　(PA#APF)   KEY=#A02+#A03
     A*****************************************************************
     A          R #A0                       PFILE(PA#APF)
     A**
     A          K #A02
     A**             ('容量代碼')
     A          K #A03
     A**             ('容量說明')
     A          S #A01                      COMP(EQ 'SIZE')
     A**             ('代碼欄位')
