     A*****************************************************************
     A*          客戶試飲原因資料檔(PA#APF)   KEY=#A02+#A03
     A*****************************************************************
     A          R #A0                       PFILE(PA#APF)
     A**
     A          K #A02
     A**             ('試飲原因')
     A          K #A03
     A**             ('試飲說明')
     A          S #A01                      COMP(EQ 'STOCK')
     A**             ('代碼欄位')
