     A*****************************************************************
     A*          客戶集團代號資料檔(PA#APF)   KEY=#A02+#A03
     A*****************************************************************
     A          R #A0                       PFILE(PA#APF)
     A**
     A          K #A02
     A**             ('集團代號')
     A          K #A03
     A**             ('集團說明')
     A          S #A01                      COMP(EQ 'CUSTGRP')
     A**             ('代碼欄位')
