     A*****************************************************************
     A*          品牌代號資料檔(PA#APF)   KEY=#A02+#A03
     A*****************************************************************
     A          R #A0                       PFILE(PA#APF)
     A**
     A          K #A02
     A**             ('品牌代號')
     A          K #A03
     A**             ('品牌說明')
     A          S #A01                      COMP(EQ 'BRAND')
     A**             ('代碼欄位')
