     A*****************************************************************
     A*          員工基本資料檔(PA#APF)   KEY=#A02+#A03
     A*****************************************************************
     A          R #A0                       PFILE(PA#APF)
     A**
     A          K #A02
     A**             ('部門代號')
     A          K #A03
     A**             ('部門組別')
     A          S #A01                      COMP(EQ 'SHOPDEPT')
     A**             ('代碼欄位')
