     A*****************************************************************
     A*          公司檔(PA#BLF01)         KEY=#B14+#B15
     A*****************************************************************
     A          R #B0                       PFILE(PA#BPF)
     A          K #B14
     A*               ('客戶代號')
     A          K #B15
     A*               ('分店代號')
