     A*****************************************************************
     A*          §Ω•q¿…(PA#BLF)           KEY=#B01
     A*****************************************************************
     A                                      REFACCPTH(PA#BPF)
     A          R #B0                       PFILE(PA#BPF)
