     A*****************************************************************
     A*          銷售通路型態資料檔(PA#CPF) KEY=#C01+#C02
     A*****************************************************************
     A                                      REFACCPTH(PA#CPF)
     A          R #C0                       PFILE(PA#CPF)
