     A*****************************************************************
     A*          銷售地區資料檔(PA#DPF)   KEY=#D01
     A*****************************************************************
     A                                      REFACCPTH(PA#DPF)
     A          R #D0                       PFILE(PA#DPF)
