     A*****************************************************************
     A*          銷售地區區域資料檔(PA#EPF) KEY=#E01+#E02
     A*****************************************************************
     A                                      REFACCPTH(PA#EPF)
     A          R #E0                       PFILE(PA#EPF)
