     A*****************************************************************
     A*    規則代碼檔－數字(PA#HPF)       KEY=#H02
     A*****************************************************************
     A          R #H0                       PFILE(PA#HPF)
     A          K #H02
