     A*****************************************************************
     A*    規則代碼檔－數字(PA#HPF)       KEY=#H01+#H02
     A*****************************************************************
     A                                      REFACCPTH(PA#HPF)
     A          R #H0                       PFILE(PA#HPF)
