     A*****************************************************************
     A*    專櫃部門抽成比率檔 (PA#JLF)       KEY=#J01+#J02
     A*****************************************************************
     A                                      REFACCPTH(PA#JPF)
     A          R #J0                       PFILE(PA#JPF)
