     A*****************************************************************
     A*          銷售大區域資料檔(PA#LPF)   KEY=#L01
     A*****************************************************************
     A                                      REFACCPTH(PA#LPF)
     A          R #L0                       PFILE(PA#LPF)
