     A*****************************************************************
     A*          銷售大區域地區資料檔(PA#MPF) KEY=#M01+#M02
     A*****************************************************************
     A                                      REFACCPTH(PA#MPF)
     A          R #M0                       PFILE(PA#MPF)
