     A*****************************************************************
     A*          地理區代碼資料檔(PA#NPF)   KEY=#N01
     A*****************************************************************
     A                                      REFACCPTH(PA#NPF)
     A          R #N0                       PFILE(PA#NPF)
