     A*****************************************************************
     A*          地理區地區代碼資料檔(PA#OPF) KEY=#O01+#O02
     A*****************************************************************
     A                                      REFACCPTH(PA#OPF)
     A          R #O0                       PFILE(PA#OPF)
