     A*****************************************************************
     A*          試飲ＡＭＰ對照檔(PA#PPF)       KEY=#P01
     A*****************************************************************
     A                                      UNIQUE
     A          R #P0                       PFILE(PA#PPF)
     A          K #P01
      *                                    試飲原因
