     A*****************************************************************
     A*          供應商產品報價檔(POPALF02)
     A*****************************************************************
     A          R PA0                       PFILE(POPAPF)
     A          K PA01
     A**             ('供應商代號')
     A          K PA04
     A**             ('生效日期')
     A          K PA03
     A**             ('產品代號')
     A          K PA02
     A**             ('報價單號')
