     A*****************************************************************
     A*          供應商產品報價檔(POPALF01)
     A*****************************************************************
     A          R PA0                       PFILE(POPAPF)
     A          K PA03
     A**             ('產品代號')
