     A*****************************************************************
     A*          供應商產品報價檔(POPAPF) KEY=PA01-PA03
     A*****************************************************************
     A          R PA0                       PFILE(POPAPF)
     A          K PA01
     A**             ('供應商代號')
     A          K PA02
     A**             ('報價單號')
     A          K PA03
     A**             ('產品代號')
     A          S PA12                      COMP(NE 'K')
     A**             ('產品歸屬')
