     A*****************************************************************
     A*          供應商產品報價檔(POPAPF) KEY=PA01-PA03
     A*****************************************************************
     A                                      REFACCPTH(POPAPF)
     A          R PA0                       PFILE(POPAPF)
