     A*****************************************************************
     A*          ±ƒ¡ ≥Ê•D¿…(POPBPF)       KEY=PB02
     A*****************************************************************
     A                                      REFACCPTH(POPBPF)
     A          R PB0                       PFILE(POPBPF)
