     A*****************************************************************
     A*          採購單主檔(POPBLF01)     KEY=PB05+PB04+PB02
     A*****************************************************************
     A          R PB0                       PFILE(POPBPF)
     A          K PB05
     A**             ('供應商代號')
     A          K PB04
     A**             ('採購日期')
     A          K PB02
     A**             ('採購單號')
