     A*****************************************************************
     A*          ±ƒ¡ ≥Ê•D¿…(POPBPF)       KEY=PB05+PB02
     A*****************************************************************
     A          R PB0                       PFILE(POPBPF)
     A          K PB05
     A          K PB04                      DESCEND
     A          K PB02
     A          S PB19                      COMP(NE 'V')
