     A*****************************************************************
     A*          ±ƒ¡ ≥Ê•D¿…(POPBPF)
     A*****************************************************************
     A          R PB0                       PFILE(POPBPF)
     A          K PB11
