     A*****************************************************************
     A*          採購明細檔(POPCLF01)     KEY=PC03+PC02
     A*****************************************************************
     A          R PC0                       PFILE(POPCPF)
     A          K PC03
     A***            ('產品代號')
     A          K PC02
     A***            ('採購單號')
     A          S PC12                      COMP(EQ ' ')
     A            PC11                      COMP(NE PC06)
