     A*****************************************************************
     A*          國外採購驗收主檔(POPDLF01) KEY=PD01+PD04+PD02
     A*****************************************************************
     A          R PD0                       PFILE(POPDPF)
     A          K PD01
     A**             ('公司別')
     A          K PD04
     A**             ('進貨日期')
     A          K PD02
     A**             ('驗收單號')
