     A*****************************************************************
     A*          國外採購驗收主檔(POPDPF) KEY=PD02
     A*****************************************************************
     A          R PD0                       PFILE(POPDPF)
     A          K PD04                      DESCEND
     A          K PD02
