     A*****************************************************************
     A*          國外採購驗收主檔(POPDPF) KEY=PD02
     A*****************************************************************
     A                                      REFACCPTH(POPDPF)
     A          R PD0                       PFILE(POPDPF)
