     A*****************************************************************
     A*          國外採購驗收明細檔(POPELF01)
     A*****************************************************************
     A          R PE0                       PFILE(POPEPF)
     A          K PE03
     A*               ('採購單號')
     A          K PE04
     A*               ('產品代號')
     A          K PE02
     A*               ('驗收單號')
