     A*****************************************************************
     A*          國外採購驗收明細檔(POPELF03)
     A*****************************************************************
     A          R PE0                       PFILE(POPEPF)
     A          K PE04
     A*               ('產品代號')
     A          K PE05
     A*               ('進貨日期')
     A          K PE02
     A*               ('驗收單號')
