     A*****************************************************************
     A*          國外採購完稅主檔(POPFLF02) KEY=PF04+PF01+PF02
     A*****************************************************************
     A          R PF0                       PFILE(POPFPF)
     A          K PF11
     A**             ('倉庫確認日')
     A          K PF01
     A**             ('公司別')
     A          K PF02
     A**             ('驗收單號')
