     A*****************************************************************
     A*          國外採購完稅主檔(POPFLF01) KEY=PF04+PF02
     A*****************************************************************
     A          R PF0                       PFILE(POPFPF)
     A*
     A          K PF04                      DESCEND
     A**             ('完稅日期')
     A          K PF02
     A**             ('驗收單號')
