     A*****************************************************************
     A*          國外採購完稅明細檔(POPGLF01) KEY=PG03+PG04+PG02
     A*****************************************************************
     A          R PG0                       PFILE(POPGPF)
     A          K PG03
     A*               ('產品代號')
     A          K PG04
     A*               ('完稅日期')
     A          K PG02
     A*               ('驗收單號')
