     A*****************************************************************
     A*          國內採購驗收主檔(POPHPF) KEY=PH04+PH05
     A*****************************************************************
     A          R PH0                       PFILE(POPHPF)
     A          K PH04
     A**             ('進貨日期')
     A          K PH05
     A**             ('進貨物流點')
