     A*****************************************************************
     A*          國內採購驗收主檔(POPHLF02) KEY=PH04+PH01+PH02
     A*****************************************************************
     A          R PH0                       PFILE(POPHPF)
     A          K PH04
     A**             ('進貨日期')
     A          K PH01
     A**             ('公司別')
     A          K PH02
     A**             ('驗收單號')
