     A*****************************************************************
     A*          國內採購驗收主檔(POPHPF) KEY=PH01+PH04+PH02
     A*****************************************************************
     A          R PH0                       PFILE(POPHPF)
     A*
     A          K PH04                      DESCEND
     A**             ('進貨日期')
     A          K PH02
     A**             ('驗收單號')
