     A*****************************************************************
     A*          國內採購驗收明細檔(POPILF01)
     A*****************************************************************
     A          R PI0                       PFILE(POPIPF)
     A          K PI04
     A*               ('產品代號')
     A          K PI05
     A*               ('進貨日期')
     A          K PI02
     A*               ('驗收單號')
