     A*****************************************************************
     A*          國內採購驗收明細檔(POPILF01)
     A*****************************************************************
     A          R PI0                       PFILE(POPIPF)
     A          K PI01
     A*               ('公司別')
     A          K PI03
     A*               ('採購單號')
     A          K PI05
     A*               ('進貨日期')
