     A*****************************************************************
     A*          ±ÄÁÊ³Æµù¸ê®ÆÀÉ(POPJPF)   KEY=PJ01+PJ02
     A*****************************************************************
     A                                      REFACCPTH(POPJPF)
     A          R PJ0                       PFILE(POPJPF)
