     A*****************************************************************
     A*          發票號碼設定資料檔(POR067LF)KEY=EX01
     A*****************************************************************
     A          R EX0                       PFILE(POR067PF)
     A          K EX01
     A**              ('項目')
