     A*****************************************************************
     A*          績效獎金發放檔(POR997WF01)
     A*****************************************************************
     A          R WF0                       PFILE(POR997WF)
     A          K WF01
     A          K WF03
     A          K WF05
