     A*****************************************************************
     A*           F4 HELP FILE (PUBF4L)       KEY=FPPGM+FPSCR+FPROW
     A*****************************************************************
     A          R F4REC                     PFILE(PUBF4F)
     A*
     A          K FPPGM
     A          K FPSCR
     A          K FPROW
