     A*
     A* 注意：如下列檔案有增加或刪除欄位之情形時，須同步更新　檔案整
     A*          理副程式(DPA0421)
     A*
     A*         01   POPGPF  國外採購完稅明細檔
     A*         02   ARADPF  收款沖帳明細檔
     A*         03   IMIDPF  良壞品轉換明細檔
     A*         04   IMIJPF  存貨調撥明細檔
     A*         05   SOSDPF  銷售訂單明細檔
     A*         06   SOSFPF  送貨單明細檔
     A*         07   SOSHPF  銷貨退回明細檔
     A*         08   SOSJPF  發票明細檔
     A*         09   SOSOPF  產品收回明細檔
     A*         10   SOSQPF  經銷商送貨累計檔
     A*         11   SOSRPF  禮盒銷售分析成本檔
     A*
     A*****************************************************************
     A*      共同資料: RE@___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |RE@APF|採購單號流水號檔          |@A01+@A02+@A03+@A04 |
     A*  02  |RE@BPF|驗收單號流水號檔          |@B01+@B02+@B03      |
     A*  03  |RE@CPF|銷售訂單流水號檔          |@C01+@C02+@C03      |
     A*  04  |RE@DPF|送貨單號流水號檔          |@D01+@D02+@D03      |
     A*  05  |RE@EPF|銷售退回單號流水號檔      |@E01+@E02+@E03      |
     A*  06  |RE@FPF|調撥單號流水號檔          |@F01+@F02+@F03+@F04 |
     A*  07  |RE@GPF|調整號碼流水號檔          |@G01+@G02+@G03+@G04 |
     A*  08  |RE@HPF|良壞轉換單號流水號檔      |@H01+@H02+@H03+@H04 |
     A*  09  |RE@IPF|成本調整單號流水號檔      |@I01+@I02+@I03      |
     A*  10  |RE@JPF|報廢單號流水號檔          |@J01+@J02+@J03+@J04 |
     A*  11  |RE@KPF|折讓單號流水號檔          |@K01+@K02+@K03      |
     A*  12  |RE@LPF|禮盒組拆單號流水號檔      |@L01+@L02+@L03      |
     A*  13  |RE@MPF|產品收回單號流水號檔      |@M01+@M02+@M03+M04  |
     A*  14  |RE@OPF|盤點單號流水號檔          |@O01+@O02+@O03      |
     A*****************************************************************
     A*      代碼資料: PA#___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |PA#1PF|代碼欄位檔                |#101                |
     A*  02  |PA#2PF|單別資料檔                |#201+#202           |
     A*  03  |PA#APF|規則代碼檔                |#A01+#A02           |
     A*  04  |PA#BPF|公司檔                    |#B01                |
     A*  05  |PA#CPF|銷售通路型態資料檔        |#C01+#C02           |
     A*  06  |PA#DPF|銷售地區資料檔            |#D01                |
     A*  07  |PA#EPF|銷售地區區域資料檔        |#E01+#E02           |
     A*  08  |PA#FLF|物流點資料檔代碼∣∣客戶|#F01                |
     A*  09  |PA#GPF|傳票介面控制檔            |#G01                |
     A*  10  |PA#HPF|規則代碼檔－數字          |#H01                |
     A*  11  |PA#IPF|銷售月結控制檔            |#I01                |
     A*  12  |PA#JPF|專櫃部門抽成比率檔        |#J01+#J02           |
     A*  13  |PA#KPF|年終對照檔                |#K01                |
     A*****************************************************************
     A*      主檔資料: MTM___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |MTMAPF|產品基本資料檔            |MA01                |
     A*  02  |MTMBPF|供應商基本資料檔          |MB01                |
     A*  03  |MTMCPF|員工基本資料檔            |MC01                |
     A*  04  |MTMDPF|客戶基本資料檔            |MD01                |
     A*  05  |MTMDPF1| 客戶信用額度檔          |MD011               |
     A*  06  |MTMEPF|客戶分店資料檔            |ME01+ME02           |
     A*  07  |MTMFPF|禮盒結構資料檔            |MF01+MF02           |
     A*  08  |MTMGPF|專櫃ＰＬＵ檔              |MG01                |
     A*****************************************************************
     A*      採購資料: POP___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |POPAPF|供應商產品報價檔          |PA01+PA02+PA03      |
     A*  02  |POPBPF|採購單主檔                |PB02                |
     A*  03  |POPCPF|採購明細檔                |PC02+PC03           |
     A*  04  |POPDPF|國外採購驗收主檔          |PD02                |
     A*  05  |POPEPF|國外採購驗收明細檔        |PE02+PE03+PE04      |
     A*  06  |POPFPF|國外採購完稅主檔          |PF02                |
     A*  07  |POPGPF|國外採購完稅明細檔        |PG03+PG03           |
     A*  08  |POPHPF|國內採購驗收主檔          |PH02                |
     A*  09  |POPIPF|國內採購驗收明細檔        |PH02+PH03+PH04      |
     A*  10  |POPJPF|採購備註資料檔            |PJ01+PJ02           |
     A*  11  |POPKPF|採購歷史主檔              |PB02                |
     A*  12  |POPLPF|採購歷史明細檔            |PC02+PC03           |
     A*  13  |POPMPF|國內外驗收主檔　　        |                    |
     A*  14  |POPNPF|國外驗收原幣明細檔        |PN02+PN03+PN04      |
     A*****************************************************************
     A*      銷售資料: SOS___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |SOSAPF|通路型態產品報價資料檔    |SA01-SA05           |
     A*  02  |SOSBPF|客戶產品報價資料檔        |SB01-SB04           |
     A*  03  |SOSCPF|銷售訂單主檔              |SC02                |
     A*  04  |SOSDPF|銷售訂單明細檔            |SD02+SD03           |
     A*  05  |SOCDPF|銷售銷退月檔              |CD01+SD13           |
     A*  06  |SOSEPF|送貨單主檔                |SE02                |
     A*  07  |SOSFPF|送貨單明細檔              |SF02+SF03           |
     A*  08  |SOSGPF|銷貨退回主檔              |SG02                |
     A*  09  |SOSHPF|銷貨退回明細檔            |SH02+SH03           |
     A*  10  |SOSIPF|發票主檔                  |SI01+SI02           |
     A*  11  |SOSJPF|發票明細檔                |SJ02+SJ03           |
     A*  12  |SOSKPF|銷售目標達成率資料檔      |SK01-SK06           |
     A*  13  |SOSLPF|專櫃目標達成率資料檔      |SL01-SL03           |
     A*  14  |SOSMLF|銷貨訂單∣∣送貨單檔      |(LF)                |
     A*  15  |SOSNPF|產品收回主檔              |SN02                |
     A*  16  |SOSOPF|產品收回明細檔            |SO02+SO03           |
     A*  17  |SOSPPF|原始／轉帳單據對照檔      |SP01+SP02           |
     A*  18  |SOSQPF|經銷商送貨累計檔          |SQ01+SQ02+SQ03      |
     A*  19  |SOSRPF|禮盒銷售分析成本檔        |SR02+SR04+SR05      |
     A*  20  |SOSSPF|人工發票重開控制檔        |SS01+SS02           |
     A*  21  |SOSTPF|專櫃五日銷售檔            |ST01-ST04           |
     A*  22  |SOSUPF|專櫃五日訂單對照檔        |SU01-SU05           |
     A*  23  |SOVQPF|媒體申報進銷項資料檔      |VQ91+VQ92+VQ01+VQ04 |
     A*  23  |SOVRPF|媒體申報人工輸入資料檔    |VR91+VR92+VR01+VR04 |
     A*****************************************************************
     A*      庫存資料: IMI___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |IMIAPF|產品庫存主檔              |IA01+IA02+IA03      |
     A*  02  |IMIBPF|產品成本調整資料檔        |IB01+IB02+IB03      |
     A*  03  |IMICPF|良壞品轉換主檔            |IC02                |
     A*  04  |IMIDPF|良壞品轉換明細檔          |ID02+ID03           |
     A*  05  |IMIEPF|產品報廢主檔              |IE02                |
     A*  06  |IMIFPF|產品報廢明細檔            |IF02+IF03           |
     A*  07  |IMIGPF|存貨調整主檔              |IG02                |
     A*  08  |IMIHPF|存貨調整明細檔            |IH02+IH03+IH04      |
     A*  09  |IMIIPF|存貨調撥主檔              |II02                |
     A*  10  |IMIJPF|存貨調撥明細檔            |IJ02+IJ03           |
     A*  11  |IMIKPF|派車主檔                  |IK01-IK05           |
     A*  12  |IMILPF|禮盒組拆明細檔            |IL02+IL05           |
     A*  13  |IMIMPF|禮盒組拆資料檔            |IM02                |
     A*  14  |IMINPF|存貨月結檔                |IN01-IN04           |
     A*  15  |IMIOPF|盤點單檔                  |IO01-IO04           |
     A*  16  |IMIPLF|進貨單據主檔              |IP02                |
     A*  17  |IMIQLF|進貨單據明細檔            |IQ02+IQ03           |
     A*  18  |IMIRLF|庫存異動明細檔            |                    |
     A*  19  |IMISLF|未確認單據明細檔          |                    |
     A*  20  |IMITPF|盤點備份檔                |IT01+IT02+IT03      |
     A*  21  |IMIUPF|盤盈虧檔                  |IU02                |
     A*  22  |IMIVPF|盤點產品備份檔            |IV01                |
     A*  23  |IMIWPF|產品單位成本記錄檔        |IW01                |
     A*  24  |IMIXPF|年終成本檔                |IX11+IX01           |
     A*  25  |IMIYPF|年終庫存檔                |IY15+IY01+IY02+IY03 |
     A*****************************************************************
     A*      應收資料: ARA___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |ARAAPF|發票號碼設定資料檔        |                    |
     A*  02  |ARABPF|銀行帳號資料檔            |                    |
     A*  03  |ARACPF|收款主檔                  |                    |
     A*  04  |ARADPF|收款沖帳明細檔            |                    |
     A*  05  |ARAEPF|票據兌現主檔              |                    |
     A*  06  |ARAFPF|價差折讓資料檔            |                    |
     A*  07  |ARAGPF|銷貨折讓資料檔            |                    |
     A*  08  |ARAHLF|折讓資料檔                |                    |
     A*  09  |ARAIPF|統一發票申報主檔          |                    |
     A*  10  |ARAJPF|統一發票申報明細檔        |                    |
     A*  11  |ARAKPF|應收帳款月檔              |                    |
     A*****************************************************************
     A*      LOG FILE  : LGL___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |LGLDPF| DELETE LOG FILE            |                    |
     A*****************************************************************
     A          R RERFR
     A*****************************************************************
     A*          採購單號流水號檔(RE@APF) KEY=@A01+@A02+@A03+@A04
     A*****************************************************************
     A            @A01           2          COLHDG('公司別')
     A            @A02           2          COLHDG('單別')
     A            @A03           1          COLHDG('負責人')
B2MODA            @A04           4S00       COLHDG('西元年份')
     A            @A05           5P 0       COLHDG('序號')
     A*****************************************************************
     A*          驗收單號流水號檔(RE@BPF)  KEY=@B01+@B02+@B03
     A*****************************************************************
     A            @B01           2          COLHDG('公司別')
     A            @B02           2          COLHDG('單別')
B2MODA            @B03           4S00       COLHDG('西元年份')
     A            @B04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          銷售訂單流水號檔(RE@CPF)  KEY=@C01+@C02+@C03
     A*****************************************************************
     A            @C01           2          COLHDG('公司別')
     A            @C02           2          COLHDG('單別')
B2MODA            @C03           4S00       COLHDG('西元年份')
     A            @C04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          送貨單號流水號檔(RE@DPF)  KEY=@D01+@D02+@D03
     A*****************************************************************
     A            @D01           2          COLHDG('公司別')
     A            @D02           2          COLHDG('單別')
B2MODA            @D03           4S00       COLHDG('西元年份')
     A            @D04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          銷售退回單號流水號檔(RE@EPF) KEY=@E01+@E02+@E03
     A*****************************************************************
     A            @E01           2          COLHDG('公司別')
     A            @E02           2          COLHDG('單別')
B2MODA            @E03           4S00       COLHDG('西元年份')
     A            @E04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          調撥單號流水號檔(RE@FPF) KEY=@F01+@F02+@F03+@F04
     A*****************************************************************
     A            @F01           2          COLHDG('公司別')
     A            @F02           2          COLHDG('單別')
     A            @F03           1          COLHDG('負責人')
B2MODA            @F04           4S00       COLHDG('西元年份')
     A            @F05           5P 0       COLHDG('序號')
     A*****************************************************************
     A*          調整號碼流水號檔(RE@G01) KEY=@G01+@G02+@G03+@G04
     A*****************************************************************
     A            @G01           2          COLHDG('公司別')
     A            @G02           2          COLHDG('單別')
     A            @G03           1          COLHDG('型態')
B2MODA            @G04           4S00       COLHDG('西元年份')
     A            @G05           5P 0       COLHDG('序號')
     A*****************************************************************
     A*          良壞轉換單號流水號檔(RE@HPF) KEY=@H01+@H02+@H03+@H04
     A*****************************************************************
     A            @H01           2          COLHDG('公司別')
     A            @H02           2          COLHDG('單別')
     A            @H03           1          COLHDG('型態')
B2MODA            @H04           4S00       COLHDG('西元年份')
     A            @H05           5P 0       COLHDG('序號')
     A*****************************************************************
     A*          成本調整單號流水號檔(RE@IPF)  KEY=@I01+@I02+@I03
     A*****************************************************************
     A            @I01           2          COLHDG('公司別')
     A            @I02           2          COLHDG('單別')
B2MODA            @I03           4S00       COLHDG('西元年份')
     A            @I04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          報廢單號流水號檔(RE@JPF) KEY=@J01+@J02+@J03+@J04
     A*****************************************************************
     A            @J01           2          COLHDG('公司別')
     A            @J02           2          COLHDG('單別')
     A            @J03           1          COLHDG('型態')
B2MODA            @J04           4S00       COLHDG('西元年份')
     A            @J05           5P 0       COLHDG('序號')
     A*****************************************************************
     A*          折讓單號流水號檔(RE@KPF) KEY=@K01+@K02+@K03
     A*****************************************************************
     A            @K01           2          COLHDG('公司別')
     A            @K02           2          COLHDG('單別')
B2MODA            @K03           4S00       COLHDG('西元年份')
     A            @K04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          禮盒組拆單號流水號檔(RE@LPF) KEY=@L01+@L02+@L03
     A*****************************************************************
     A            @L01           2          COLHDG('公司別')
     A            @L02           2          COLHDG('單別')
B2MODA            @L03           4S00       COLHDG('西元年份')
     A            @L04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          產品收回流水號檔(RE@MPF) KEY=@M01+@M02+@M03
     A*****************************************************************
     A            @M01           2          COLHDG('公司別')
     A            @M02           2          COLHDG('單別')
B2MODA            @M03           4S00       COLHDG('西元年份')
     A            @M04           6P 0       COLHDG('序號')
     A*****************************************************************
     A*          盤點單號流水號檔(RE@OPF)  KEY=@O01+@O02+@O03
     A*****************************************************************
     A            @O01           2          COLHDG('公司別')
     A            @O02           2          COLHDG('單別')
B2MODA            @O03           4S00       COLHDG('西元年份')
     A            @O04           6S 0       COLHDG('序號')
     A*****************************************************************
     A*          代碼欄位檔(PA#1PF)       KEY=#101
     A*****************************************************************
     A            #101           8          COLHDG('代碼欄位')
     A            #102          22O         COLHDG('代碼簡稱')
     A            #103          32O         COLHDG('代碼名稱－維護')
     A            #104          32O         COLHDG('代碼名稱－列印')
     A            #105           3  0       COLHDG('代碼長度')
     A            #106           3  0       COLHDG('代碼說明長度')
     A            #107           1          COLHDG('可維護否')
     A                                      VALUES('Y' 'N')
     A*                                     'Y'-可自行維護
     A*                                     'N'-固定代碼不可自行維護
     A*****************************************************************
     A*          單別資料檔(PA#2PF)       KEY=#102
     A*****************************************************************
     A            #201           1          COLHDG('單別類型')
     A*                                     S-銷售訂單
     A*                                     D-送貨單
     A*                                     I-採購單
     A*                                        ETC..
     A            #202           2          COLHDG('單別')
     A            #203          22O         COLHDG('單別說明')
     A            #204           1          COLHDG('視窗顯示')
     A                                      VALUES('Y' 'N')
     A*                                     'Y'-視窗查詢時，顯示該筆
     A*                                     'N'-不顯示
     A            #205           2          COLHDG('對應單別')
     A*                                    屬轉帳單別時，對應單別輸入
     A*                                    　其由何種單別產生之轉帳單
     A*                                    　別
     A*                                    非轉帳單別時，對應單別輸入
     A*                                    　其將產生何種轉帳單別
     A            #206           1          COLHDG('轉帳單別')
     A                                      VALUES('Y' 'N')
     A*                                     Y-此單別之單據為
     A*                                       　一轉帳之單據
     A            #207           1          COLHDG('產生轉帳訂單')
     A                                      VALUES('Y' 'N')
     A            #208           1          COLHDG('產生轉帳送貨單')
     A                                      VALUES('Y' 'N')
     A            #209           1          COLHDG('產生轉帳發票')
     A                                      VALUES('Y' 'N')
     A            #210           1          COLHDG('產生虛擬發票')
     A                                      VALUES('Y' 'N')
     A            #211           1          COLHDG('檢核進貨倉庫存')
     A                                      VALUES('Y' 'N')
     A            #212           1          COLHDG('檢核出貨倉可用')
     A                                      VALUES('Y' 'N')
     A            #213           1          COLHDG('檢核搭贈')
     A                                      VALUES('Y' 'N')
     A            #214           1          COLHDG('檢核單價')
     A                                      VALUES('Y' 'N')
     A            #215           1          COLHDG('檢核逾期')
     A                                      VALUES('Y' 'N')
     A            #216           1          COLHDG('檢核額度')
     A                                      VALUES('Y' 'N')
     A            #217           1          COLHDG('紀錄進貨倉')
     A                                      VALUES('Y' 'N')
     A            #218           1          COLHDG('進貨倉加減')
     A                                      VALUES('+' '-' ' ')
     A            #219           1          COLHDG('送貨倉加減')
     A                                      VALUES('+' '-' ' ')
     A            #220           1          COLHDG('轉應收帳款')
     A                                      VALUES('Y' 'N' ' ')
     A*                                     'Y'-計劃轉應收
     A*                                     'N'-計劃＋新－舊
     A            #221           1          COLHDG('庫存異動')
     A                                      VALUES('Y' 'N')
     A*****************************************************************
     A*          規則代碼檔(PA#APF)       KEY=#A01+#A02
     A*****************************************************************
     A            #A01      R               COLHDG('代碼欄位')
     A                                      REFFLD(#101)
     A            #A02          10          COLHDG('代碼內容')
     A            #A03          32O         COLHDG('代碼說明')
B2MODA            #AXX           8S00       COLHDG('異動日期')
     A            #AYY           6S 0       COLHDG('異動時間')
     A            #AZZ          10          COLHDG('異動者　')
     A*****************************************************************
     A*          公司檔(PA#BPF)           KEY=#B01
     A*****************************************************************
     A            #B01           2          COLHDG('公司編號')
     A            #B02          34O         COLHDG('公司全名')
     A            #B03          16O         COLHDG('公司簡稱')
     A            #B04          34O         COLHDG('公司地址１')
     A            #B05          34O         COLHDG('公司地址２')
     A            #B06           1          COLHDG('公司型態')
     A*                                     A-代理商
     A*                                     W-經銷商
     A            #B07          12O         COLHDG('負責人')
     A            #B08          15          COLHDG('公司電話１')
     A            #B09          15          COLHDG('公司電話２')
     A            #B10          15          COLHDG('傳真機')
     A            #B11           5          COLHDG('郵遞區號')
     A            #B12           8          COLHDG('統一編號')
     A            #B13           9          COLHDG('稅籍編號')
     A            #B14           5          COLHDG('客戶代號')
     A            #B15           4          COLHDG('分店代號')
B2MODA            #B16           6S00       COLHDG('月結月份')
     A            #B17      R               COLHDG('發票公司')
     A                                      REFFLD(#B01)
     A*                                     指定為那家公司的發票
B2CHKA            #BXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #BYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #BZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷售通路型態資料檔(PA#CPF) KEY=#C01+#C02
     A*****************************************************************
     A            #C01           1          COLHDG('通路代號')
     A            #C02           2          COLHDG('型態代號')
     A            #C03          22O         COLHDG('型態說明')
B2CHKA            #CXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #CYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #CZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷售地區資料檔(PA#DPF)   KEY=#D01
     A*****************************************************************
     A            #D01           2          COLHDG('地區代號')
     A            #D02          22O         COLHDG('地區說明')
     A            #D03           5          COLHDG('出貨物流點')
B2CHKA            #DXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #DYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #DZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷售地區區域資料檔(PA#EPF) KEY=#E01+#E02
     A*****************************************************************
     A            #E01      R               COLHDG('地區代號')
     A                                      REFFLD(#D01)
     A            #E02           2          COLHDG('區域代號')
     A            #E03          12O         COLHDG('區域說明')
B2CHKA            #EXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #EYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #EZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          傳票介面控制檔(PA#GPF) KEY=#G01
     A*****************************************************************
     A            #G01          12          COLHDG('進銷存收單號')
B2CHKA            #G02      R    8 00       COLHDG('確認日期')
     A                                      REFFLD(#AXX)
B2CHKA            #GXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #GYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #GZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*    規則代碼檔－數字(PA#HPF)       KEY=#H01+#H02
     A*****************************************************************
     A            #H01      R               COLHDG('代碼欄位')
     A                                      REFFLD(#101)
     A            #H02          10          COLHDG('代碼內容')
     A            #H03           9S 4       COLHDG('代碼數字')
B2MODA            #HXX           8S00       COLHDG('異動日期')
     A            #HYY           6S 0       COLHDG('異動時間')
     A            #HZZ          10          COLHDG('異動者　')
     A*****************************************************************
     A*    銷售月結控制檔 (PA#IPF)       KEY=#I01
     A*****************************************************************
     A            #I01          12A         COLHDG('單別')
B2MODA            #I02           6S00       COLHDG('確認年月')
B2MODA            #I03           8S00       COLHDG('確認日期')
B2MODA            #IXX           8S00       COLHDG('異動日期')
     A            #IYY           6S 0       COLHDG('異動時間')
     A            #IZZ          10          COLHDG('異動者　')
     A*****************************************************************
     A*    專櫃部門抽成比率檔 (PA#JPF)       KEY=#J01+#J02
     A*****************************************************************
     A            #J01           5A         COLHDG('專櫃代號')
     A            #J02           2A         COLHDG('部門代號')
     A            #J03           3S 2       COLHDG('抽成比率')
     A            #J04           3S 2       COLHDG('應加稅率')
     A            #J05          10A         COLHDG('結帳單號')
B2MODA            #JXX           8S00       COLHDG('異動日期')
     A            #JYY           6S 0       COLHDG('異動時間')
     A            #JZZ          10          COLHDG('異動者　')
     A*****************************************************************
     A*         年終對照檔 (PA#KPF)       KEY=#K01
     A*****************************************************************
     A            #K01          12A         COLHDG('單號')
B2CHKA            #K02      R    8 00       COLHDG('確認日期')
     A                                      REFFLD(#AXX)
B2CHKA            #KXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #KYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #KZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          部門品牌對照資料檔(PA#3PF) KEY=#C01+#C02
     A*****************************************************************
     A            #301           5          COLHDG('部門代號')
     A            #302           2          COLHDG('品牌代號')
B2CHKA            #3XX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #3YY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #3ZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          部門成本中心檔(PA#4PF) KEY=#401
     A*****************************************************************
     A            #401           5          COLHDG('部門代號')
     A            #402           4          COLHDG('部門代號')
     A            #403           6          COLHDG('成本中心')
B2CHKA            #4XX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #4YY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #4ZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          部門成本中心檔(PA#5PF) KEY=#501
     A*****************************************************************
     A            #501           2          COLHDG('試飲代號')
     A            #502           3          COLHDG('Ａ＆Ｐ')
B2CHKA            #5XX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #5YY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #5ZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          業務員部門檔(PA#6PF) KEY=#601
     A*****************************************************************
     A            #601           5          COLHDG('業務員')
     A            #602           5          COLHDG('部門代號')
     A            #603           4          COLHDG('部門代號')
B2CHKA            #6XX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            #6YY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            #6ZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          產品基本資料檔(MTMAPF)   KEY=MA01
     A*****************************************************************
     A            MA01           9          COLHDG('產品代號')
     A            MA02          34O         COLHDG('中文全稱')
     A            MA03          18O         COLHDG('中文簡稱')
     A            MA04          30          COLHDG('英文全稱１')
     A            MA05          30          COLHDG('英文全稱２')
     A            MA06          15          COLHDG('英文簡稱')
     A            MA07           1          COLHDG('產品歸屬')
     A            MA08           2          COLHDG('產品識別')
     A            MA09           2          COLHDG('產品種類')
     A            MA10           2          COLHDG('產品品牌')
     A            MA11           2          COLHDG('產品等級')
     A            MA12           5          COLHDG('主要供應商')
     A            MA13           6O         COLHDG('庫存單位')
     A            MA14           6O         COLHDG('採購單位')
     A            MA15           4S 3       COLHDG('單位容積')
     A            MA16           3P 0       COLHDG('單位轉換')
     A            MA17           9          COLHDG('包裝說明')
     A            MA18           3P 0       COLHDG('前置時間')
     A            MA19           6          COLHDG('採購人員')
     A            MA20          14O         COLHDG('原產地')
     A            MA21           5P 0       COLHDG('裝櫃說明２０呎')
     A            MA22           5P 0       COLHDG('裝櫃說明４０呎')
     A            MA23          32O         COLHDG('備註１')
     A            MA24          32O         COLHDG('備註２')
     A            MA25           8S 4       COLHDG('單瓶公賣利益')
     A            MA26          11P 2       COLHDG('F.O.B.-TOTAL')
     A            MA27          11P 2       COLHDG('FHI   -TOTAL')
     A            MA28          11P 2       COLHDG('DUTY  -TOTAL')
     A            MA29           6S 0       COLHDG('保稅庫存量')
     A            MA30           6S 0       COLHDG('完稅庫存量')
     A            MA31           9S 2       COLHDG('F.O.B.-UNIT')
     A            MA32           9S 2       COLHDG('FHI   -UNIT')
     A            MA33           9S 2       COLHDG('DUTY  -UNIT')
     A            MA34           9S 2       COLHDG('單位成本')
     A            MA35           6S 0       COLHDG('最小採購批量')
     A            MA36           6S 0       COLHDG('最大採購批量')
     A            MA37           6S 0       COLHDG('保稅倉安全量')
     A            MA38           6S 0       COLHDG('完稅倉安全量')
B2CHKA            MA39      R    8 00       COLHDG('牌價有效日期')
     A                                      REFFLD(#AXX)
     A            MA40           7P 0       COLHDG('批發價格－有效日前')
     A            MA41           7P 0       COLHDG('零售價格－有效日前')
     A            MA42           7P 0       COLHDG('免稅價格－有效日前')
    .A            MA43           7P 0       COLHDG('分銷價格－有效日前')
    .A            MA44           7P 0       COLHDG('經銷價格－有效日前')
     A            MA45           7P 0       COLHDG('批發價格－有效日後')
     A            MA46           7P 0       COLHDG('零售價格－有效日後')
     A            MA47           7P 0       COLHDG('免稅價格－有效日後')
    .A            MA48           7P 0       COLHDG('分銷價格－有效日後')
    .A            MA49           7P 0       COLHDG('經銷價格－有效日後')
     A* GET FROM銷售訂單檔
    .A**          MA50      R               COLHDG('最近銷售日期')
    .A**                                    REFFLD(#AXX)
     A* GET FROM採購檔
    .A**          MA51      R               COLHDG('最近進貨日期')
    .A**                                    REFFLD(#AXX)
     A* GET FROM出貨檔
    .A**          MA52      R               COLHDG('最近出貨日期')
    .A**                                    REFFLD(#AXX)
B2CHKA            MA53      R    8 00       COLHDG('建檔日期')
     A                                      REFFLD(#AXX)
     A            MA54           1          COLHDG('禮盒碼')
     A*                                     'Y' -禮盒
     A*                                     ' ' -非禮盒
     A            MA55           1          COLHDG('可否寄賣')
     A*                                     'Y' -可寄賣
     A*                                     ' ' -不可寄賣
     A            MA56           1          COLHDG('可否寄放')
     A*                                     'Y' -可寄放
     A*                                     ' ' -不可寄放
     A            MA57           1          COLHDG('自動轉帳')
     A*                                     'Y' -自動轉帳
     A*                                     ' ' -不自動轉帳
     A            MA58           1          COLHDG('使用碼')
     A*                                     'A' - ACTIVE
     A*                                     'I' - INACTIVE
     A            MA59           1          COLHDG('課稅別')
     A*                                     'D' -應稅
     A*                                     'B' -免稅
     A*                                     'Z' -零稅
B2CHKA            MAXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            MAYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            MAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          供應商基本資料檔(MTMBPF) KEY=MB01
     A*****************************************************************
     A            MB01      R               COLHDG('供應商代號')
     A                                      REFFLD(MA12)
     A            MB02          42O         COLHDG('供應商全稱')
     A            MB03          18O         COLHDG('供應商簡稱')
     A            MB04          14O         COLHDG('國別')
     A            MB05           7          COLHDG('郵遞區號')
     A            MB06          32O         COLHDG('供商地址１')
     A            MB07          32O         COLHDG('供商地址２')
     A            MB08          32O         COLHDG('供商地址３')
     A            MB09          32O         COLHDG('供商地址４')
     A            MB10          32O         COLHDG('供商地址５')
     A            MB11          22O         COLHDG('負責人')
     A            MB12          22O         COLHDG('聯絡人')
     A            MB13          15          COLHDG('電話１')
     A            MB14          15          COLHDG('電話２')
     A            MB15          15          COLHDG('傳真機')
     A            MB16          15          COLHDG('電報機')
     A            MB17           3          COLHDG('幣別')
     A            MB18           2          COLHDG('付款方式')
     A            MB19      R               COLHDG('採購人員')
     A                                      REFFLD(MA19)
     A            MB20          32O         COLHDG('備註１')
     A            MB21          32O         COLHDG('備註２')
     A* GET FROM採購檔
    .A**          MB22      R               COLHDG('最近交易日')
    .A**                                    REFFLD(#AXX)
B2CHKA            MB23      R    8 00       COLHDG('建檔日期')
     A                                      REFFLD(#AXX)
     A            MB24           1          COLHDG('供商類別')
     A*                                     '0' -費用廠商
     A*                                     '1' -國外
     A*                                     '2' -國內
     A            MB25          10S 0       COLHDG('應付帳款餘額')
     A            MB26          10S 0       COLHDG('應付票據餘額')
B2CHKA            MBXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            MBYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            MBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          員工基本資料檔(MTMCPF)   KEY=MC01
     A*****************************************************************
     A            MC01      R               COLHDG('員工代號')
     A                                      REFFLD(MA19)
     A            MC02          12O         COLHDG('員工姓名')
     A            MC03           4A         COLHDG('部門組別')
     A            MC04          14O         COLHDG('職稱')
B2CHKA            MC05      R    8 00       COLHDG('到職日期')
     A                                      REFFLD(#AXX)
B2CHKA            MC06      R    8 00       COLHDG('離職日期')
     A                                      REFFLD(#AXX)
     A            MC07          10          COLHDG('身份証號')
B2CHKA            MC08      R    8 00       COLHDG('出生日期')
     A                                      REFFLD(#AXX)
     A            MC09          22O         COLHDG('籍貫')
     A            MC10          62O         COLHDG('戶籍地址')
     A            MC11          62O         COLHDG('通訊地址')
     A            MC12          15          COLHDG('聯絡電話')
     A            MC13          62O         COLHDG('學歷')
B2CHKA            MC14      R    8 00       COLHDG('建檔日期')
     A                                      REFFLD(#AXX)
     A            MC15      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A*                                     1.物流點代號
     A*                                     2. *ALL
     A*                                     3.空白
     A            MC16           1          COLHDG('採購負責人代號')
     A            MC17           1          COLHDG('調撥負責人代號')
     A            MC18           1          COLHDG('核准權限設定－單價')
     A*                                     'Y' OR ' '
     A            MC19           1          COLHDG('核准權限設定－額度')
     A*                                     'Y' OR ' '
     A            MC20           1          COLHDG('核准權限設定－逾期')
     A*                                     'Y' OR ' '
     A            MC21           1          COLHDG('核准權限設定－搭贈')
     A*                                     'Y' OR ' '
     A            MC22           1          COLHDG('核准權限設定－試飲')
     A*                                     'Y' OR ' '
     A            MC23           1          COLHDG('姓別')
     A*                                     M-男
     A*                                     F-女
     A            MC24           1          COLHDG('物流點類別')
     A*                                     A-經銷商物流點
     A*                                     空白則依MC15
     A            MC25           1          COLHDG('核准權限設定－換貨')
     A*                                     'Y' OR ' '
     A            MC26           2P 0       COLHDG('列表機序號')
B2CHKA            MCXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            MCYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            MCZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          客戶基本資料檔(MTMDPF)   KEY=MD01
     A*****************************************************************
     A            MD01      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
    .A*           MD02          48O         COLHDG('客戶全稱')
    .A*           MD03          18O         COLHDG('客戶簡稱')
    .A*           MD04          32O         COLHDG('客戶地址１')
    .A*           MD05          32O         COLHDG('客戶地址２')
     A            MD06           2          COLHDG('集團代碼')
     A            MD07      R               COLHDG('通路')
     A                                      REFFLD(#C01)
     A            MD08      R               COLHDG('型態')
     A                                      REFFLD(#C02)
    .A*           MD09      R               COLHDG('地區')
    .A*                                     REFFLD(#D01)
    .A*           MD10      R               COLHDG('區域')
    .A*                                     REFFLD(#D02)
    .A*           MD11          12O         COLHDG('負責人')
    .A*           MD12          12O         COLHDG('聯絡人')
    .A*           MD13          12O         COLHDG('收貨人')
    .A*           MD14          15          COLHDG('電話１')
    .A*           MD15          15          COLHDG('電話２')
    .A*           MD16          15          COLHDG('傳真機')
     A            MD17           8          COLHDG('統一編號')
     A            MD18           1P 0       COLHDG('發票聯數')
    .A*           MD19      R               COLHDG('業務人員')
    .A*                                     REFFLD(MC01)
     A            MD20           1          COLHDG('寄賣客戶')
     A*                                     'Y' OR ' '
     A            MD21           1          COLHDG('寄放客戶')
     A*                                     'Y' OR ' '
     A            MD22          10S 0       COLHDG('信用額度')
     A**                                    單位為元
     A            MD23           1          COLHDG('信用期限')
     A*                                     C-現金
     A*                                     D-交貨
     A*                                     M-月結
     A            MD24           2S 0       COLHDG('結算日期')
     A            MD25           2S 0       COLHDG('期限天數')
     A            MD26           3P 0       COLHDG('收款日')
    .A*           MD27          32O         COLHDG('備註１')
    .A*           MD28          32O         COLHDG('備註２')
     A            MD29          10S 0       COLHDG('使用額度')
     A            MD30          10S 0       COLHDG('計劃使用額度')
     A            MD31          10S 0       COLHDG('應收帳款')
     A            MD32          10S 0       COLHDG('應收票據')
     A            MD33      R               COLHDG('物流點倉號')
     A                                      REFFLD(#D03)
    .A*           MD34      R               COLHDG('最近交易日')
    .A*                                     REFFLD(#AXX)
    .A*           MD35      R               COLHDG('建檔日期')
    .A*                                     REFFLD(#AXX)
    .A*           MDXX      R               COLHDG('異動日期')
    .A*                                     REFFLD(#AXX)
    .A*           MDYY      R               COLHDG('異動時間')
    .A*                                     REFFLD(#AYY)
    .A*           MDZZ      R               COLHDG('異動者　')
    .A*                                     REFFLD(#AZZ)
     A*****************************************************************
     A*          客戶信用額度檔(MTMDPF1)   KEY=MD011
     A*****************************************************************
     A            MD011     R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            MD221     R               COLHDG('平常信用額度')
     A                                      REFFLD(MD22)
     A            MD222     R               COLHDG('年節信用額度')
     A                                      REFFLD(MD22)
     A            MD361          1A         COLHDG('年節信用額度')
     A                                      VALUES(' ' 'Y')
     A*                                     'Y'=年節
     A*                                     ' '=平常
     A*****************************************************************
     A*          客戶分店資料檔(MTMEPF)   KEY=ME01+ME02
     A*****************************************************************
     A            ME01      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
     A            ME02      R               COLHDG('分店代號')
     A                                      REFFLD(#B15)
     A            ME03          48O         COLHDG('分店全稱')
     A            ME04          18O         COLHDG('分店簡稱')
     A            ME05          32O         COLHDG('分店地址１')
     A            ME06          32O         COLHDG('分店地址２')
     A            ME07      R               COLHDG('地區')
     A                                      REFFLD(#D01)
     A            ME08      R               COLHDG('區域')
     A                                      REFFLD(#E02)
     A            ME09          12O         COLHDG('負責人')
     A            ME10          12O         COLHDG('聯絡人')
     A            ME11          12O         COLHDG('收貨人')
     A            ME12          15          COLHDG('電話１')
     A            ME13          15          COLHDG('電話２')
     A            ME14          15          COLHDG('傳真機')
     A            ME15      R               COLHDG('業務人員')
     A                                      REFFLD(MC01)
     A            ME16          32O         COLHDG('備註１')
     A            ME17          32O         COLHDG('備註２')
B2CHKA            ME18      R    8 00       COLHDG('最近交易日')
     A                                      REFFLD(#AXX)
B2CHKA            ME19      R    8 00       COLHDG('建檔日期')
     A                                      REFFLD(#AXX)
     A            ME20           1A         COLHDG('往來狀態')
     A*                                     'A' - ACTIVE
     A*                                     'I' - INACTIVE
B2CHKA            MEXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            MEYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            MEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          禮盒結構資料檔(MTMFPF)   KEY=MF01+MF02
     A*****************************************************************
     A            MF01      R               COLHDG('禮盒代號')
     A                                      REFFLD(MA01)
     A            MF02      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            MF03      R               COLHDG('單位')
     A                                      REFFLD(MA13)
     A            MF04           3P 0       COLHDG('數量')
     A            MF05           7P 0       COLHDG('價格')
     A            MF06           9P 2       COLHDG('UNIT COST-FOB')
     A            MF07           1          COLHDG('附屬品')
     A*                                     Y -表附屬品不存於產品檔中
     A            MF08           9P 2       COLHDG('UNIT COST-FHI')
     A            MF09           9P 2       COLHDG('UNIT COST-DUTY')
     A            MF10           1          COLHDG('確認註記')
     A*                                     'V' - 已確認
     A*                                     ' ' - 未確認
B2CHKA            MFXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            MFYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            MFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          專櫃ＰＬＵ檔(MTMGPF)   KEY=MG01
     A*****************************************************************
     A            MG01           3A         COLHDG('PLU代號')
     A            MG02      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            MG03           2A         COLHDG('專櫃部門')
B2CHKA            MG04      R    8 00       COLHDG('建檔日期')
    .A                                      REFFLD(#AXX)
    .A            MG05           1A         COLHDG('使用碼')
     A*                                     'A' - ACTIVE
     A*                                     'I' - INACTIVE
B2CHKA            MGXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            MGYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            MGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          供應商產品報價檔(POPAPF) KEY=PA01-PA03
     A*****************************************************************
     A            PA01      R               COLHDG('供應商代號')
     A                                      REFFLD(MB01)
     A            PA02          10          COLHDG('報價單號')
     A            PA03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
B2CHKA            PA04      R    8 00       COLHDG('生效日期')
     A                                      REFFLD(#AXX)
     A            PA05          12A         COLHDG('供應商產品代號')
B2CHKA            PA06      R    8 00       COLHDG('截止日期')
     A                                      REFFLD(#AXX)
     A            PA07      R               COLHDG('付款條件')
     A                                      REFFLD(MB18)
     A            PA08      R               COLHDG('幣別')
     A                                      REFFLD(MB17)
     A            PA09           8S 2       COLHDG('單價')
     A            PA10           2          COLHDG('報價價格條件')
     A            PA11      R               COLHDG('交易價格條件')
     A                                      REFFLD(PA10)
     A            PA12      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
     A            PA13      R               COLHDG('採購單位')
     A                                      REFFLD(MA14)
     A            PA14      R               COLHDG('單位轉換')
     A                                      REFFLD(MA16)
B2CHKA            PAXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PAYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          採購單主檔(POPBPF)       KEY=PB02
     A*****************************************************************
     A            PB01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PB02          12          COLHDG('採購單號')
     A*                         XX   -  XX  -   X    -    XX    - XXXXX
     A*                       公司 -單別-負責人-西元年份-序號
     A            PB03           2          COLHDG('單別')
B2CHKA            PB04      R    8 00       COLHDG('採購日期')
     A                                      REFFLD(#AXX)
     A            PB05      R               COLHDG('供應商代號')
     A                                      REFFLD(MB01)
B2CHKA            PB06      R    8 00       COLHDG('預計交貨日')
     A                                      REFFLD(#AXX)
     A            PB07      R               COLHDG('幣別')
     A                                      REFFLD(MB17)
     A            PB08          10S 2       COLHDG('總金額')
     A            PB09      R               COLHDG('付款條件')
     A                                      REFFLD(MB18)
     A            PB10      R               COLHDG('價格條件')
     A                                      REFFLD(PA10)
     A            PB11      R               COLHDG('參考單號')
     A                                      REFFLD(PB02)
     A            PB12           2          COLHDG('運輸方式')
     A            PB13           4          COLHDG('採購備註')
B2CHKA            PB14      R    8 00       COLHDG('裝船日ETD')
     A                                      REFFLD(#AXX)
B2CHKA            PB15      R    8 00       COLHDG('到貨日ETA')
     A                                      REFFLD(#AXX)
     A            PB16          11          COLHDG('I/P')
     A            PB17          12          COLHDG('P-INVOICE')
     A            PB18          14          COLHDG('INSURANCE')
     A            PB19           1          COLHDG('結案碼')
     A*                                     'V' OR ' '
     A            PB20           1          COLHDG('裝船註記')
     A*                                     'V' OR ' '
     A            PB21           3P 0       COLHDG('列印序號')
     A            PB22           9S 2       COLHDG('總稅額')
B2CHKA            PBXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PBYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          採購明細檔(POPCPF)       KEY=PC02+PC03
     A*****************************************************************
     A            PC01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PC02      R               COLHDG('採購單號')
     A                                      REFFLD(PB02)
     A            PC03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
B2CHKA            PC04      R    8 00       COLHDG('採購日期')
     A                                      REFFLD(#AXX)
     A            PC05      R               COLHDG('供應商代號')
     A                                      REFFLD(MB01)
     A            PC06           6S 0       COLHDG('採購數量')
     A            PC07           8S 2       COLHDG('單價')
     A            PC08          10S 2       COLHDG('金額')
     A            PC09      R               COLHDG('採購單位')
     A                                      REFFLD(MA14)
     A            PC10      R               COLHDG('單位轉換')
     A                                      REFFLD(MA16)
     A            PC11           6S 0       COLHDG('已收數量')
     A            PC12           1          COLHDG('結案註記')
     A*                                     'V' OR ' '
     A            PC13           9S 2       COLHDG('稅額')
B2CHKA            PCXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PCYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PCZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          國外採購驗收主檔(POPDPF) KEY=PD02
     A*****************************************************************
     A            PD01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PD02          12          COLHDG('驗收單號')
     A*                         XX   -  XX  -    XX    - XXXXXX
     A*                       公司 -單別-西元年份-序號
     A            PD03      R               COLHDG('單別')
     A                                      REFFLD(#202)
B2CHKA            PD04      R    8 00       COLHDG('進貨日期')
     A                                      REFFLD(#AXX)
     A            PD05           9          COLHDG('參考單號')
     A            PD06      R               COLHDG('進貨物流點')
     A                                      REFFLD(#D03)
     A            PD07      R               COLHDG('供應商代號')
     A                                      REFFLD(MB01)
     A            PD08      R               COLHDG('幣別')
     A                                      REFFLD(MB17)
     A            PD09           8S 4       COLHDG('匯率')
     A            PD10          10S 2       COLHDG('F.O.B.-原幣')
     A            PD11          10S 2       COLHDG('FREIGHT-原幣')
     A            PD12           8S 0       COLHDG('F.O.B.-台幣')
     A            PD13           8S 0       COLHDG('FREIGHT-台幣')
     A            PD14           6S 0       COLHDG('簽証費')
     A            PD15           6S 0       COLHDG('手續費')
     A            PD16           6S 0       COLHDG('報關費')
     A            PD17           6S 0       COLHDG('保險費')
     A            PD18           6S 0       COLHDG('空運運費')
     A            PD19          10          COLHDG('船期航次')
     A            PD20          30          COLHDG('船名')
B2CHKA            PD21      R    8 00       COLHDG('實際到港日')
     A                                      REFFLD(#AXX)
     A            PD22          32O         COLHDG('備註１')
     A            PD23          32O         COLHDG('備註２')
     A            PD24           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
B2CHKA            PDXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PDYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          國外採購驗收明細檔(POPEPF) KEY=PE02-PE04
     A*****************************************************************
     A            PE01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PE02      R               COLHDG('驗收單號')
     A                                      REFFLD(PD02)
     A            PE03      R               COLHDG('採購單號')
     A                                      REFFLD(PC02)
     A            PE04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
B2CHKA            PE05      R    8 00       COLHDG('進貨日期')
     A                                      REFFLD(#AXX)
     A            PE06           6S 0       COLHDG('到貨量')
     A*                                     為採購單位
     A            PE07           8S         COLHDG('F.O.B.')
     A*           PE08           6S         COLHDG('FREIGHT')
     A*           PE09           6S         COLHDG('HANDLE')
     A            PE08           8S         COLHDG('FREIGHT')
     A            PE09           8S         COLHDG('HANDLE')
     A            PE10      R               COLHDG('進貨物流點')
     A                                      REFFLD(#D03)
B2CHKA            PEXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PEYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          國外採購完稅主檔(POPFPF) KEY=PF02
     A*****************************************************************
     A            PF01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PF02      R               COLHDG('驗收單號')
     A                                      REFFLD(PD02)
     A            PF03      R               COLHDG('單別')
     A                                      REFFLD(#202)
B2CHKA            PF04      R    8 00       COLHDG('完稅日期')
     A                                      REFFLD(#AXX)
     A            PF05          11          COLHDG('參考單號')
     A            PF06      R               COLHDG('保稅物流點')
     A                                      REFFLD(#D03)
     A            PF07      R               COLHDG('完稅物流點')
     A                                      REFFLD(#D03)
     A            PF08          32O         COLHDG('備註１')
     A            PF09          32O         COLHDG('備註２')
     A            PF10           8S 0       COLHDG('公賣利益')
B2CHKA            PF11      R    8 00       COLHDG('倉庫確認日')
     A                                      REFFLD(#AXX)
     A            PF12           1          COLHDG('確認註記')
     A*                                     'V' OR ' ' 目前保留未用
     A            PF13           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A**
B2CHKA            PFXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PFYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          國外採購完稅明細檔(POPGPF) KEY=PG02+PG03
     A*****************************************************************
     A            PG01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PG02      R               COLHDG('驗收單號')
     A                                      REFFLD(PD02)
     A            PG03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
B2CHKA            PG04      R    8 00       COLHDG('完稅日期')
     A                                      REFFLD(#AXX)
     A            PG05           5P 0       COLHDG('完稅量')
     A            PG06           8S 0       COLHDG('公賣利益')
     A            PG07           5P 0       COLHDG('確認數量')
B2CHKA            PG08      R    8 00       COLHDG('倉庫確認日')
     A                                      REFFLD(#AXX)
     A**                                    暫保留
     A            PG09           1          COLHDG('確認註記')
     A*                                     'V' OR ' '
     A**                                    暫保留
     A            PG10      R               COLHDG('保稅物流點')
     A                                      REFFLD(#D03)
     A            PG11      R               COLHDG('完稅物流點')
     A                                      REFFLD(#D03)
     A            PG12      R               COLHDG('FOB-TOT')
     A                                      REFFLD(MA26)
     A            PG13      R               COLHDG('FHI-TOT')
     A                                      REFFLD(MA27)
B2CHKA            PGXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PGYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          國內採購驗收主檔(POPHPF) KEY=PH02
     A*****************************************************************
     A            PH01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PH02      R               COLHDG('驗收單號')
     A                                      REFFLD(PD02)
     A            PH03      R               COLHDG('單別')
     A                                      REFFLD(PD03)
B2CHKA            PH04      R    8 00       COLHDG('進貨日期')
     A                                      REFFLD(#AXX)
     A            PH05      R               COLHDG('進貨物流點')
     A                                      REFFLD(#D03)
     A            PH06      R               COLHDG('供應商代號')
     A                                      REFFLD(MB01)
     A            PH07          32O         COLHDG('備註１')
     A            PH08          32O         COLHDG('備註２')
     A            PH09          32O         COLHDG('備註３')
     A            PH10           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A            PH11          11P 2       COLHDG('總金額')
     A            PH12          11P 2       COLHDG('總稅額')
B2CHKA            PHXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PHYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PHZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          國內採購驗收明細檔(POPIPF) KEY=PI02+PI03+PI04
     A*****************************************************************
     A            PI01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PI02      R               COLHDG('驗收單號')
     A                                      REFFLD(PD02)
     A            PI03      R               COLHDG('採購單號')
     A                                      REFFLD(PB02)
     A            PI04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
B2CHKA            PI05      R    8 00       COLHDG('進貨日期')
     A                                      REFFLD(#AXX)
     A            PI06           5P 0       COLHDG('驗收量')
     A*                                     為採購單位
     A            PI07           8S 2       COLHDG('單價')
     A            PI08      R               COLHDG('進貨物流點')
     A                                      REFFLD(#D03)
     A            PI09          11P 2       COLHDG('稅額')
     A            PI10          11P 2       COLHDG('金額')
B2CHKA            PIXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PIYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PIZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          採購備註資料檔(POPJPF)   KEY=PJ01+PJ02
     A*****************************************************************
     A            PJ01      R               COLHDG('備註代號')
     A                                      REFFLD(PB13)
     A            PJ02           3P 0       COLHDG('序號')
     A            PJ03          52O         COLHDG('備註內容')
B2CHKA            PJXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PJYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PJZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          國外驗收原幣明細檔(POPNPF) KEY=PN02-PN04
     A*****************************************************************
     A            PN01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            PN02      R               COLHDG('驗收單號')
     A                                      REFFLD(PD02)
     A            PN03      R               COLHDG('採購單號')
     A                                      REFFLD(PC02)
     A            PN04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            PN05          10S 2       COLHDG('原幣F.O.B.')
B2CHKA            PNXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            PNYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            PNZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          通路型態產品報價資料檔(SOSAPF) KEY=SA01-SA05
     A*****************************************************************
     A            SA01      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SA02      R               COLHDG('通路')
     A                                      REFFLD(MD07)
     A            SA03      R               COLHDG('型態')
     A                                      REFFLD(MD08)
     A            SA04           1          COLHDG('折扣別')
     A*                                     N-普通折扣
     A*                                     S-特別折扣
     A*                                     A-搭贈
B2CHKA            SA05      R    8 00       COLHDG('生效日期')
     A                                      REFFLD(#AXX)
     A            SA06           6S 6       COLHDG('折扣率')
     A**                                    螢幕顯示前須* 100
     A            SA07           3P 0       COLHDG('搭贈比率－搭贈１')
     A            SA08           4S 0       COLHDG('搭贈比率－採購１')
     A            SA09           3P 0       COLHDG('搭贈比率－搭贈２')
     A            SA10           4S 0       COLHDG('搭贈比率－採購２')
     A            SA11           3P 0       COLHDG('搭贈比率－搭贈３')
     A            SA12           4S 0       COLHDG('搭贈比率－採購３')
B2CHKA            SA13      R    8 00       COLHDG('截止日期')
     A                                      REFFLD(#AXX)
     A            SA14           1          COLHDG('待確認註記')
     A*                                     '*' -待確認
     A*                                     'P' -已列印
     A*                                     ' ' -已確認
B2CHKA            SAXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SAYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          客戶產品報價資料檔(SOSBPF) KEY=SB01-SB04
     A*****************************************************************
     A            SB01      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            SB02      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SB04      R               COLHDG('折扣別')
     A                                      REFFLD(SA04)
     A*                                     N-普通折扣
     A*                                     S-特別折扣
     A*                                     A-搭贈
B2CHKA            SB05      R    8 00       COLHDG('生效日期')
     A                                      REFFLD(#AXX)
     A            SB06      R               COLHDG('折扣率')
     A                                      REFFLD(SA06)
     A**                                    螢幕顯示前須* 100
     A            SB07      R               COLHDG('搭贈比率－搭贈１')
     A                                      REFFLD(SA07)
     A            SB08      R               COLHDG('搭贈比率－採購１')
     A                                      REFFLD(SA08)
     A            SB09      R               COLHDG('搭贈比率－搭贈２')
     A                                      REFFLD(SA07)
     A            SB10      R               COLHDG('搭贈比率－採購２')
     A                                      REFFLD(SA08)
     A            SB11      R               COLHDG('搭贈比率－搭贈３')
     A                                      REFFLD(SA07)
     A            SB12      R               COLHDG('搭贈比率－採購３')
     A                                      REFFLD(SA08)
B2CHKA            SB13      R    8 00       COLHDG('截止日期')
     A                                      REFFLD(#AXX)
     A            SB14      R               COLHDG('待確認註記')
     A                                      REFFLD(SA14)
     A*                                     '*' -待確認
     A*                                     'P' -已列印
     A*                                     ' ' -已確認
B2CHKA            SBXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SBYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷售訂單主檔(SOSCPF)     KEY=SC02
     A*****************************************************************
     A            SC01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SC02          12          COLHDG('訂單號碼')
     A*                         XX   -  XX  -    XX    - XXXXXX
     A*                       公司 -單別-西元年份-序號
     A            SC03      R               COLHDG('單別')
     A                                      REFFLD(#202)
     A            SC04      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            SC05      R               COLHDG('分店代號')
     A                                      REFFLD(ME02)
     A            SC06          12          COLHDG('客戶訂單號碼')
B2CHKA            SC07      R    8 00       COLHDG('訂單日期')
     A                                      REFFLD(#AXX)
B2CHKA            SC08      R    8 00       COLHDG('預計送貨日期')
     A                                      REFFLD(#AXX)
     A            SC09      R               COLHDG('發票聯數')
     A                                      REFFLD(MD18)
     A            SC10           2          COLHDG('試飲原因代碼')
     A            SC11      R               COLHDG('出貨物流點')
     A                                      REFFLD(#D03)
     A            SC12           9P 0       COLHDG('總金額')
     A            SC13           1          COLHDG('訂單狀態')
     A**                                    非寄賣訂單
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'V' -已送貨確認
     A*                                     'C' -電腦核準
     A**                                    寄賣訂單
     A*                                     'D' -發票作廢待重開
     A            SC14      R               COLHDG('發票地址－總店')
     A                                      REFFLD(MD01)
     A            SC15      R               COLHDG('發票地址－分店')
     A                                      REFFLD(ME02)
     A            SC16      R               COLHDG('送貨地址－總店')
     A                                      REFFLD(MD01)
     A            SC17      R               COLHDG('送貨地址－分店')
     A                                      REFFLD(ME02)
     A            SC18          52O         COLHDG('訂單附註１')
     A            SC19          52O         COLHDG('訂單附註２')
     A            SC20          52O         COLHDG('訂單附註３')
     A            SC21          26O         COLHDG('核準備註')
     A            SC22           1          COLHDG('單價待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SC23           1          COLHDG('額度待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SC24           1          COLHDG('逾期待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SC25           1          COLHDG('搭贈待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SC26           1          COLHDG('試飲待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A            SC27      R               COLHDG('業務人員')
     A                                      REFFLD(MC01)
     A*                                     FROM客戶主檔
     A            SC28      R               COLHDG('業務員組別')
     A                                      REFFLD(MC03)
     A*                                     FROM員工主檔於新增代入
     A*                                         修改時不更新
     A            SC29          12          COLHDG('送貨單號')
     A            SC30          10          COLHDG('發票號碼')
     A            SC31      R               COLHDG('客戶地區')
     A                                      REFFLD(#D01)
     A            SC32      R               COLHDG('客戶區域')
     A                                      REFFLD(#E02)
     A            SC33      R               COLHDG('通路')
     A                                      REFFLD(#C01)
     A            SC34      R               COLHDG('型態')
     A                                      REFFLD(#C02)
     A            SC35           1          COLHDG('轉帳註記')
     A*                                     'V' -已轉帳
     A*                                     ' ' -尚未轉帳
     A*                                     '*' -公司間買賣CL->RE
     A*                                            無須轉帳
     A*                                     'T' -轉帳訂單
     A*                                     'N' -無須轉帳(轉帳處理時更新)
     A            SC36      R               COLHDG('進貨物流點')
     A                                      REFFLD(#D03)
     A            SC37           1          COLHDG('課稅別')
     A*                                     'D' -應稅
     A*                                     'B' -免稅
     A*                                     'Z' -零稅
     A            SC38           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
B2CHKA            SC39      R    8 00       COLHDG('確認日期')
     A                                      REFFLD(#AXX)
B2CHKA            SCXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SCYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SCZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷售訂單明細檔(SOSDPF)   KEY=SD02+SD03
     A*****************************************************************
     A            SD01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SD02      R               COLHDG('訂單號碼')
     A                                      REFFLD(SC02)
     A            SD03      R               COLHDG('產品編號')
     A                                      REFFLD(MA01)
     A            SD04           5P 0       COLHDG('訂貨數量')
     A            SD05           4S 0       COLHDG('搭贈數量')
     A            SD06           9P 2       COLHDG('單價')
     A            SD07           9P 0       COLHDG('金額')
     A            SD08      R               COLHDG('正常單價')
     A                                      REFFLD(SD06)
     A            SD09      R               COLHDG('正常搭贈數量')
     A                                      REFFLD(SD05)
     A            SD10      R               COLHDG('單位成本-FOB')
     A                                      REFFLD(MA31)
     A            SD11      R               COLHDG('單位成本-FHI')
     A                                      REFFLD(MA32)
     A            SD12      R               COLHDG('單位成本-DUTY')
     A                                      REFFLD(MA33)
     A            SD13      R               COLHDG('正常折扣金額')
     A                                      REFFLD(SD07)
     A            SD14      R               COLHDG('特別折扣金額')
     A                                      REFFLD(SD07)
     A            SD15      R               COLHDG('牌價')
     A                                      REFFLD(MA40)
     A            SD16      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
     A            SD17           1          COLHDG('單價待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SD18           1          COLHDG('搭贈待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
B2CHKA            SD19      R    8 00       COLHDG('預計送貨日期')
     A                                      REFFLD(#AXX)
     A            SD20      R               COLHDG('出貨物流點')
     A                                      REFFLD(#D03)
     A            SD21      R               COLHDG('進貨物流點')
     A                                      REFFLD(#D03)
     A            SD22      R               COLHDG('轉帳單位成本-FOB')
     A                                      REFFLD(MA31)
     A            SD23      R               COLHDG('轉帳單位成本-FHI')
     A                                      REFFLD(MA32)
     A            SD24      R               COLHDG('轉帳單位成本-DUTY')
     A                                      REFFLD(MA33)
     A*ERIC911124
     A            SD131         11P 2       COLHDG('正常折扣金額')
     A            SD141         11P 2       COLHDG('特別折扣金額')
     A*ERIC911124
B2CHKA            SDXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SDYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷售銷退月檔  (SOCDPF)   KEY=CD01-CD15
     A*****************************************************************
B2MODA            CD01           6 00       COLHDG('確認年月')
     A            CD02           1A         COLHDG('辦事處')
     A*                                     1=台北
     A*                                     2=台中
     A*                                     3=高雄
     A            CD03      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            CD04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            CD05           1A         COLHDG('拆解註記')
     A*                                     'Y'=從禮盒拆出之單瓶
     A*                                     ' '=非禮盒拆出之單瓶
     A            CD06      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
     A            CD07      R               COLHDG('分店代號')
     A                                      REFFLD(#B15)
     A            CD09      R               COLHDG('業務人員')
     A                                      REFFLD(MC01)
     A            CD10      R               COLHDG('業務員組別')
     A                                      REFFLD(MC03)
     A            CD11      R               COLHDG('客戶地區')
     A                                      REFFLD(#D01)
     A            CD12      R               COLHDG('客戶區域')
     A                                      REFFLD(#E02)
     A            CD13      R               COLHDG('通路')
     A                                      REFFLD(#C01)
     A            CD14      R               COLHDG('型態')
     A                                      REFFLD(#C02)
     A            CD15           1A         COLHDG('轉帳註記')
     A*                                     ' ' -非轉帳訂單
     A*                                     'T' -轉帳訂單
     A            CD16           5S 0       COLHDG('訂貨量')
     A            CD17           5S 0       COLHDG('搭贈量')
     A            CD18           5S 0       COLHDG('試飲量')
     A            CD19           5S 0       COLHDG('寄賣量')
     A            CD20           5S 0       COLHDG('訂購銷退量')
     A            CD21           5S 0       COLHDG('搭贈銷退量')
     A            CD22           5S 0       COLHDG('收回量')
     A            CD23           5S 0       COLHDG('試飲收回量')
     A            CD24           9S 0       COLHDG('累計訂貨金額')
     A            CD25           9S 0       COLHDG('累計寄賣金額')
     A*                                     專櫃－寄賣訂單
     A            CD26           9S 0       COLHDG('累計銷退金額')
     A            CD27           1A         COLHDG('禮盒碼')
     A*                                     'Y' -禮盒
     A*                                     ' ' -單瓶
     A            CD28           1A         COLHDG('產品分類碼')
     A*                                     'R' - RM
     A*                                     'S' - OTHER SPIRITS
     A*                                     'W' - WINE
     A*                                     'O' -專櫃
     A            CD29      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
     A            CD30      R               COLHDG('品牌')
     A                                      REFFLD(MA10)
     A            CD31           4A         COLHDG('產品前四碼')
B2CHKA            CDXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            CDYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            CDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          送貨單主檔(SOSEPF)      KEY=SE02
     A*****************************************************************
     A            SE01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SE02          12          COLHDG('送貨單號')
     A*                         XX   -  XX  -    XX    - XXXXXX
     A*                       公司 -單別-西元年份-序號
     A            SE03      R               COLHDG('單別')
     A                                      REFFLD(#202)
     A            SE04      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            SE05      R               COLHDG('分店代號')
     A                                      REFFLD(ME02)
B2CHKA            SE06      R    8 00       COLHDG('交貨日期')
     A                                      REFFLD(#AXX)
     A            SE07      R               COLHDG('出貨物流點')
     A                                      REFFLD(#D03)
     A            SE08           9P 0       COLHDG('總金額')
     A            SE09           1          COLHDG('送貨單狀態')
     A*                                     '*' -待核準
     A*                                     'V' -已送貨確認
     A*                                     ' ' -已核準未送貨
     A*                                     'C' -電腦核準
     A            SE10      R               COLHDG('送貨地址－總店')
     A                                      REFFLD(MD01)
     A            SE11      R               COLHDG('送貨地址－分店')
     A                                      REFFLD(ME02)
     A            SE12          52O         COLHDG('備註１')
     A            SE13          52O         COLHDG('備註２')
     A            SE14          52O         COLHDG('備註３')
     A            SE15           1          COLHDG('單價待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SE16           1          COLHDG('額度待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SE17           1          COLHDG('逾期待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SE18           1          COLHDG('搭贈待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'C' -電腦核準
     A            SE19           1          COLHDG('換貨待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A            SE20           3P 0       COLHDG('列印序號')
B2CHKA            SE21      R    8 00       COLHDG('派車日期')
     A                                      REFFLD(#AXX)
     A            SE22           8          COLHDG('派車車號')
     A            SE23           3P 0       COLHDG('車次')
B2CHKA            SE24      R    8 00       COLHDG('確認日期')
     A                                      REFFLD(#AXX)
     A            SE25           1          COLHDG('列印註記')
     A*                                     'V' -已列印
     A*                                     '*' -已執行訂單批次作業該送貨不得
     A*                                          　再行修改或刪除
     A*                                     ' ' -未列印
     A            SE26      R               COLHDG('收貨物流點')
     A                                      REFFLD(#D03)
     A            SE27      R               COLHDG('通路')
     A                                      REFFLD(#C01)
     A            SE28      R               COLHDG('型態')
     A                                      REFFLD(#C02)
     A            SE29      R               COLHDG('訂單號碼')
     A                                      REFFLD(SC02)
     A            SE30      R               COLHDG('發票號碼')
     A                                      REFFLD(SC30)
     A            SE31           1          COLHDG('發票狀態')
     A*                                     '*' -發票已作廢待重開
     A*                                          發票號碼不為�玅磃洬M空白時，
     A*                                        　且確認時數量改變
     A*                                     'V' -發票已重開
     A*                                     'D' -發票已作廢但無須重開
     A*                                          例．確認數量為零
     A            SE32      R               COLHDG('業務員')
     A                                      REFFLD(MC01)
     A            SE33      R               COLHDG('部門別')
     A                                      REFFLD(MC03)
     A            SE34      R               COLHDG('地區')
     A                                      REFFLD(#D01)
     A            SE35      R               COLHDG('區域')
     A                                      REFFLD(#E02)
     A            SE36           1          COLHDG('轉帳註記')
     A*                                     'V' -已轉帳
     A*                                     ' ' -尚未轉帳
     A*                                     '*' -公司間買賣CL->RE
     A*                                            無須轉帳
     A*                                     'T' -轉帳送貨單
     A*                                     'N' -無須轉帳(轉帳處理時更新)
     A            SE37           9P 0       COLHDG('原總金額')
     A            SE38           1          COLHDG('課稅別')
     A*                                     'D' -應稅
     A*                                     'B' -免稅
     A*                                     'Z' -零稅
B2CHKA            SE39      R    8 00       COLHDG('送貨單日期')
     A                                      REFFLD(#AXX)
     A            SE40           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A            SE41      R               COLHDG('發票地址－總店')
     A                                      REFFLD(MD01)
     A            SE42      R               COLHDG('發票地址－分店')
     A                                      REFFLD(ME02)
B2CHKA            SEXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SEYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          送貨單明細檔(SOSFPF)     KEY=SF02+SF03
     A*****************************************************************
     A            SF01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SF02      R               COLHDG('送貨單號')
     A                                      REFFLD(SE02)
     A            SF03      R               COLHDG('產品編號')
     A                                      REFFLD(MA01)
     A            SF04           5P 0       COLHDG('訂購數量')
     A            SF05           4S 0       COLHDG('搭贈數量')
     A            SF06           9P 2       COLHDG('單價')
     A            SF07           9P 0       COLHDG('金額－確認前')
     A            SF08      R               COLHDG('正常單價')
     A                                      REFFLD(SD06)
     A            SF09      R               COLHDG('正常搭贈數量')
     A                                      REFFLD(SD05)
     A            SF10      R               COLHDG('單位成本-FOB')
     A                                      REFFLD(MA31)
     A            SF11      R               COLHDG('單位成本-FHI')
     A                                      REFFLD(MA32)
     A            SF12      R               COLHDG('單位成本-DUTY')
     A                                      REFFLD(MA33)
     A            SF13      R               COLHDG('正常折扣金額')
     A                                      REFFLD(SD07)
     A            SF14      R               COLHDG('特別折扣金額')
     A                                      REFFLD(SD07)
     A            SF15      R               COLHDG('牌價')
     A                                      REFFLD(MA40)
     A            SF16      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
     A            SF17           1          COLHDG('單價待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'V' -電腦核準
     A            SF18           1          COLHDG('搭贈待核準註記')
     A*                                     '*' -待核準
     A*                                     ' ' -已核準
     A*                                     'V' -電腦核準
     A            SF19      R               COLHDG('確認訂購數量')
     A                                      REFFLD(SF04)
     A            SF20      R               COLHDG('確認搭贈數量')
     A                                      REFFLD(SF05)
     A**          SF21      R               COLHDG('確認日期')
     A**                                    REFFLD(#AXX)
B2CHKA            SF22      R    8 00       COLHDG('派車日期')
     A                                      REFFLD(#AXX)
     A            SF23      R               COLHDG('派車車號')
     A                                      REFFLD(SE22)
     A            SF24      R               COLHDG('車次')
     A                                      REFFLD(SE23)
B2CHKA            SF25      R    8 00       COLHDG('交貨日期')
     A                                      REFFLD(#AXX)
     A            SF26      R               COLHDG('出貨物流點')
     A                                      REFFLD(#D03)
     A            SF27      R               COLHDG('收貨物流點')
     A                                      REFFLD(#D03)
     A            SF28      R               COLHDG('轉帳單位成本-FOB')
     A                                      REFFLD(MA31)
     A            SF29      R               COLHDG('轉帳單位成本-FHI')
     A                                      REFFLD(MA32)
     A            SF30      R               COLHDG('轉帳單位成本-DUTY')
     A                                      REFFLD(MA33)
     A*ERIC911124
     A            SF131         11P 2       COLHDG('正常折扣金額')
     A            SF141         11P 2       COLHDG('特別折扣金額')
     A*ERIC911124
B2CHKA            SFXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SFYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷貨退回主檔(SOSGPF)     KEY=SG02
     A*****************************************************************
     A            SG01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SG02          12          COLHDG('退貨單號')
     A*                         XX   -  XX  -    XX    - XXXXXX
     A*                       公司 -單別-西元年份-序號
     A            SG03      R               COLHDG('單別')
     A                                      REFFLD(#202)
     A            SG04      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            SG05      R               COLHDG('分店代號')
     A                                      REFFLD(ME02)
B2CHKA            SG06      R    8 00       COLHDG('退貨日期')
     A                                      REFFLD(#AXX)
     A            SG07      R               COLHDG('退回物流點')
     A                                      REFFLD(#D03)
     A            SG08           2          COLHDG('退貨原因')
     A            SG09          12          COLHDG('折讓單號')
     A            SG10           9P 0       COLHDG('銷退金額')
     A            SG11      R               COLHDG('業務員')
     A                                      REFFLD(MC01)
     A            SG12      R               COLHDG('部門別')
     A                                      REFFLD(MC03)
     A            SG13          11P 2       COLHDG('銷退成本－總成本')
     A            SG14           1          COLHDG('狀態')
     A*                                     '*' -待確認
     A*                                         -轉帳退貨單初值
     A*                                     ' ' -未完全確認
     A*                                     'V' -已完全確認
     A*                                     'A' -已轉帳
     A*                                     'N' -無須轉帳(轉帳處理時更新)
     A            SG15      R               COLHDG('地區')
     A                                      REFFLD(#D01)
     A            SG16           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A            SG17      R               COLHDG('原退貨單號')
     A                                      REFFLD(SG02)
     A**                                    若為轉帳退貨單時此欄位紀
     A**                                    　錄原退貨單號
     A            SG18      R               COLHDG('原折讓單號')
     A                                      REFFLD(SG09)
     A**                                    若為轉帳退貨單時此欄位紀
     A**                                    　錄原折讓單號
     A            SG19          11P 2       COLHDG('銷退成本－FOB')
     A            SG20          11P 2       COLHDG('銷退成本－FHI')
     A            SG21          11P 2       COLHDG('銷退成本－DUTY')
     A            SG22          11P 2       COLHDG('轉帳銷退成本－FOB')
     A            SG23          11P 2       COLHDG('轉帳銷退成本－FHI')
     A            SG24          11P 2       COLHDG('轉帳銷退成本－DUTY')
     A            SG25          11P 2       COLHDG('跨月折讓註記')
      *                                     1='跨月'
      *                                     0='正常未跨月'
B2CHKA            SG26      R    8 00       COLHDG('折讓日期')
     A                                      REFFLD(#AXX)
B2CHKA            SGXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SGYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷貨退回明細檔(SOSHPF)   KEY=SH02+SH03
     A*****************************************************************
     A            SH01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SH02      R               COLHDG('退貨單號')
     A                                      REFFLD(SG02)
     A            SH03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SH04           5P 0       COLHDG('數量')
     A            SH05           4S 0       COLHDG('搭贈數量')
     A            SH06      R               COLHDG('已分配總數量')
     A                                      REFFLD(SH04)
     A            SH07           9P 0       COLHDG('銷退金額')
     A            SH08          11P 2       COLHDG('銷退成本－總成本')
B2CHKA            SH09      R    8 00       COLHDG('退貨日期')
     A                                      REFFLD(#AXX)
     A            SH10      R               COLHDG('退回物流點')
     A                                      REFFLD(#D03)
     A            SH11      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
     A            SH12      R               COLHDG('已分配數量－訂購')
     A                                      REFFLD(SH04)
     A            SH13      R               COLHDG('已分配數量－搭贈')
     A                                      REFFLD(SD05)
     A            SH14          11P 2       COLHDG('銷退成本－FOB')
     A            SH15          11P 2       COLHDG('銷退成本－FHI')
     A            SH16          11P 2       COLHDG('銷退成本－DUTY')
     A            SH17          11P 2       COLHDG('轉帳銷退成本－FOB')
     A            SH18          11P 2       COLHDG('轉帳銷退成本－FHI')
     A            SH19          11P 2       COLHDG('轉帳銷退成本－DUTY')
     A            SH20          11P 2       COLHDG('轉帳銷退總成本')
B2CHKA            SHXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SHYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SHZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          發票主檔(SOSIPF)         KEY=SI01+SI02
     A*****************************************************************
     A            SI01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SI02          10          COLHDG('發票號碼')
     A            SI03      R               COLHDG('通路')
     A                                      REFFLD(#C01)
     A            SI04      R               COLHDG('型態')
     A                                      REFFLD(#C02)
     A            SI05      R               COLHDG('物流點')
     A                                      REFFLD(#D03)
B2CHKA            SI06      R    8 00       COLHDG('送貨日期')
     A                                      REFFLD(#AXX)
     A*                                     寄賣訂單發票此欄存訂單日期
     A*
     A            SI07           4          COLHDG('檢查號碼')
     A            SI08      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            SI09      R               COLHDG('分店代號')
     A                                      REFFLD(ME02)
     A            SI10      R               COLHDG('訂單編號')
     A                                      REFFLD(SC02)
     A            SI11      R               COLHDG('送貨單號')
     A                                      REFFLD(SE02)
     A            SI12      R               COLHDG('發票地址－總店')
     A                                      REFFLD(MD01)
     A            SI13      R               COLHDG('發票地址－分店')
     A                                      REFFLD(ME02)
     A            SI14      R               COLHDG('送貨地址－總店')
     A                                      REFFLD(MD01)
     A            SI15      R               COLHDG('送貨地址－分店')
     A                                      REFFLD(ME02)
     A            SI16           1          COLHDG('虛擬發票')
     A*                                     Y-虛擬發票
     A            SI17           1P 0       COLHDG('發票聯數')
     A            SI18           1          COLHDG('狀態')
     A*                                     *-數量修改待作廢
     A*                                     V-作廢後已重開
     A*                                     D-已作廢但無須重開
     A*                                         例確認數量為零
     A            SI19           1          COLHDG('作廢註記')
     A*                                     'V' -已作廢
     A            SI20           1          COLHDG('申報註記')
     A*                                     'V' -已申報
B2CHKA            SI21      R    8 00       COLHDG('發票日期')
     A                                      REFFLD(#AXX)
     A            SI22           1          COLHDG('課稅別')
     A*                                     'D' -應稅
     A*                                     'B' -免稅
     A*                                     'Z' -零稅
     A            SI23           9P 0       COLHDG('銷售金額')
     A            SI24           9P 0       COLHDG('營業稅')
     A            SI25           9P 0       COLHDG('發票金額')
     A            SI26           9P 0       COLHDG('已沖金額')
     A            SI27           9P 0       COLHDG('價差金額')
     A            SI28           9P 0       COLHDG('銷退金額')
B2CHKA            SI29      R    8 00       COLHDG('應收日期')
     A                                      REFFLD(#AXX)
     A            SI30           9P 0       COLHDG('未沖金額')
     A            SI31      R               COLHDG('業務員')
     A                                      REFFLD(MC01)
     A            SI32      R               COLHDG('部門別')
     A                                      REFFLD(MC03)
     A            SI33           3P 0       COLHDG('列印序號')
     A            SI34           1          COLHDG('重開註記')
     A*                                     'Y'-是重開之發票
     A*                                     ' '-非重開之發票
B2CHKA            SI35      R    8 00       COLHDG('確認日期')
     A                                      REFFLD(#AXX)
B2CHKA            SIXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SIYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SIZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          發票明細檔(SOSJPF)       KEY=SJ02+SJ03
     A*****************************************************************
     A            SJ01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SJ02      R               COLHDG('發票號碼')
     A                                      REFFLD(SI02)
     A            SJ03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SJ04           5P 0       COLHDG('數量')
     A            SJ05           9P 2       COLHDG('單價')
     A            SJ06           9P 0       COLHDG('金額')
     A            SJ07           9P 0       COLHDG('折扣')
     A            SJ08      R               COLHDG('銷退數量－總數量')
     A                                      REFFLD(SJ04)
     A            SJ09      R               COLHDG('銷退金額')
     A                                      REFFLD(SJ06)
     A            SJ10      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
     A            SJ11      R               COLHDG('客戶代號－發票')
     A                                      REFFLD(MD01)
     A            SJ12      R               COLHDG('分店代號－發票')
     A                                      REFFLD(ME02)
     A            SJ13      R               COLHDG('搭贈數量')
     A                                      REFFLD(SD05)
     A            SJ14      R               COLHDG('銷退數量－訂購')
     A                                      REFFLD(SJ04)
     A            SJ15      R               COLHDG('銷退數量－搭贈')
     A                                      REFFLD(SD05)
B2CHKA            SJ16      R    8 00       COLHDG('發票日期')
     A                                      REFFLD(#AXX)
     A****ERIC911125
     A            SJ071         11P 2       COLHDG('折扣')
     A            SJ061         11P 2       COLHDG('金額')
     A            SJ091         11P 2       COLHDG('銷退金額')
     A*
B2CHKA            SJXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SJYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SJZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷售目標達成率資料檔(SOSKPF)  KEY=SK01-SK06
     A*****************************************************************
     A            SK01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
B2MODA            SK02           4S00       COLHDG('年度')
     A            SK03      R               COLHDG('通路')
     A                                      REFFLD(#C01)
     A            SK04      R               COLHDG('型態')
     A                                      REFFLD(#C02)
     A            SK05      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            SK06      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SK07      R               COLHDG('辦事處　')
     A                                      REFFLD(#D01)
     A            SK08           7P 0       COLHDG('銷售數量－年度')
     A            SK09           9P 0       COLHDG('銷售金額－年度')
     A            SK10           7P 0       COLHDG('銷售數量－四月')
     A            SK11      R               COLHDG('銷售數量－五月')
     A                                      REFFLD(SK10)
     A            SK12      R               COLHDG('銷售數量－六月')
     A                                      REFFLD(SK10)
     A            SK13      R               COLHDG('銷售數量－七月')
     A                                      REFFLD(SK10)
     A            SK14      R               COLHDG('銷售數量－八月')
     A                                      REFFLD(SK10)
     A            SK15      R               COLHDG('銷售數量－九月')
     A                                      REFFLD(SK10)
     A            SK16      R               COLHDG('銷售數量－十月')
     A                                      REFFLD(SK10)
     A            SK17      R               COLHDG('銷售數量－十一月')
     A                                      REFFLD(SK10)
     A            SK18      R               COLHDG('銷售數量－十二月')
     A                                      REFFLD(SK10)
     A            SK19      R               COLHDG('銷售數量－次一月')
     A                                      REFFLD(SK10)
     A            SK20      R               COLHDG('銷售數量－次二月')
     A                                      REFFLD(SK10)
     A            SK21      R               COLHDG('銷售數量－次三月')
     A                                      REFFLD(SK10)
     A            SK22           9P 0       COLHDG('銷售金額－四月')
     A            SK23      R               COLHDG('銷售金額－五月')
     A                                      REFFLD(SK22)
     A            SK24      R               COLHDG('銷售金額－六月')
     A                                      REFFLD(SK22)
     A            SK25      R               COLHDG('銷售金額－七月')
     A                                      REFFLD(SK22)
     A            SK26      R               COLHDG('銷售金額－八月')
     A                                      REFFLD(SK22)
     A            SK27      R               COLHDG('銷售金額－九月')
     A                                      REFFLD(SK22)
     A            SK28      R               COLHDG('銷售金額－十月')
     A                                      REFFLD(SK22)
     A            SK29      R               COLHDG('銷售金額－十一月')
     A                                      REFFLD(SK22)
     A            SK30      R               COLHDG('銷售金額－十二月')
     A                                      REFFLD(SK22)
     A            SK31      R               COLHDG('銷售金額－次一月')
     A                                      REFFLD(SK22)
     A            SK32      R               COLHDG('銷售金額－次二月')
     A                                      REFFLD(SK22)
     A            SK33      R               COLHDG('銷售金額－次三月')
     A                                      REFFLD(SK22)
B2CHKA            SKXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SKYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SKZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          專櫃目標達成率資料檔(SOSLPF)  KEY=SL01-SL03
     A*****************************************************************
     A            SL01      R               COLHDG('專櫃代號')
     A                                      REFFLD(#D03)
B2MODA            SL02           4S00       COLHDG('年度')
     A            SL03      R               COLHDG('產品識別')
     A                                      REFFLD(MA08)
     A            SL04           9P 0       COLHDG('銷售金額－年度')
     A            SL05           9P 0       COLHDG('銷售金額－四月')
     A            SL06      R               COLHDG('銷售金額－五月')
     A                                      REFFLD(SL05)
     A            SL07      R               COLHDG('銷售金額－六月')
     A                                      REFFLD(SL05)
     A            SL08      R               COLHDG('銷售金額－七月')
     A                                      REFFLD(SL05)
     A            SL09      R               COLHDG('銷售金額－八月')
     A                                      REFFLD(SL05)
     A            SL10      R               COLHDG('銷售金額－九月')
     A                                      REFFLD(SL05)
     A            SL11      R               COLHDG('銷售金額－十月')
     A                                      REFFLD(SL05)
     A            SL12      R               COLHDG('銷售金額－十一月')
     A                                      REFFLD(SL05)
     A            SL13      R               COLHDG('銷售金額－十二月')
     A                                      REFFLD(SL05)
     A            SL14      R               COLHDG('銷售金額－次一月')
     A                                      REFFLD(SL05)
     A            SL15      R               COLHDG('銷售金額－次二月')
     A                                      REFFLD(SL05)
     A            SL16      R               COLHDG('銷售金額－次三月')
     A                                      REFFLD(SL05)
B2CHKA            SLXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SLYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SLZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          產品收回主檔(SOSNPF)     KEY=SN02
     A*****************************************************************
     A            SN01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SN02          12          COLHDG('單據號碼')
     A*                        XX   -  XX  -    XX    - XXXXXX
     A*                      公司 -單別-西元年份-序號
     A            SN03      R               COLHDG('出貨物流點代號')
     A                                      REFFLD(#D03)
     A            SN04      R               COLHDG('收貨物流點代號')
     A                                      REFFLD(#D03)
B2CHKA            SN05      R    8 00       COLHDG('收回日期')
     A                                      REFFLD(#AXX)
B2CHKA            SN06      R    8 00       COLHDG('實際入庫日')
     A                                      REFFLD(#AXX)
     A            SN07      R               COLHDG('業務人員')
     A                                      REFFLD(MC01)
     A*                                     FROM客戶主檔
     A            SN08      R               COLHDG('業務員組別')
     A                                      REFFLD(MC03)
     A*                                     FROM員工主檔於新增代入
     A*                                         修改時不更新
     A            SN09           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A            SN10           1          COLHDG('轉帳註記')
     A**                                    'V' -已轉帳
     A**                                    'T' -轉帳單據
     A*                                     'N' -無須轉帳(轉帳處理時更新)
     A            SN11      R               COLHDG('客戶分店')
     A                                      REFFLD(ME02)
     A            SN12           9P 0       COLHDG('收回總金額')
     A            SN13          11P 2       COLHDG('收回FOB-TOT')
     A            SN14          11P 2       COLHDG('收回FHI-TOT')
     A            SN15          11P 2       COLHDG('收回DUTY-TOT')
B2CHKA            SNXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SNYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SNZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          產品收回明細檔(SOSOPF) KEY=SO02+SO03
     A*****************************************************************
     A            SO01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SO02      R               COLHDG('單據號碼')
     A                                      REFFLD(SN02)
     A            SO03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SO04           5P 0       COLHDG('收回數量－合計')
     A            SO05           5P 0       COLHDG('確認數量')
     A            SO06           5P 0       COLHDG('收回數量－訂購')
     A            SO07           5P 0       COLHDG('收回數量－搭贈')
B2CHKA            SO08      R    8 00       COLHDG('收回日期')
     A                                      REFFLD(#AXX)
     A            SO09      R               COLHDG('出貨物流點代號')
     A                                      REFFLD(#D03)
     A            SO10      R               COLHDG('收貨物流點代號')
     A                                      REFFLD(#D03)
     A            SO11      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
     A            SO12      R               COLHDG('單價')
     A                                      REFFLD(SD06)
     A*                                     收回當時之客戶報價
     A            SO13      R               COLHDG('轉帳FOB-TOT')
     A                                      REFFLD(MA26)
     A            SO14      R               COLHDG('轉帳FHI-TOT')
     A                                      REFFLD(MA27)
     A            SO15      R               COLHDG('轉帳DUTY-TOT')
     A                                      REFFLD(MA28)
     A            SO16          11P 2       COLHDG('收回FOB-TOT')
     A            SO17          11P 2       COLHDG('收回FHI-TOT')
     A            SO18          11P 2       COLHDG('收回DUTY-TOT')
B2CHKA            SOXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SOYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SOZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          原始／轉帳單據對照檔(SOSPPF) KEY=SP01
     A*****************************************************************
     A            SP01      R               COLHDG('原始單號')
     A                                      REFFLD(SG02)
     A            SP02      R               COLHDG('轉帳單據單號')
     A                                      REFFLD(SG02)
     A            SP03      R               COLHDG('原始發票號碼')
     A                                      REFFLD(SC30)
     A            SP04      R               COLHDG('轉帳發票號碼')
     A                                      REFFLD(SC30)
     A            SP05           1          COLHDG('還原保留量')
     A**                                    'Y'-此單據須還原保留量
     A**                                    'N'-此單據無須還原保留量
B2CHKA            SPXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SPYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SPZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          經銷商送貨累計檔(SOSQPF) KEY=SQ01+SQ02+SQ03
     A*****************************************************************
     A            SQ01      R               COLHDG('補貨送貨單號')
     A                                      REFFLD(SE02)
     A            SQ02      R               COLHDG('經銷商代號')
     A                                      REFFLD(MD01)
     A            SQ03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SQ04      R               COLHDG('累計訂購數量')
     A                                      REFFLD(SD04)
     A            SQ05      R               COLHDG('累計搭贈數量')
     A                                      REFFLD(SD05)
     A            SQ06      R               COLHDG('累計中間成本-FOB')
     A                                      REFFLD(MA26)
     A            SQ07      R               COLHDG('累計中間成本-FHI')
     A                                      REFFLD(MA27)
     A            SQ08      R               COLHDG('累計中間成本-DUTY')
     A                                      REFFLD(MA28)
     A            SQ09           1          COLHDG('過帳註記')
     A*                                     暫保留
     A            SQ10      R               COLHDG('差異成本-FOB')
     A                                      REFFLD(MA26)
     A****差異成本-FOB(SQ10)=累計成本-FOB(SQ06)－
     A****                    (單位成本-FOB(SF10)も　訂購＋搭贈SF04+SF05
     A            SQ11      R               COLHDG('差異成本-FHI')
     A                                      REFFLD(MA27)
     A****差異成本-FHI(SQ11)=累計成本-FHI(SQ07)－
     A****                    (單位成本-FOB(SF11)も　訂購＋搭贈SF04+SF05
     A            SQ12      R               COLHDG('差異成本-DUTY')
     A                                      REFFLD(MA28)
     A****差異成本-DUT(SQ12)=累計成本-DUT(SQ08)－
     A****                    (單位成本-FOB(SF12)も　訂購＋搭贈SF04+SF05
     A            SQ13      R               COLHDG('累計轉帳成本-FOB')
     A                                      REFFLD(MA26)
     A            SQ14      R               COLHDG('累計轉帳成本-FHI')
     A                                      REFFLD(MA27)
     A            SQ15      R               COLHDG('累計轉帳成本-DUTY')
     A                                      REFFLD(MA28)
     A            SQ16      R               COLHDG('轉帳差異成本-FOB')
     A                                      REFFLD(MA26)
     A****差異成本-FOB(SQ16)=累計成本-FOB(SQ13)－
     A****                    (單位成本-FOB(SF28)も　訂購＋搭贈SF04+SF05
     A            SQ17      R               COLHDG('轉帳差異成本-FHI')
     A                                      REFFLD(MA27)
     A****差異成本-FHI(SQ17)=累計成本-FHI(SQ14)－
     A****                    (單位成本-FOB(SF29)も　訂購＋搭贈SF04+SF05
     A            SQ18      R               COLHDG('轉帳差異成本-DUTY')
     A                                      REFFLD(MA28)
     A****差異成本-DUT(SQ18)=累計成本-DUT(SQ15)－
     A****                    (單位成本-FOB(SF30)も　訂購＋搭贈SF04+SF05
B2CHKA            SQXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SQYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SQZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*        禮盒銷售分析成本檔(SOSRPF)   KEY=SR02+SR03+SR04
     A*****************************************************************
     A            SR01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            SR02      R               COLHDG('訂單號碼')
     A                                      REFFLD(SC02)
     A            SR03      R               COLHDG('禮盒代號')
     A                                      REFFLD(MA01)
     A            SR04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SR05      R               COLHDG('單位')
     A                                      REFFLD(MA13)
     A            SR06           3P 0       COLHDG('數量')
     A            SR07           9P 2       COLHDG('分析成本-UN-FOB')
     A            SR08           9P 2       COLHDG('分析成本-UN-FHI')
     A            SR09           9P 2       COLHDG('分析成本-UN-DTY')
B2CHKA            SRXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SRYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SRZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          人工發票重開控制檔(SOSSPF)         KEY=SS01+SS02
     A*****************************************************************
     A            SS01      R               COLHDG('原發票公司別')
     A                                      REFFLD(#B01)
     A            SS02          10          COLHDG('原發票號碼')
     A            SS03      R               COLHDG('人工發票公司別')
     A                                      REFFLD(#B01)
     A            SS04          10          COLHDG('人工發票號碼')
B2CHKA            SS06      R    8 00       COLHDG('原送貨日期')
     A*                                     原送貨日期
     A                                      REFFLD(#AXX)
     A            SS08      R               COLHDG('客戶代號')
     A                                      REFFLD(MD01)
     A            SS09      R               COLHDG('分店代號')
     A                                      REFFLD(ME02)
     A            SS10      R               COLHDG('訂單號碼')
     A                                      REFFLD(SC02)
     A            SS11      R               COLHDG('退貨單號')
      *                                     原因為Ｓ則空白
      *                                     原因為Ｒ銷退單號
     A                                      REFFLD(SC02)
     A            SS16           3          COLHDG('原因代碼')
     A*                                     S OR R打頭   FOR 切傳票
     A            SS20           1          COLHDG('申報註記')
     A*                                     'V' -已申報
B2CHKA            SS21      R    8 00       COLHDG('原發票日期')
     A                                      REFFLD(#AXX)
B2CHKA            SS22      R    8 00       COLHDG('人工發票日期')
      *                                     以原送貨單日期改
     A                                      REFFLD(#AXX)
     A            SS25          11P 2       COLHDG('人工發票金額')
     A            SS26          11P 2       COLHDG('人工折扣金額')
     A            SS27           9P 0       COLHDG('原發票金額')
     A            SS28           9P 0       COLHDG('原折扣金額')
B2CHKA            SS35      R    8 00       COLHDG('原確認日期')
     A                                      REFFLD(#AXX)
     A            SS36           1          COLHDG('過帳註記')
     A*                                     'V'=過帳
B2CHKA            SSXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SSYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SSZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          專櫃五日銷售檔(SOSTPF)         KEY=ST01-ST04
     A*****************************************************************
     A            ST01      R               COLHDG('專櫃代號')
     A                                      REFFLD(#B14)
B2MODA            ST02           6 00       COLHDG('銷售年月')
     A            ST03      R               COLHDG('PLU代號')
     A                                      REFFLD(MG01)
     A            ST04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            ST05      R               COLHDG('正常售價')
     A                                      REFFLD(SD06)
     A            ST06      R               COLHDG('01-05數量')
     A                                      REFFLD(SD06)
     A            ST6$      R               COLHDG('01-05售價')
     A                                      REFFLD(SD06)
     A            ST07      R               COLHDG('06-10數量')
     A                                      REFFLD(SD06)
     A            ST7$      R               COLHDG('06-10售價')
     A                                      REFFLD(SD06)
     A            ST08      R               COLHDG('11-15數量')
     A                                      REFFLD(SD06)
     A            ST8$      R               COLHDG('11-15售價')
     A                                      REFFLD(SD06)
     A            ST09      R               COLHDG('16-20數量')
     A                                      REFFLD(SD06)
     A            ST9$      R               COLHDG('16-20售價')
     A                                      REFFLD(SD06)
     A            ST10      R               COLHDG('21-25數量')
     A                                      REFFLD(SD06)
     A            ST0$      R               COLHDG('21-25售價')
     A                                      REFFLD(SD06)
     A            ST11      R               COLHDG('26-31數量')
     A                                      REFFLD(SD06)
     A            ST1$      R               COLHDG('26-31售價')
     A                                      REFFLD(SD06)
     A            ST12      R               COLHDG('每瓶公賣利益')
     A                                      REFFLD(MA25)
     A            ST13           1A         COLHDG('轉檔註記')
     A*                                     ' ' -未轉
     A*                                     '1' -變價位置１
     A*                                     '2' -變價位置２
     A*                                     '3' -變價位置３
     A*                                     '4' -變價位置４
     A*                                     '5' -變價位置５
     A*                                     '6' -變價位置６
     A*                                     'V' -轉畢
     A            ST14      R               COLHDG('專櫃部門')
     A                                      REFFLD(MG03)
     A            ST15      R               COLHDG('課稅別')
     A*                                     'D' -應稅
     A*                                     'B' -免稅
     A*                                     'Z' -零稅
     A                                      REFFLD(SC37)
     A            ST16           1  0       COLHDG('變價次數')
     A*                                     0 =未變價
     A*                                     1 =變價１次
     A*                                     2 =變價２次
     A*                                     3 =變價３次
     A*                                     4 =變價４次
     A*                                     5 =變價５次
     A*                                     6 =變價６次
     A            ST17      R               COLHDG('產品歸屬')
     A                                      REFFLD(MA07)
B2CHKA            STXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            STYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            STZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          專櫃五日訂單對照檔(SOSUPF)         KEY=SU01-SU05
     A*****************************************************************
     A            SU01      R               COLHDG('專櫃代號')
     A                                      REFFLD(#B14)
B2MODA            SU02           6 00       COLHDG('銷售年月')
     A            SU03      R               COLHDG('PLU代號')
     A                                      REFFLD(MG01)
     A            SU04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            SU05           1  0       COLHDG('變價別')
     A*                                     0 =未變價
     A*                                     1 =變價１次
     A*                                     2 =變價２次
     A*                                     3 =變價３次
     A*                                     4 =變價４次
     A*                                     5 =變價５次
     A*                                     6 =變價６次
     A            SU06      R               COLHDG('數量')
     A                                      REFFLD(SD06)
     A            SU07      R               COLHDG('售價')
     A                                      REFFLD(SD06)
     A            SU08      R               COLHDG('訂單號碼')
     A                                      REFFLD(SC02)
B2CHKA            SUXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            SUYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            SUZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*        媒體申報進銷檔(SOVQPF)     KEY=VQ91+VQ92+VQ01+VQ04
     A*****************************************************************
     A            VQ01           2          COLHDG('格式')
     A            VQ04           6  0       COLHDG('歸屬年月')
     A            VQ05           8          COLHDG('買受人統編')
     A            VQ07          12  0       COLHDG('銷售額／稅基')
     A            VQ08           1          COLHDG('課稅別')
     A            VQ09          10  0       COLHDG('營業稅')
     A            VQ10           1          COLHDG('扣抵代號')
      *
      *                                     1 =進項可扣抵之進貨及費用
      *                                     2 =進項可扣抵之固定資產
      *                                    空白代表銷項憑證或不可扣抵
      *                                    進項憑證
      *
     A            VQ11           5          COLHDG('空白')
     A            VQ12           1          COLHDG('特種稅額稅率')
     A            VQ13           1          COLHDG('彙加註記')
     A            VQ14           1          COLHDG('洋菸酒註記')
     A            VQ15           8          COLHDG('銷售人統編')
     A            VQ16          14          COLHDG('發票號碼')
      *                                     OR海關代徵營業稅證號
     A            VQ17           8  0       COLHDG('發票日期')
     A            VQ18           4  0       COLHDG('彙總張數')
     A            VQ19          12          COLHDG('單據號碼')
     A            VQ20           2          COLHDG('來源')
     A            VQ91           2          COLHDG('公司別')
     A            VQ92           1          COLHDG('辦事處')
     A            VQ97           8  0       COLHDG('異動日期')
     A            VQ98           6  0       COLHDG('異動時間')
     A            VQ99          10          COLHDG('異動者　')
     A*****************************************************************
     A*        媒體申報人工檔(SOVRPF)     KEY=VR91+VR92+VR01+VR04
     A*****************************************************************
     A            VR01      R               COLHDG('格式')
     A                                      REFFLD(VQ01)
     A            VR04      R               COLHDG('歸屬年月')
     A                                      REFFLD(VQ04)
     A            VR05      R               COLHDG('買受人統編')
     A                                      REFFLD(VQ05)
     A            VR07      R               COLHDG('銷售額／稅基')
     A                                      REFFLD(VQ07)
     A            VR08      R               COLHDG('課稅別')
     A                                      REFFLD(VQ08)
     A            VR09      R               COLHDG('營業稅')
     A                                      REFFLD(VQ09)
     A            VR10      R               COLHDG('扣抵代號')
     A                                      REFFLD(VQ10)
      *
      *                                     1 =進項可扣抵之進貨及費用
      *                                     2 =進項可扣抵之固定資產
      *                                    空白代表銷項憑證或不可扣抵
      *                                    進項憑證
      *
     A            VR11      R               COLHDG('空白')
     A                                      REFFLD(VQ11)
     A            VR12      R               COLHDG('特種稅額稅率')
     A                                      REFFLD(VQ12)
     A            VR13      R               COLHDG('彙加註記')
     A                                      REFFLD(VQ13)
     A            VR14      R               COLHDG('洋菸酒註記')
     A                                      REFFLD(VQ14)
     A            VR15      R               COLHDG('銷售人統編')
     A                                      REFFLD(VQ15)
     A            VR16      R               COLHDG('發票號碼')
     A                                      REFFLD(VQ16)
      *                                     OR海關代徵營業稅證號
     A            VR17      R               COLHDG('發票日期')
     A                                      REFFLD(VQ17)
     A            VR18      R               COLHDG('彙總張數')
     A                                      REFFLD(VQ18)
     A            VR91      R               COLHDG('公司別')
     A                                      REFFLD(VQ91)
     A            VR92      R               COLHDG('辦事處')
     A                                      REFFLD(VQ92)
     A            VR97      R               COLHDG('異動日期')
     A                                      REFFLD(VQ97)
     A            VR98      R               COLHDG('異動時間')
     A                                      REFFLD(VQ98)
     A            VR99      R               COLHDG('異動者　')
     A                                      REFFLD(VQ99)
     A*****************************************************************
     A*          產品庫存主檔(IMIAPF)     KEY=IA01+IA02+IA03
     A*****************************************************************
     A            IA01           1A         COLHDG('公司別')
     A            IA02      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IA03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IA04      R               COLHDG('產品種類')
     A                                      REFFLD(MA09)
     A            IA05      R               COLHDG('產品識別')
     A                                      REFFLD(MA08)
     A            IA06      R               COLHDG('庫存量')
     A                                      REFFLD(MA29)
     A            IA07      R               COLHDG('良品量')
     A                                      REFFLD(MA29)
     A            IA08      R               COLHDG('壞品量')
     A                                      REFFLD(MA29)
     A            IA09      R               COLHDG('保留量')
     A                                      REFFLD(MA29)
     A            IA10      R               COLHDG('可用量')
     A                                      REFFLD(MA29)
B2CHKA            IAXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IAYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          產品成本調整資料檔(IMIBPF) KEY=IB01+IB02+IB03+IBYY
     A*****************************************************************
     A            IB01      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IB02      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IB03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
B2CHKA            IB04      R    8 00       COLHDG('調整日期')
     A                                      REFFLD(#AXX)
     A**調整前
     A            IB05          11P 2       COLHDG('BEF-FOB-TOT')
     A            IB06          11P 2       COLHDG('BEF-FHI-TOT')
     A            IB07          11P 2       COLHDG('BEF-DUTY-TOT')
     A            IB08      R               COLHDG('物流點庫存量')
     A                                      REFFLD(MA29)
     A            IB09      R               COLHDG('單位成本')
     A                                      REFFLD(MA34)
     A**調整數
     A            IB10      R               COLHDG('ADJ-FOB-TOT')
     A                                      REFFLD(IB05)
     A            IB11      R               COLHDG('ADJ-FHI-TOT')
     A                                      REFFLD(IB06)
     A            IB12      R               COLHDG('ADJ-DUTY-TOT')
     A                                      REFFLD(IB07)
     A            IB13      R               COLHDG('調整庫存量')
     A                                      REFFLD(MA29)
     A**調整後
     A            IB14      R               COLHDG('單位成本')
     A                                      REFFLD(MA34)
     A**
     A            IB15          62O         COLHDG('備註')
     A**
     A            IB16          12          COLHDG('單據號碼')
     A**                                    保留(FOR IMIRLF)
     A            IB17           2          COLHDG('調整原因')
     A            IB18           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A**調整前
     A            IB19      R               COLHDG('BEF-FOB-UNIT')
     A                                      REFFLD(MA31)
     A            IB20      R               COLHDG('BEF-FHI-UNIT')
     A                                      REFFLD(MA32)
     A            IB21      R               COLHDG('BEF-DUTY-UNIT')
     A                                      REFFLD(MA32)
     A            IB22      R               COLHDG('保稅庫存量')
     A                                      REFFLD(MA29)
     A            IB23      R               COLHDG('完稅庫存量')
     A                                      REFFLD(MA30)
     A**調整後
     A            IB24      R               COLHDG('AFT-FOB-UNIT')
     A                                      REFFLD(MA31)
     A            IB25      R               COLHDG('AFT-FHI-UNIT')
     A                                      REFFLD(MA32)
     A            IB26      R               COLHDG('AFT-DUTY-UNIT')
     A                                      REFFLD(MA33)
B2CHKA            IBXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IBYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          良壞品轉換主檔(IMICPF) KEY=IC02
     A*****************************************************************
     A            IC01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IC02          12          COLHDG('單據號碼')
     A*                          XX   -  XX  -  X   -    XX    - XXXXX
     A*                        公司 -單別-型態-西元年份-序號
     A            IC03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IC04           1          COLHDG('型態')
     A**                                    1 -良－＞壞
     A**                                    2 -壞－＞良
B2CHKA            IC05      R    8 00       COLHDG('轉換日期')
     A                                      REFFLD(#AXX)
     A            IC06           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
B2CHKA            ICXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            ICYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            ICZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          良壞品轉換明細檔(IMIDPF) KEY=ID02+ID03
     A*****************************************************************
     A            ID01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            ID02      R               COLHDG('單據號碼')
     A                                      REFFLD(IC02)
     A            ID03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            ID04           5P 0       COLHDG('轉換數量')
B2CHKA            IDXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IDYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          產品報廢主檔(IMIEPF)     KEY=IE02
     A*****************************************************************
     A            IE01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IE02          12          COLHDG('單據號碼')
     A*                          XX   -  XX  -  X   -    XX    - XXXXX
     A*                        公司 -單別-型態-西元年份-序號
     A            IE03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IE04           1          COLHDG('型態')
     A**                                    0 -保稅倉
     A**                                    1 -完稅倉
B2CHKA            IE05      R    8 00       COLHDG('報廢日期')
     A                                      REFFLD(#AXX)
     A            IE06           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
B2CHKA            IEXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IEYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          產品報廢明細檔(IMIFPF) KEY=IF02+IF03
     A*****************************************************************
     A            IF01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IF02      R               COLHDG('單據號碼')
     A                                      REFFLD(IE02)
     A            IF03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IF04           5P 0       COLHDG('報廢數量')
     A            IF05      R               COLHDG('報廢總成本')
     A                                      REFFLD(MA26)
B2CHKA            IF06      R    8 00       COLHDG('報廢日期')
     A                                      REFFLD(#AXX)
     A            IF07      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IF08      R               COLHDG('FOB-TOT')
     A                                      REFFLD(MA26)
     A            IF09      R               COLHDG('FHI-TOT')
     A                                      REFFLD(MA27)
     A            IF10      R               COLHDG('DUTY-TOT')
     A                                      REFFLD(MA28)
B2CHKA            IFXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IFYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          存貨調整主檔(IMIGPF)     KEY=IG02
     A*****************************************************************
     A            IG01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IG02          12          COLHDG('單據號碼')
     A*                          XX   -  XX  -  X   -    XX    - XXXXX
     A*                        公司 -單別-型態-西元年份-序號
     A            IG03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IG04           1          COLHDG('型態')
     A**                                    1 -單一產品
     A**                                    2 -不同產品
B2CHKA            IG05      R    8 00       COLHDG('調整日期')
     A                                      REFFLD(#AXX)
     A            IG06           2          COLHDG('調整原因')
     A            IG07           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
B2CHKA            IGXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IGYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          存貨調整明細檔(IMIHPF) KEY=IH02+IH03+IH04
     A*****************************************************************
     A            IH01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IH02      R               COLHDG('單據號碼')
     A                                      REFFLD(IG02)
     A            IH03      R               COLHDG('調出產品代號')
     A                                      REFFLD(MA01)
     A            IH04      R               COLHDG('調入產品代號')
     A                                      REFFLD(MA01)
     A            IH05           5P 0       COLHDG('調整數量')
B2CHKA            IH06      R    8 00       COLHDG('調整日期')
     A                                      REFFLD(#AXX)
     A            IH07      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IH08      R               COLHDG('FOB-TOT')
     A                                      REFFLD(MA26)
     A            IH09      R               COLHDG('FHI-TOT')
     A                                      REFFLD(MA27)
     A            IH10      R               COLHDG('DUTY-TOT')
     A                                      REFFLD(MA28)
B2CHKA            IHXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IHYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IHZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          存貨調撥主檔(IMIIPF)     KEY=II02
     A*****************************************************************
     A            II01      R               COLHDG('公司別－出貨')
     A                                      REFFLD(#B01)
     A            II02          12          COLHDG('單據號碼')
     A*                        XX   -  XX  -   X    -    XX    - XXXXX
     A*                      公司 -單別-負責人-西元年份-序號
     A            II03      R               COLHDG('出貨物流點代號')
     A                                      REFFLD(#D03)
     A            II04      R               COLHDG('收貨物流點代號')
     A                                      REFFLD(#D03)
B2CHKA            II05      R    8 00       COLHDG('調撥日期')
     A                                      REFFLD(#AXX)
B2CHKA            II06      R    8 00       COLHDG('實際入庫日')
     A                                      REFFLD(#AXX)
     A            II07           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A            II08           1          COLHDG('轉帳註記')
     A*                                     'N' -已轉帳
     A*                                     'N' -無須轉帳(轉帳處理時更新)
     A            II09      R               COLHDG('公司別－收貨')
     A                                      REFFLD(#B01)
B2CHKA            IIXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IIYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IIZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          存貨調撥明細檔(IMIJPF) KEY=IJ02+IJ03
     A*****************************************************************
     A            IJ01      R               COLHDG('公司別－出貨')
     A                                      REFFLD(#B01)
     A            IJ02      R               COLHDG('單據號碼')
     A                                      REFFLD(II02)
     A            IJ03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IJ04           5P 0       COLHDG('調撥數量')
     A            IJ05           5P 0       COLHDG('確認數量')
B2CHKA            IJ06      R    8 00       COLHDG('調撥日期')
     A                                      REFFLD(#AXX)
     A            IJ07      R               COLHDG('出貨物流點代號')
     A                                      REFFLD(#D03)
     A            IJ08      R               COLHDG('收貨物流點代號')
     A                                      REFFLD(#D03)
     A            IJ09      R               COLHDG('FOB-TOT')
     A                                      REFFLD(MA26)
     A            IJ10      R               COLHDG('FHI-TOT')
     A                                      REFFLD(MA27)
     A            IJ11      R               COLHDG('DUTY-TOT')
     A                                      REFFLD(MA28)
     A            IJ12      R               COLHDG('公司別－收貨')
     A                                      REFFLD(#B01)
B2CHKA            IJXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IJYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IJZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          派車主檔(IMIKPF)         KEY=IK01-IK05
     A*****************************************************************
     A            IK01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IK02      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
B2CHKA            IK03      R    8 00       COLHDG('分車日期')
     A                                      REFFLD(#AXX)
     A            IK04      R               COLHDG('派車車號')
     A                                      REFFLD(SE22)
     A            IK05      R               COLHDG('車次')
     A                                      REFFLD(SE23)
     A            IK06           3P 0       COLHDG('送貨單張數')
     A            IK07           3P 0       COLHDG('發票張數')
B2CHKA            IKXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IKYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IKZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          禮盒組拆明細檔(IMILPF)   KEY=IL02+IL03
     A*****************************************************************
     A            IL01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IL02          12          COLHDG('單據號碼')
     A*                          XX   -  XX  -  X   -    XX    - XXXXX
     A*                        公司 -單別-型態-西元年份-序號
     A            IL03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
B2CHKA            IL04      R    8 00       COLHDG('組拆日期')
     A                                      REFFLD(#AXX)
     A            IL05      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IL06           6S 0       COLHDG('數量')
     A            IL07           1P 0       COLHDG('進／出')
     A*                                     +1 -進
     A*                                     -1 -出
     A            IL08      R               COLHDG('TOT  COST-FOB')
     A                                      REFFLD(MA26)
     A            IL09      R               COLHDG('TOT  COST-FHI')
     A                                      REFFLD(MA27)
     A            IL10      R               COLHDG('TOT  COST-DUTY')
     A                                      REFFLD(MA28)
B2CHKA            ILXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            ILYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            ILZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          禮盒組拆主檔(IMIMPF)     KEY=IM02
     A*****************************************************************
     A            IM01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            IM02      R               COLHDG('單據號碼')
     A                                      REFFLD(IL02)
     A            IM03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IM04           1          COLHDG('型態')
     A**                                    0 -組裝
     A**                                    1 -拆裝
     A            IM05      R               COLHDG('禮盒代號')
     A                                      REFFLD(MA01)
     A            IM06           5P 0       COLHDG('數量')
     A            IM07           1          COLHDG('待確認註記')
     A*                                     ' '-已確認
     A*                                     '*'-待確認
B2CHKA            IM08      R    8 00       COLHDG('確認日期')
     A                                      REFFLD(#AXX)
     A            IM09           1          COLHDG('結帳註記')
     A**                                    'V'-已結帳
B2CHKA            IM10      R    8 00       COLHDG('組拆日期')
     A                                      REFFLD(#AXX)
B2CHKA            IMXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IMYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IMZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          存貨月結檔(IMINPF)       KEY=IN01+IN02+IN03+IN04
     A*****************************************************************
     A            IN01           1A         COLHDG('公司別')
B2MODA            IN02           6S00       COLHDG('年月')
     A            IN03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IN04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IN05           6S 0       COLHDG('期初存貨')
     A            IN06           6S 0       COLHDG('進貨')
     A            IN07           6S 0       COLHDG('銷貨')
     A            IN08           5P 0       COLHDG('贈品')
     A            IN09           5P 0       COLHDG('試飲')
     A            IN10           5P 0       COLHDG('銷退')
     A            IN101          5P 0       COLHDG('銷退搭贈')
     A            IN11           5P 0       COLHDG('專櫃')
     A            IN12           6S 0       COLHDG('寄賣放')
     A            IN13           5P 0       COLHDG('調撥')
     A            IN14           5P 0       COLHDG('調整')
     A            IN15           5P 0       COLHDG('報廢')
     A            IN16           5P 0       COLHDG('禮盒組拆')
     A            IN17           6S 0       COLHDG('期末存貨')
     A            IN18           5P 0       COLHDG('收回')
     A            IN19           6S 0       COLHDG('完稅')
     A            IN20           6S 0       COLHDG('經商補貨')
     A*
     A            IN23          11P 2       COLHDG('期初存貨FOB')
     A            IN24          11P 2       COLHDG('期初存貨FHI')
     A            IN25          11P 2       COLHDG('期初存貨DUTY')
     A*
     A            IN231         11P 2       COLHDG('期初試飲存貨FOB')
     A            IN241         11P 2       COLHDG('期初試飲存貨FHI')
     A            IN251         11P 2       COLHDG('期初試飲存貨DUTY')
     A*含試飲成本之加減
     A            IN26          11P 2       COLHDG('期末存貨FOB')
     A            IN27          11P 2       COLHDG('期末存貨FHI')
     A            IN28          11P 2       COLHDG('期末存貨DUTY')
     A*試飲收回＝�洁珂�            試飲銷售為�洁倞�
     A            IN261         11P 2       COLHDG('期末試飲存貨FOB')
     A            IN271         11P 2       COLHDG('期末試飲存貨FHI')
     A            IN281         11P 2       COLHDG('期末試飲存貨DUTY')
     A*含試飲成本之銷貨成本存＋值
     A            IN29          11P 2       COLHDG('累計銷貨FOB')
     A            IN30          11P 2       COLHDG('累計銷貨FHI')
     A            IN31          11P 2       COLHDG('累計銷貨DUTY')
     A*存＋值
     A            IN291         11P 2       COLHDG('累計試飲FOB')
     A            IN301         11P 2       COLHDG('累計試飲FHI')
     A            IN311         11P 2       COLHDG('累計試飲DUTY')
     A*含試飲成本之銷退成本存＋值
     A            IN32          11P 2       COLHDG('累計銷退FOB')
     A            IN33          11P 2       COLHDG('累計銷退FHI')
     A            IN34          11P 2       COLHDG('累計銷退DUTY')
     A*存＋值
     A            IN321         11P 2       COLHDG('累計試飲收回FOB')
     A            IN331         11P 2       COLHDG('累計試飲收回FHI')
     A            IN341         11P 2       COLHDG('累計試飲收回DUTY')
     A*
     A            IN35           5P 0       COLHDG('進貨退回')
     A            IN36           5P 0       COLHDG('退回')
     A*                                     收回後退回產品歸屬公司
     A            IN37           5P 0       COLHDG('經欠訂購')
     A*                                     FORＤ７
     A            IN38           5P 0       COLHDG('經欠搭贈')
     A*                                     FORＤ７
     A            IN39           5P 0       COLHDG('經欠合計')
     A*                                     FORＤ８
     A            IN40           5P 0       COLHDG('試飲退回')
     A            IN41           5P 0       COLHDG('盤點差異')
B2CHKA            INXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            INYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            INZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          盤點單檔(IMIOPF)       KEY=IO01+IO02+IO03+IO04
     A*****************************************************************
     A            IO01      R               COLHDG('公司別')
     A                                      REFFLD(IA01)
     A            IO02      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IO03           9          COLHDG('盤點單號')
     A            IO04      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IO05           6S 0       COLHDG('總數量')
     A            IO06           6S 0       COLHDG('良品數量')
     A            IO07           6S 0       COLHDG('壞品數量')
B2CHKA            IO08      R    8 00       COLHDG('盤點日期')
     A                                      REFFLD(#AXX)
     A            IO09           1          COLHDG('作廢註記')
     A*                                     'V'-已作廢
     A            IO10           1          COLHDG('來源')
     A            IO11           1          COLHDG('狀態碼')
B2CHKA            IOXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IOYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IOZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          盤點庫存備份檔(IMITPF)       KEY=IT01+IT02+IT03
     A*****************************************************************
     A            IT01      R               COLHDG('公司別')
     A                                      REFFLD(IA01)
     A            IT02      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IT03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IT04      R               COLHDG('產品種類')
     A                                      REFFLD(MA09)
     A            IT05      R               COLHDG('產品識別')
     A                                      REFFLD(MA08)
     A            IT06      R               COLHDG('庫存量')
     A                                      REFFLD(MA29)
     A            IT07      R               COLHDG('良品量')
     A                                      REFFLD(MA29)
     A            IT08      R               COLHDG('壞品量')
     A                                      REFFLD(MA29)
     A            IT09      R               COLHDG('保留量')
     A                                      REFFLD(MA29)
     A            IT10      R               COLHDG('可用量')
     A                                      REFFLD(MA29)
     A*           IT11      R               COLHDG('FOB-UNIT')
     A*                                     REFFLD(MA31)
     A*           IT12      R               COLHDG('FHI-UNIT')
     A*                                     REFFLD(MA31)
     A*           IT13      R               COLHDG('DUTY-UNIT')
     A*                                     REFFLD(MA31)
     A*           IT14      R               COLHDG('單位成本')
     A*                                     REFFLD(MA31)
B2CHKA            ITXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            ITYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            ITZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          盤盈虧檔(IMIUPF)         KEY=IU02
     A*****************************************************************
     A            IU01      R               COLHDG('公司別')
     A                                      REFFLD(IA01)
     A            IU02          12          COLHDG('單據號碼')
     A***                            XX     -XX-  XX  - XXXXXX
     A***                           公司別-A4-年份-序號
     A            IU03      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
B2CHKA            IU04      R    8 00       COLHDG('盤點日期')
     A                                      REFFLD(#AXX)
     A            IU05      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IU06           6S 0       COLHDG('良品數量異動')
     A            IU07           6S 0       COLHDG('壞品數量異動')
     A            IU08      R               COLHDG('FOB-TOT')
     A                                      REFFLD(MA26)
     A            IU09      R               COLHDG('FHI-TOT')
     A                                      REFFLD(MA27)
     A            IU10      R               COLHDG('DUTY-TOT')
     A                                      REFFLD(MA28)
B2CHKA            IUXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IUYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IUZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          盤點產品備份檔(IMIVPF)       KEY=IV01
     A*****************************************************************
     A            IV01      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IV02      R               COLHDG('FOB-UNIT')
     A                                      REFFLD(MA31)
     A            IV03      R               COLHDG('FHI-UNIT')
     A                                      REFFLD(MA31)
     A            IV04      R               COLHDG('DUTY-UNIT')
     A                                      REFFLD(MA31)
     A            IV05      R               COLHDG('單位成本')
     A                                      REFFLD(MA31)
     A            IV06      R               COLHDG('保稅庫存量')
     A                                      REFFLD(MA29)
     A            IV07      R               COLHDG('完稅庫存量')
     A                                      REFFLD(MA29)
     A            IV08      R               COLHDG('FOB-TOTAL')
     A                                      REFFLD(MA26)
     A            IV09      R               COLHDG('FHI-TOTAL')
     A                                      REFFLD(MA26)
     A            IV10      R               COLHDG('DUTY-TOTAL')
     A                                      REFFLD(MA26)
B2CHKA            IVXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IVYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IVZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          單位成本調整記錄檔(IMIWPF)   KEY=IW01+IW02+IW03
     A*****************************************************************
     A            IW01      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
B2CHKA            IW02      R    8 00       COLHDG('調整日期')
     A                                      REFFLD(#AXX)
     A            IW03      R               COLHDG('調整時間')
     A                                      REFFLD(#AYY)
     A            IW04      R               COLHDG('原F.O.B.-UNIT')
     A                                      REFFLD(MA31)
     A            IW05      R               COLHDG('原FHI   -UNIT')
     A                                      REFFLD(MA32)
     A            IW06      R               COLHDG('原DUTY  -UNIT')
     A                                      REFFLD(MA33)
     A            IW07      R               COLHDG('F.O.B.-UNIT')
     A                                      REFFLD(MA31)
     A            IW08      R               COLHDG('FHI   -UNIT')
     A                                      REFFLD(MA32)
     A            IW09      R               COLHDG('DUTY  -UNIT')
     A                                      REFFLD(MA33)
B2CHKA            IWXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IWYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IWZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          年終成本檔(IMIXPF)       KEY=IX11+IX01
     A*****************************************************************
     A            IX01      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IX02      R               COLHDG('FOB-UNIT')
     A                                      REFFLD(MA31)
     A            IX03      R               COLHDG('FHI-UNIT')
     A                                      REFFLD(MA31)
     A            IX04      R               COLHDG('DUTY-UNIT')
     A                                      REFFLD(MA31)
     A            IX05      R               COLHDG('單位成本')
     A                                      REFFLD(MA31)
     A            IX06      R               COLHDG('保稅庫存量')
     A                                      REFFLD(MA29)
     A            IX07      R               COLHDG('完稅庫存量')
     A                                      REFFLD(MA29)
     A            IX08      R               COLHDG('FOB-TOTAL')
     A                                      REFFLD(MA26)
     A            IX09      R               COLHDG('FHI-TOTAL')
     A                                      REFFLD(MA26)
     A            IX10      R               COLHDG('DUTY-TOTAL')
     A                                      REFFLD(MA26)
B2MODA            IX11           6S00       COLHDG('年終年月')
B2CHKA            IXXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IXYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IXZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          年終庫存檔(IMIYPF)       KEY=IY15+IY01+IY02+IY03
     A*****************************************************************
     A            IY01      R               COLHDG('公司別')
     A                                      REFFLD(IA01)
     A            IY02      R               COLHDG('物流點代號')
     A                                      REFFLD(#D03)
     A            IY03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            IY04      R               COLHDG('產品種類')
     A                                      REFFLD(MA09)
     A            IY05      R               COLHDG('產品識別')
     A                                      REFFLD(MA08)
     A            IY06      R               COLHDG('庫存量')
     A                                      REFFLD(MA29)
     A            IY07      R               COLHDG('良品量')
     A                                      REFFLD(MA29)
     A            IY08      R               COLHDG('壞品量')
     A                                      REFFLD(MA29)
     A            IY09      R               COLHDG('保留量')
     A                                      REFFLD(MA29)
     A            IY10      R               COLHDG('可用量')
     A                                      REFFLD(MA29)
     A*           IY11      R               COLHDG('FOB-UNIY')
     A*                                     REFFLD(MA31)
     A*           IY12      R               COLHDG('FHI-UNIY')
     A*                                     REFFLD(MA31)
     A*           IY13      R               COLHDG('DUTY-UNIY')
     A*                                     REFFLD(MA31)
     A*           IY14      R               COLHDG('單位成本')
     A*                                     REFFLD(MA31)
B2MODA            IY15           6S00       COLHDG('年終年月')
B2CHKA            IYXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            IYYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            IYZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          發票號碼設定資料檔(ARAAPF)KEY=AA01+AA02+AA03
     A*****************************************************************
     A            AA01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
B2MODA            AA02           6S00       COLHDG('發票年月')
     A            AA03           2S 0       COLHDG('組別')
     A            AA04           2A         COLHDG('字軌')
     A            AA05           8S 0       COLHDG('起始號碼')
     A            AA06           8S 0       COLHDG('終止號碼')
     A            AA07           8S 0       COLHDG('使用號碼')
     A            AA08           1          COLHDG('申報註記')
     A*                                     'V'-已申報
B2CHKA            AA09      R    8 00       COLHDG('開立日期')
     A                                      REFFLD(#AXX)
B2CHKA            AAXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            AAYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            AAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銀行帳號資料檔(ARABPF)   KEY=AB01+AB02
     A*****************************************************************
     A            AB01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            AB02          14A         COLHDG('銀行帳號')
     A            AB03          22O         COLHDG('說明')
     A            AB04           2A         COLHDG('種類')
     A            AB05           9P 0       COLHDG('餘額')
     A            AB06           3          COLHDG('幣別')
B2CHKA            ABXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            ABYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            ABZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          收款主檔(ARACPF)         KEY=AC01-AC06
     A*****************************************************************
     A            AC01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            AC02      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
     A            AC03      R               COLHDG('分店代號')
     A                                      REFFLD(#B15)
B2CHKA            AC04      R    8 00       COLHDG('收款日期')
     A                                      REFFLD(#AXX)
     A            AC05           2A         COLHDG('收款種類')
     A            AC06          14          COLHDG('票據號碼')
B2CHKA            AC07      R    8 00       COLHDG('預計兌現日期')
     A                                      REFFLD(#AXX)
     A            AC08           9P 0       COLHDG('收款金額')
     A            AC09      R               COLHDG('業務員')
     A                                      REFFLD(MC01)
     A            AC10           9P 0       COLHDG('溢付金額')
B2CHKA            AC11      R    8 00       COLHDG('實際兌現日')
     A                                      REFFLD(#AXX)
     A            AC12      R               COLHDG('入帳帳號')
     A                                      REFFLD(AB02)
     A            AC13           1A         COLHDG('過帳註記')
     A*                                     暫保留
     A            AC14           2A         COLHDG('來源')
     A*                                     'CK'=票據
     A*                                     'RE'=進銷存－應收
B2CHKA            ACXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            ACYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            ACZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          收款明細檔(ARADPF)       KEY=AD01-AD07
     A*****************************************************************
     A            AD01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            AD02      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
     A            AD03      R               COLHDG('分店代號')
     A                                      REFFLD(#B15)
B2CHKA            AD04      R    8 00       COLHDG('收款日期')
     A                                      REFFLD(#AXX)
     A            AD05      R               COLHDG('收款種類')
     A                                      REFFLD(AC05)
     A            AD06      R               COLHDG('票據號碼')
     A                                      REFFLD(AC06)
     A            AD07      R               COLHDG('發票號碼')
     A                                      REFFLD(SI02)
     A            AD08           9P 0       COLHDG('沖銷金額')
     A            AD09           1A         COLHDG('過帳註記')
     A*                                     暫保留
     A            AD10      R               COLHDG('發票公司別')
     A                                      REFFLD(#B01)
     A**                                    發票號碼所屬之公司別
     A**                                    即(SI01)
     A**                                    （因可沖不同公司之發
     A**                                      票，即收款公司可不
     A**                                      等於銷售公司）
B2CHKA            AD11      R    8 00       COLHDG('發票日期')
     A                                      REFFLD(#AXX)
B2CHKA            AD12      R    8 00       COLHDG('分配日期')
     A                                      REFFLD(#AXX)
B2CHKA            ADXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            ADYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            ADZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          票據兌現主檔(ARAEPF)     KEY=AE01-AE03
     A*****************************************************************
     A            AE01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
B2CHKA            AE02      R    8 00       COLHDG('銀行入帳日期')
     A                                      REFFLD(#AXX)
     A            AE03      R               COLHDG('帳戶號碼')
     A                                      REFFLD(AB02)
     A            AE04           9P 0       COLHDG('兌現金額')
B2CHKA            AEXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            AEYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            AEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          價差折讓資料檔(ARAFPF)   KEY=AF02
     A*****************************************************************
     A            AF01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            AF02          12          COLHDG('折讓單號')
     A            AF03      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
     A            AF04      R               COLHDG('分店代號')
     A                                      REFFLD(#B15)
B2CHKA            AF05      R    8 00       COLHDG('折讓日期')
     A                                      REFFLD(#AXX)
     A            AF06      R               COLHDG('發票號碼')
     A                                      REFFLD(SI02)
     A            AF07           9P 0       COLHDG('折讓金額')
     A            AF08           2          COLHDG('折讓原因')
     A*
B2CHKA            AFXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            AFYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            AFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          銷貨折讓明細檔(ARAGPF)       KEY=AG02-AG04
     A*****************************************************************
     A            AG01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            AG02      R               COLHDG('折讓單號')
     A                                      REFFLD(AF02)
     A            AG03      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A            AG04      R               COLHDG('發票號碼')
     A                                      REFFLD(SI02)
     A            AG05           5P 0       COLHDG('分配總數量')
     A            AG06           9P 2       COLHDG('銷退單價')
     A            AG07           9P 0       COLHDG('銷退金額')
     A            AG08          11P 2       COLHDG('銷退成本－總成本')
     A*                                      AG05*單位成本
     A            AG09      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
     A            AG10      R               COLHDG('分店代號')
     A                                      REFFLD(#B15)
B2CHKA            AG11      R    8 00       COLHDG('折讓日期')
     A                                      REFFLD(#AXX)
     A            AG12      R               COLHDG('分配數量－訂購')
     A                                      REFFLD(AG05)
     A            AG13      R               COLHDG('分配數量－搭贈')
     A                                      REFFLD(SD05)
     A            AG14          11P 2       COLHDG('銷退成本－FOB')
     A            AG15          11P 2       COLHDG('銷退成本－FHI')
     A            AG16          11P 2       COLHDG('銷退成本－DUTY')
     A            AG17          11P 2       COLHDG('轉帳銷退成本－FOB')
     A            AG18          11P 2       COLHDG('轉帳銷退成本－FHI')
     A            AG19          11P 2       COLHDG('轉帳銷退成本－DUTY')
     A            AG20          11P 2       COLHDG('轉帳銷退總成本')
     A*911125
     A            AG071         11P 2       COLHDG('銷退金額')
B2CHKA            AGXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            AGYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            AGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          統一發票申報主檔(ARAIPF)     KEY=AI01-AI02
     A*****************************************************************
     A            AI01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
B2MODA            AI02           6S00       COLHDG('申報年月')
     A            AI03           3P 0       COLHDG('使用分數－應稅')
     A            AI04           3P 0       COLHDG('使用分數－零稅')
     A            AI05           4P 0       COLHDG('使用分數－免稅')
     A            AI06           3P 0       COLHDG('使用分數－作廢')
     A            AI07           9P 0       COLHDG('銷售額－應稅營業人')
     A            AI08           9P 0       COLHDG('稅額　－應稅營業人')
     A            AI09           9P 0       COLHDG('總金額－應稅非營業')
     A            AI10           9P 0       COLHDG('銷售額－零稅')
     A            AI11           9P 0       COLHDG('銷售額－免稅')
     A            AI12           5P 0       COLHDG('明細表張數')
B2CHKA            AIXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            AIYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            AIZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          統一發票申報明細檔(ARAJPF)   KEY=AJ01-AJ02+AJ03
     A*****************************************************************
     A            AJ01      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
B2MODA            AJ02           6S00       COLHDG('申報年月')
     A            AJ03           8          COLHDG('發票號碼前八碼')
     A            AJ04           3P 0       COLHDG('使用分數－應稅')
     A            AJ05           3P 0       COLHDG('使用分數－零稅')
     A            AJ06           4P 0       COLHDG('使用分數－免稅')
     A            AJ07           3P 0       COLHDG('使用分數－作廢')
     A            AJ08           9P 0       COLHDG('銷售額－應稅營業人')
     A            AJ09           9P 0       COLHDG('稅額　－應稅營業人')
     A            AJ10           9P 0       COLHDG('總金額－應稅非營業')
     A            AJ11           9P 0       COLHDG('銷售額－零稅')
     A            AJ12           9P 0       COLHDG('銷售額－免稅')
     A            AJ13           2S 0       COLHDG('區別碼')
     A*                                     00 -發票號碼後二碼
     A*                                         = 00 - 49
     A*                                     50 -發票號碼後二碼
     A*                                         = 50 - 99
B2CHKA            AJXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            AJYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            AJZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*          應收帳款月檔      (ARAKPF)   KEY=AK01-AK02+AK03
     A*****************************************************************
B2MODA            AK01           6 00       COLHDG('確認年月')
     A            AK02           1A         COLHDG('公司別第一碼')
     A*                                     'W' 'C' 'R'
     A            AK03      R               COLHDG('公司別')
     A                                      REFFLD(#B01)
     A            AK04      R               COLHDG('客戶代號')
     A                                      REFFLD(#B14)
     A            AK05           9  0       COLHDG('上期餘額')
     A            AK06           9  0       COLHDG('本月發票總額')
     A*                                     依確認日期
     A            AK07           9  0       COLHDG('本月沖帳總額')
     A            AK08           9  0       COLHDG('本月銷退總額')
     A*                                     依折讓日期
     A*                                     含跨月註記
     A            AK09           9  0       COLHDG('本月價差總額')
     A*                                     依折讓日期
     A            AK10           9  0       COLHDG('本月結餘')
     A*  AK10=AK05+AK06-AK07-AK08-AK09
B2CHKA            AKXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(#AXX)
     A            AKYY      R               COLHDG('異動時間')
     A                                      REFFLD(#AYY)
     A            AKZZ      R               COLHDG('異動者　')
     A                                      REFFLD(#AZZ)
     A*****************************************************************
     A*           DELETE LOG FILE  KEY=LDXX+LDYY
     A*****************************************************************
     A            LD01      R               COLHDG('退貨單號')
     A                                      REFFLD(SD02)
     A            LD02      R               COLHDG('產品代號')
     A                                      REFFLD(SD03)
B2CHKA            LDXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(SDXX)
     A            LDYY      R               COLHDG('異動時間')
     A                                      REFFLD(SDYY)
     A            LDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(SDZZ)
