     A                                      REF(RERF)
     A          R WF400
     A            WF4000    R               COLHDG('CUST ID ')
     A                                      REFFLD(ME01)
     A            WF4001    R               COLHDG('STATUS')
     A                                      REFFLD(ME20)
     A          K WF4000
