     A*****************************************************************
     A*          快ㄆ矪穎秘〓刚都稪羆(REWF58)     KEY=WF5801+WF5802
     A*****************************************************************
     A                                      REF(RERF)
     A          R WF580
     A            WF5801         1A         COLHDG('快ㄆ矪')
     A            WF5802    R               COLHDG('硄隔')
     A                                      REFFLD(SC33)
     A            WF5803         6  0       COLHDG('璹潦计')
     A            WF5804         6  0       COLHDG('穎秘计')
     A            WF5805         6  0       COLHDG('穎秘刚都计')
     A            WF5811         6  0       COLHDG('獶穎秘刚都计')
     A            WF5812        10  0       COLHDG('獶穎秘刚都肂')
     A            WF5806        10  0       COLHDG('肂')
     A*
     A            WF5807         6  0       COLHDG('綪癶璹潦计')
     A            WF5808         6  0       COLHDG('綪癶穎秘计')
     A            WF5809         6  0       COLHDG('刚都Μ计')
     A            WF5810        10  0       COLHDG('綪癶肂')
     A*
     A          K WF5801
     A          K WF5802
