     A*****************************************************************
     A*      專櫃訂單轉驗收工作檔FOR SOA028 USED
     A*****************************************************************
     A          R WFD1                      PFILE(REWFD1)
     A          K SE02
