     A*****************************************************************
     A*      產品銷售分佈彙總表  *NOMAX
     A*****************************************************************
     A          R WF0                       PFILE(REWF1)
     A          K WF01
     A          K WF02
     A          K WF021
