     A*****************************************************************
     A*
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R RE31
     A            WF3101    R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
     A          K WF3101
