     A*****************************************************************
     A*          祇布紀逼︽篯(REWF60)   KEY=WF6001+WF6002+WF6003
     A*****************************************************************
     A                                      REF(RERF)
     A          R WF600
     A            WF6001         5  0       COLHDG('紀羆计')
     A            WF6002    R               COLHDG('穨叭')
     A                                      REFFLD(SI31)
     A            WF6003    R               COLHDG('め腹')
     A                                      REFFLD(SI08)
     A            WF6004         4  0       COLHDG('紀祇布计秖')
     A            WF6005         4  0       COLHDG('祇布计秖')
     A          K WF6001                    DESCEND
     A          K WF6004
     A          K WF6005
