     A*****************************************************************
     A*          玻珇快ㄆ矪稪羆(REWF61)     KEY=WF6101+WF6102
     A*****************************************************************
     A                                      REF(RERF)
     A          R WF610
     A            WF6101         1A         COLHDG('快ㄆ矪')
     A            WF6102    R               COLHDG('硄隔')
     A                                      REFFLD(SC33)
     A            WF6111    R               COLHDG('玻珇腹')
     A                                      REFFLD(SD03)
     A            WF6103         6  0       COLHDG('璹潦计')
     A            WF6104         6  0       COLHDG('穎秘计')
     A            WF6105         6  0       COLHDG('刚都计')
     A            WF6106        10  0       COLHDG('肂')
     A*
     A            WF6107         6  0       COLHDG('綪癶璹潦计')
     A            WF6108         6  0       COLHDG('綪癶穎秘计')
     A            WF6109         6  0       COLHDG('刚都Μ计')
     A            WF6110        10  0       COLHDG('綪癶肂')
     A*
     A          K WF6111
     A          K WF6101
     A          K WF6102
