     A*****************************************************************
     A*          客戶毛利金額排行榜(REWF26)     KEY=
     A*****************************************************************
     A          R WF400                     PFILE(REWF40)
     A          K WF4009                    DESCEND
     A          K WF4010                    DESCEND
     A          K WF4001
