     A*****************************************************************
     A*        專櫃訂單轉驗收工作檔FOR SOA028 USED
     A*****************************************************************
     A                                      REF(RERF)
     A          R WFD1
     A            PH02      R               COLHDG('驗收單號')
     A            SE02      R               COLHDG('送貨單號')
     A            PHXX      R               COLHDG('異動日期')
     A          K PH02
