     A*****************************************************************
     A*          客戶毛利金額排行榜(REWF24)     KEY=
     A*****************************************************************
     A          R WF240                     PFILE(REWF24)
     A          K WF2401
     A          K WF2404                    DESCEND
