     A*****************************************************************
     A*          玻珇め綪扳计秖逼︽篯(REWF40)     KEY=
     A*****************************************************************
     A                                      REF(RERF)
     A          R WF400
     A            WF4001    R               COLHDG('め腹')
     A                                      REFFLD(SC04)
     A            WF4002         7P 0       COLHDG('璹潦计秖')
     A            WF4003         9P 0       COLHDG('綪扳肂')
     A            WF4004        11P 2       COLHDG('璹潦计秖そど计')
     A            WF4005         7P 0       COLHDG('癶璹计秖')
     A            WF4006         9P 0       COLHDG('綪癶肂')
     A            WF4007        11P 2       COLHDG('癶璹计秖そど计')
     A            WF4008         7P 0       COLHDG('綪癶计秖')
     A            WF4009         9P 0       COLHDG('綪癶肂')
     A            WF4010        11P 2       COLHDG('綪癶计秖そど计')
     A*
     A          K WF4001
