     A*****************************************************************
     A*          珇礟綪扳だ稪羆(REWF2)     KEY=
     A*****************************************************************
     A                                      REF(RERF)
     A          R WF2
     A            WF201          2A         COLHDG('珇礟')
     A            WF202          5A         COLHDG('め')
     A            WF203          4A         COLHDG('めだ┍')
     A*綪扳
     A            WF204          6S 0       COLHDG('璹潦计')
     A            WF205          6S 0       COLHDG('穎秘计')
     A            WF206          6S 0       COLHDG('刚都计')
     A            WF207         10S 0       COLHDG('肂')
     A*綪癶
     A            WF208          6S 0       COLHDG('綪癶璹潦计')
     A            WF209          6S 0       COLHDG('綪癶穎秘计')
     A            WF210          6S 0       COLHDG('刚都Μ计')
     A            WF211         10S 0       COLHDG('綪癶肂')
     A*夹非絚计
     A            WF212          6S 0       COLHDG('夹非璹潦计')
     A            WF213          6S 0       COLHDG('夹非穎秘计')
     A            WF214          6S 0       COLHDG('夹非刚都计')
     A*
     A            WF215         10S 4       COLHDG('璹潦羆甧縩')
     A            WF216         10S 4       COLHDG('穎秘羆甧縩')
     A            WF217         10S 4       COLHDG('刚都羆甧縩')
     A            WF218         20A         COLHDG('称爹')
     A*
     A          K WF201
     A          K WF202
     A          K WF203
