     A*****************************************************************
     A*          專櫃產品銷售排行榜(REWF25)     KEY=
     A*****************************************************************
     A          R WF250                     PFILE(REWF25)
     A          K WF2501
     A          K WF2504                    DESCEND
