     A*****************************************************************
     A*          客戶毛利金額排行榜(REWF26)     KEY=
     A*****************************************************************
     A          R WF260                     PFILE(REWF26)
     A          K WF2601
     A          K WF2605                    DESCEND
     A          K WF2602
