     A*****************************************************************
     A*          試飲訂單明細分析(REWF862)    KEY=
     A*****************************************************************
     A          R SC0                       PFILE(REWF862)
     A          K SC16
     A          K SC17
     A          K SD03
     A          K SC02
