     A*****************************************************************
     A*           RMWK03
     A*****************************************************************
     A          R WB0                       PFILE(RMWK03)
      **
     A          K WB01
     A          K WB02
     A          K WB09
     A          K WB04
