     A*****************************************************************
     A*  SCWWPF 上傳下載路徑檔案
     A*****************************************************************
     A                                      UNIQUE
     A          R WW0
     A            WW01           2A         COLHDG('路徑代碼')
     A            WW02          64O         COLHDG('路徑內容')
     A            WW03          64O         COLHDG('備註')
      *
     A          K WW01
