     A*****************************************************************
     A*          ¾P°â¾P°h¤ëÀÉ(SOCDPF)     KEY=CD01-CD15
     A*****************************************************************
     A          R CD0                       PFILE(SOCDPF)
     A          K CD04
