     A*****************************************************************
     A*          試飲訂單明細延伸檔(SODXLF01)    KEY=SD02
     A*****************************************************************
     A          R SD0                       PFILE(SOSDPFX)
     A          K SD02
     A**             ('訂單號碼')
