     A*****************************************************************
     A*          試飲收回明細延伸檔(SOOXLF01)    KEY=SO02
     A*****************************************************************
     A          R SO0                       PFILE(SOSOPFX)
     A          K SO02
     A**             ('單據號碼')
