     A          R F940
     A*
     A            F9401          9A         COLHDG('產品代號')
     A            F9402         60A         COLHDG('英文全稱')
     A            F9403          9S 0       COLHDG('當月出貨標準箱數')
     A            F9404          9S 0       COLHDG('去年同期出貨箱數')
     A            F9405          9S 0       COLHDG('累積出貨標準箱數')
     A            F9406          9S 0       COLHDG('去年同期累積箱數')
     A            F9407          9S 0       COLHDG('當月期末庫存箱數')
     A*
     A          K F9401
