     A          R PF0
     A            PF01           6A         COLHDG('業務代號')
     A            PF02          12O         COLHDG('業務員')
     A            PF03           5A         COLHDG('客戶代號')
     A            PF04          18O         COLHDG('客戶簡稱')
     A            PF05           9P 0       COLHDG('客戶合計金額')
     A*
