     A*****************************************************************
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R S00
     A            S001           2A         COLHDG('公司')
     A            S002           6S 0       COLHDG('處理年月')
     A*
     A          K S001
