     A*****************************************************************
     A*      促銷活動代碼檔(SOS3PF)
     A*****************************************************************
     A                                      UNIQUE
     A          R S30
     A            S301          12          COLHDG('促銷活動代碼')
     A          K S301
