     A*****************************************************************
     A*      間接客戶代碼檔(SOS4PF)
     A*****************************************************************
     A                                      UNIQUE
     A          R S40
     A            S401           6          COLHDG('間接客戶代碼')
     A            S402          18O         COLHDG('間接客戶名稱')
     A          K S401
