     A*****************************************************************
     A*        間接客戶資料檔           KEY=S402
     A*****************************************************************
     A          R S40                       PFILE(SOS4PF)
     A          K S402
     A**             ('客戶簡稱')
