     A*****************************************************************
     A*          通路型態產品報價資料檔(SOSALF) KEY=SA01-SA05
     A*****************************************************************
     A          R SA0                       PFILE(SOSAPF)
     A*
     A          K SA02
     A          K SA03
     A          K SA05                      DESCEND
