     A*****************************************************************
     A*          通路型態產品報價資料檔(SOSALF) KEY=SA01-SA05
     A*****************************************************************
     A                                      REFACCPTH(SOSAPF)
     A          R SA0                       PFILE(SOSAPF)
