     A*****************************************************************
     A*          客戶產品報價資料檔(SOSBLF) KEY=SB01-SB04
     A*****************************************************************
     A                                      REFACCPTH(SOSBPF)
     A          R SB0                       PFILE(SOSBPF)
