     A*****************************************************************
     A*          客戶產品報價(SOSBLF1)     KEY=SB02+SB01
     A*****************************************************************
     A          R SB0                       PFILE(SOSBPF)
     A          K SB02
     A          K SB01
