     A*****************************************************************
     A*          ≠q≥Ê•D¿…(SOSEPF)      KEY=SE02
     A*****************************************************************
     A                                      REFACCPTH(SOSCPF)
     A          R SC0                       PFILE(SOSCPF)
