     A*****************************************************************
     A*          試飲訂單主檔(SOSCLF05)    KEY=SC02
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A          K SC02
     A**             ('訂單號碼')
     A          S SC03                      COMP(EQ 'S4')
     A**             ('單別')
