     A*****************************************************************
     A*          銷售訂單主檔(SOSCLF07)    KEY=SC30+S
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A          K SC30
     A**             ('發票號碼')
     A          O SC03                      COMP(EQ 'S4')
     A**             ('單別')
