     A*****************************************************************
     A*          銷售訂單主檔(SOSCLF02)   KEY=SC04+SC05+SC07
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A          K SC04
     A**             ('客戶代號')
     A          K SC05
     A**             ('分店代號')
     A          K SC07                      DESCEND
     A**             ('訂單日期')
