     A*****************************************************************
     A*          銷售訂單主檔             KEY=SC02
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A**
     A          K SC02
     A          S SC13                      COMP(EQ '*')
     A**             ('訂單狀態')
     A            SC11                      COMP(EQ 'W0005')
     A**             ('物流點')
