     A*****************************************************************
     A*          銷售訂單主檔(SOSCLF04)   KEY=SC39+SC02
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A          K SC39
     A**             ('確認日期')
     A          K SC02
     A**             ('訂單號碼')
