     A*****************************************************************
     A*          銷售訂單主檔(SOSCLF08)   KEY=SC14+SC15+SC07
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A          K SC14
     A**             ('發票客戶')
     A          K SC15
     A**             ('發票分店')
     A          K SC07                      DESCEND
     A**             ('訂單日期')
