     A*****************************************************************
     A*          銷售訂單主檔(SOSCLF1)     KEY=SC07+SC02
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A          K SC08                      DESCEND
     A**             ('送貨日期')
     A          K SC02
     A**             ('訂單號碼')
