     A*****************************************************************
     A*          銷售訂單主檔(SOSCLF09)   KEY=SC08
     A*****************************************************************
     A          R SC0                       PFILE(SOSCPF)
     A**
     A          K SC08
     A**             ('預計送貨日期')
     A          S SC01                      RANGE('R1' 'R9')
     A**             ('公司別')
     A            SC13                      COMP(EQ 'V')
     A**             ('訂單狀態')
