     A*****************************************************************
     A*          銷售訂單明細檔(SOSDLF01)   KEY=SD02+SD16+SD03
     A*****************************************************************
     A          R SD0                       PFILE(SOSDPF)
     A          K SD02
     A**              ('訂單號碼')
     A          K SD16
     A**              ('產品歸屬')
     A          K SD03
     A**              ('產品編號')
