     A*****************************************************************
     A*          銷售訂單明細檔(SOSDLF03)   KEY=+SD03
     A*****************************************************************
     A          R SD0                       PFILE(SOSDPF)
     A          K SD03
     A**              ('產品編號')
