     A*****************************************************************
     A*          銷售訂單明細檔(SOSDLF02)   KEY=SD01+SD03
     A*****************************************************************
     A          R SD0                       PFILE(SOSDPF)
     A          K SD01
     A          K SD03
     A**              ('產品編號')
