     A*****************************************************************
     A*          ∞e≥f≥Ê•D¿…(SOSELF01)    KEY=SE01+SE07+SE34+SE35+SE02
     A*****************************************************************
     A          R SE0                       PFILE(SOSEPF)
     A          K SE04
     A          S SE31                      COMP(EQ '*')
     A            SE36                      COMP(NE 'T')
