     A*****************************************************************
     A*          送貨單主檔(SOSELF01)    KEY=SE06+SE02
     A*****************************************************************
     A          R SE0                       PFILE(SOSEPF)
     A          K SE06                      DESCEND
     A**              ('交貨日期')
     A**        K SE07
     A**              ('出貨物流點')
     A          K SE02
     A**              ('送貨單號')
