     A*****************************************************************
     A*          送貨單主檔(SOSELF01)    KEY=SE01+SE06+SE02
     A*****************************************************************
     A          R SE0                       PFILE(SOSEPF)
     A          K SE24
     A**              ('確認日期')
     A          K SE01
     A**              ('公司別')
     A          K SE02
     A**              ('送貨單號')
