     A*****************************************************************
     A*          ∞e≥f≥Ê•D¿…(SOSEPF)      KEY=SE02
     A*****************************************************************
     A                                      REFACCPTH(SOSEPF)
     A          R SE0                       PFILE(SOSEPF)
