     A*****************************************************************
     A*          送貨單明細檔(SOSFLF01)   KEY=SF02+SF16+SF03
     A*****************************************************************
     A          R SF0                       PFILE(SOSFPF)
     A          K SF02
     A**              ('訂單號碼')
     A          K SF16
     A**              ('產品歸屬')
     A          K SF03
     A**              ('產品編號')
