     A*****************************************************************
     A*          送貨單明細檔(SOSFLF02)   KEY=SF03+SF25(DESCNED)
     A*****************************************************************
     A          R SF0                       PFILE(SOSFPF)
     A          K SF03
     A**              ('產品編號')
     A          K SF25                      DESCEND
     A**              ('交貨日期')
