     A*****************************************************************
     A*          銷貨退回主檔(SOSGLF01)  KEY=SG01+SG18
     A*****************************************************************
     A          R SG0                       PFILE(SOSGPF)
     A          K SG01
     A**             ('公　　司')
     A          K SG18
     A**             ('原折讓單號')
