     A*****************************************************************
     A*          ¾P³f°h¦^¥DÀÉ(SOSGPF)     KEY=SG02
     A*****************************************************************
     A                                      REFACCPTH(SOSGPF)
     A          R SG0                       PFILE(SOSGPF)
