     A*****************************************************************
     A*          銷貨退回主檔(SOSGLF01)  KEY=SG06+SG02
     A*****************************************************************
     A          R SG0                       PFILE(SOSGPF)
     A          K SG01
     A**             ('公司')
     A          K SG06                      DESCEND
     A**             ('退貨日期')
     A          K SG02
     A**             ('退貨單號')
