     A*****************************************************************
     A*          銷貨退回主檔(SOSGLF05)  KEY=SG09
     A*****************************************************************
     A          R SG0                       PFILE(SOSGPF)
     A          K SG09
     A**             ('折讓單號')
     A          S SG04                      VALUES('A0002' 'B0000')
     A**             ('客戶代號')
