     A*****************************************************************
     A*          銷貨退回主檔(SOSGLF01)  KEY=SG01+SG15+SG04+SG05+SG02
     A*****************************************************************
     A          R SG0                       PFILE(SOSGPF)
     A          K SG09
     A**             ('折讓單號')
