     A*****************************************************************
     A*          銷貨退回明細檔(SOSHPF)   KEY=SH02+SH03
     A*****************************************************************
     A          R SH0                       PFILE(SOSHPF)
     A          K SH02
     A**              ('退貨單號')
     A          K SH11
     A**              ('產品歸屬')
     A          K SH03
     A**              ('產品編號')
