     A*****************************************************************
     A*          ¾P³f°h¦^©ú²ÓÀÉ(SOSHPF)   KEY=SH02+SH03
     A*****************************************************************
     A                                      REFACCPTH(SOSHPF)
     A          R SH0                       PFILE(SOSHPF)
