     A*****************************************************************
     A*          發票主檔(SOSILF08)        KEY=SI01/02
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI01
     A**             ('公司別')
     A          K SI02
     A**             ('發票號碼')
     A**        S SI16                      COMP(NE 'Y')
     A**             ('虛擬發票')
