     A*****************************************************************
     A*          發票主檔(SOSILF4)        KEY=SI08+SI09+SI21
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI08
     A**             ('客戶－總店')
     A          K SI09
     A**             ('客戶－分店')
     A          K SI21
     A**             ('發票日期')
