     A*****************************************************************
     A*          µo≤º•D¿…(SOSIPF)         KEY=SI02
     A*****************************************************************
     A                                      REFACCPTH(SOSIPF)
     A          R SI0                       PFILE(SOSIPF)
