     A*****************************************************************
     A*          發票主檔(SOSILF11)
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI21
     A                                      DESCEND
     A**             ('發票日期')
