     A*****************************************************************
     A*          祇布郎(SOSILF02)        KEY=SI12+SI13 (S)
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI12
     A**             ('祇布め⌒羆┍')
     A          K SI21                      DESCEND
     A**             ('祇布ら戳')
     A          K SI02
     A**             ('祇布腹絏')
     A          K SI01
     A**             ('そ')
     A          S SI30                      COMP(NE 0)
     A**             ('ゼ≧肂')
     A            SI18                      COMP(EQ ' ')
     A**             ('篈')
     A            SI19                      COMP(NE 'V')
     A**             ('紀爹癘')
