     A*****************************************************************
     A*          祇布郎(SOSILF03)        KEY=SI01/12/13/21/02 (S)
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI01
     A**             ('そ')
     A          K SI12
     A**             ('祇布め⌒羆┍')
     A          K SI13
     A**             ('祇布め⌒だ┍')
     A          K SI21
     A**             ('祇布ら戳')
     A          K SI02
     A**             ('祇布腹絏')
     A          O SI19                      COMP(NE 'V')
     A**             ('紀爹癘')
     A          S SI18                      COMP(EQ '*')
     A          S SI18                      COMP(EQ ' ')
     A**             ('篈')            紀斗秨ゼ秨
