     A*****************************************************************
     A*          發票主檔(SOSILF03)        KEY=SI01+SI02 (S)
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI02
     A**             ('發票號碼')
