     A*****************************************************************
     A*          祇布郎(SOSILF03)
     A*****************************************************************
     A*ㄑ⑾⑧⒆⒈⒍祇布紀秨琩高
     A          R SI0                       PFILE(SOSIPF)
     A          K SI01
     A**             ('そ')
     A          K SI21                      DESCEND
     A**             ('祇布ら戳')
     A          K SI02
     A**             ('祇布腹絏')
     A**        S SI16                      COMP(NE 'Y')
     A**             ('店览祇布')
     A          S SI18                      COMP(EQ '*')
     A**             ('祇布篈')
