     A*****************************************************************
     A*          祇布郎(SOSILF94)        KEY=SI12+SI13+SI02 (S)
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI12
     A**             ('祇布め⌒羆┍')
     A          K SI13
     A**             ('祇布め⌒だ┍')
     A          K SI21                      DESCEND
     A**             ('祇布ら戳')
     A          K SI02
     A**             ('祇布腹絏')
     A          S SI18                      COMP(EQ ' ')
     A**             ('篈')
     A            SI19                      COMP(NE 'V')
     A**             ('紀爹癘')
