     A*****************************************************************
     A*          發票主檔(SOSILF03)
     A*****************************************************************
     A          R SI0                       PFILE(SOSIPF)
     A          K SI02
     A**             ('發票號碼')
     A*         S SI08                      VALUES('A0002' 'B0000')
     A**             ('客戶代號')
