     A*****************************************************************
     A*          發票明細檔(SOSJLF02)     KEY=SJ01+SJ03+SJ11+SJ12+SJ0
     A*****************************************************************
     A          R SJ0                       PFILE(SOSJPF)
     A          K SJ02
     A*              ('發票號碼')
     A          S SJXX                      COMP(GE 20000801)
     A
