     A*****************************************************************
     A*          銷售目標達成率資料檔(SOSKPF)  KEY=SK01-SK06
     A*****************************************************************
     A                                      UNIQUE
     A          R SK0                       PFILE(SOSKPF)
     A          K SK02
     A          K SK03
     A          K SK07
     A          K SK05
     A          K SK34
     A          K SK06
