     A*****************************************************************
     A*          專櫃目標達成率資料檔(SOSLPF)  KEY=SL01-SL03
     A*****************************************************************
     A                                      REFACCPTH(SOSLPF)
     A          R SL0                       PFILE(SOSLPF)
