     A*****************************************************************
     A*          專櫃目標達成率資料檔(SOSLPF)  KEY=SL01-SL03
     A*****************************************************************
     A          R SL0                       PFILE(SOSLPF)
     A          K SL02
     A          K SL03
