     A*****************************************************************
     A*          產品收回主檔(SOSNPF)     KEY=SN02
     A*================================================================
     A* CODE | AUTHOR |  DATE  | DESCRIPTION
     A*----------------------------------------------------------------
     A* M001 |MICHELLE|07.31.02|新增欄位
     A*----------------------------------------------------------------
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R SN0
     A            SN01      R               COLHDG('公司別')
     A            SN02      R               COLHDG('單據號碼')
     A*                        XX   -  XX  -    XX    - XXXXXX
     A*                      公司 -單別-西元年份-序號
     A            SN03      R               COLHDG('出貨物流點代號')
     A            SN04      R               COLHDG('收貨物流點代號')
B2CHKA            SN05      R    8 00       COLHDG('收回日期')
B2CHKA            SN06      R    8 00       COLHDG('實際入庫日')
     A            SN07      R               COLHDG('業務人員')
     A            SN08      R               COLHDG('業務員組別')
     A            SN09      R               COLHDG('結帳註記')
     A**                                    'V'-已結帳
     A            SN10      R               COLHDG('轉帳註記')
     A**                                    'V' -已轉帳
     A**                                    'T' -轉帳單據
     A*                                     'N' -無須轉帳(轉帳處理時更新)
     A            SN11      R               COLHDG('客戶分店')
     A            SN12      R               COLHDG('收回總金額')
     A            SN13      R               COLHDG('收回FOB-TOT')
     A            SN14      R               COLHDG('收回FHI-TOT')
     A            SN15      R               COLHDG('收回DUTY-TOT')
M001AA            SN16           2          COLHDG('試飲原因')
"    A            SN17          12          COLHDG('原試飲單號')
"    A            SN18           5          COLHDG('原試飲客戶代號')
"    A            SN19           4          COLHDG('原試飲分店代號')
"    A            SN20           5          COLHDG('原申請人代號')
"    A            SN21           4          COLHDG('原申請人分號')
"    A            SN22          12          COLHDG('促銷活動代號')
      *
"    A            SN23          12          COLHDG('文字一')
"    A            SN24          12          COLHDG('文字二')
"    A            SN25          12          COLHDG('文字三')
"    A            SN26          11  2       COLHDG('數字一')
"    A            SN27          11  2       COLHDG('數字二')
"    A            SN28          11  2       COLHDG('數字三')
"    A            SN29          30O         COLHDG('備註一')
"    A            SN30          30O         COLHDG('備註二')
"    A            SN31          30O         COLHDG('備註三')
"    A            SN32           1          COLHDG('控制一')
"    A            SN33           1          COLHDG('控制二')
"    A            SN34           1          COLHDG('控制三')
      *
B2CHKA            SNXX      R    8 00       COLHDG('異動日期')
     A            SNYY      R               COLHDG('異動時間')
     A            SNZZ      R               COLHDG('異動者　')
     A          K SN02
