     A*****************************************************************
     A*          產品收回延伸檔(SOSNPFX)    KEY=NX02
      *================================================================
      * MODI CODE |  AUTHOR  |   DATE  | DESCRIPTION
      *----------------------------------------------------------------
      *  M001     | MICHELLE | 01.08.22|增加原試飲客戶代號／分店代號
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R NX0
     A            NX01           2          COLHDG('公司別')
     A            NX02          12          COLHDG('單據號碼')
     A*                        XX   -  XX  -    XX    - XXXXXX
     A*                      公司 -單別-西元年份-序號
M005DA*           NX03           2          COLHDG('產品種類')
M005DA*           NX04           1          COLHDG('容量代碼')
     A            NX05           2          COLHDG('試飲原因')
     A            NX06          12          COLHDG('原試飲單號')
M001AA            NX07           5          COLHDG('原試飲客戶代號')
M001AA            NX08           4          COLHDG('原試飲分店代號')
M001AA            NX09           5          COLHDG('原申請人代號')
M001AA            NX10           4          COLHDG('原申請人分號')
     A            NXXX           8 00       COLHDG('異動日期')
     A            NXYY           6  0       COLHDG('異動時間')
     A            NXZZ          10          COLHDG('異動者　')
     A          K NX02
