     A*****************************************************************
     A*          產品收回主檔(SOSNLF01)   KEY=SN05+SN02
     A*****************************************************************
     A          R SN0                       PFILE(SOSNPF)
     A          K SN05                      DESCEND
     A**             ('收回日期')
     A          K SN02
     A**             ('單據號碼')
