     A*****************************************************************
     A*          產品收回主檔(SOSNLF02)   KEY=SN06+SN01+SN02
     A*****************************************************************
     A          R SN0                       PFILE(SOSNPF)
     A          K SN06
     A**             ('實際入庫日')
     A          K SN01
     A**             ('公司別')
     A          K SN02
     A**             ('單據號碼')
