     A*****************************************************************
     A*          產品收回主檔(SOSNLF04)   KEY=SN17+SN02
     A*****************************************************************
     A          R SN0                       PFILE(SOSNPF)
     A**
     A          K SN17
     A**             ('原試飲單號')
     A          K SN02
     A**             ('單據號碼')
