     A*****************************************************************
     A*          產品收回主檔(SOSNPF)     KEY=SN02
     A*****************************************************************
     A                                      REFACCPTH(SOSNPF)
     A          R SN0                       PFILE(SOSNPF)
