     A*****************************************************************
     A*          產品收回明細檔(SOSOPF)   KEY=SH02+SH03
     A*****************************************************************
     A          R SO0                       PFILE(SOSOPF)
     A          K SO02
     A**              ('單據號碼')
     A          K SO11
     A**              ('產品歸屬')
     A          K SO03
     A**              ('產品編號')
