     A*****************************************************************
     A*          產品收回明細檔(SOSOPF)   KEY=SO02+SO03
     A*****************************************************************
     A                                      REFACCPTH(SOSOPF)
     A          R SO0                       PFILE(SOSOPF)
