     A*****************************************************************
     A*          原始／轉帳單據對照檔(SOSPLF01) KEY=SP02+SP01
     A*****************************************************************
     A          R SP0                       PFILE(SOSPPF)
     A          K SP02
     A**             ('轉帳單據單號')
     A          K SP01
     A**             ('原始單號')
