     A*****************************************************************
     A*          專櫃五日銷售檔(SOSTLF5)
     A*****************************************************************
     A          R ST0                       PFILE(SOSTPF)
     A          K ST04
     A*               ('產品代號')
     A          K ST02
     A*               ('銷售年月')
     A          K ST01
     A*               ('專櫃代號')
     A          K ST03
     A*               ('PLU代號')
