     A*****************************************************************
     A*          ±MÂd¤­¤é¾P°âÀÉ(SOSTPF)         KEY=ST01-ST04
     A*****************************************************************
     A                                      REFACCPTH(SOSTPF)
     A          R ST0                       PFILE(SOSTPF)
