     A*****************************************************************
     A*      專櫃五日訂單對照檔SOSUPF  SU02+SU04
     A*****************************************************************
     A          R SU0                       PFILE(SOSUPF)
     A          K SU02
     A**              ('銷售年月')
     A          K SU04
     A**              ('產品代號')
