     A*****************************************************************
     A*          銷售目標資料檔(SOSVPF)  KEY=SV01-SV02
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R SV0
     A            SV01      R               COLHDG('產品代號')
     A                                      REFFLD(MA01)
B2CHKA            SV02      R    6 00       COLHDG('年月')
     A                                      REFFLD(ST02)
     A            SV03      R               COLHDG('預估數量１')
     A                                      REFFLD(SK10)
     A            SV04      R               COLHDG('預估數量２')
     A                                      REFFLD(SK10)
     A            SV05      R               COLHDG('預估數量３')
     A                                      REFFLD(SK10)
     A            SV06      R               COLHDG('目標數量')
     A                                      REFFLD(SK10)
B2CHKA            SVXX      R    8 00       COLHDG('異動日期')
     A                                      REFFLD(SKXX)
     A            SVYY      R               COLHDG('異動時間')
     A                                      REFFLD(SKYY)
     A            SVZZ      R               COLHDG('異動者　')
     A                                      REFFLD(SKZZ)
     A          K SV01
     A          K SV02
