     A*****************************************************************
     A*          媒體申報轉檔(SOVQLF11)   KEY=VQ16
     A*****************************************************************
     A          R VQ0                       PFILE(SOVQPF)
     A          K VQ16
     A**              ('發票號碼')
     A          K VQ01
     A**              ('格式')
     A          S VQ01                      RANGE('21' '28')
     A**                                   進項格式
     A
