     A*****************************************************************
     A*          媒體申報轉檔(SOVQLF03) FOR轉頭檔使用
     A*****************************************************************
     A          R VQ0                       PFILE(SOVQPF)
     A          K VQ91
     A**              ('公司別')
     A          K VQ92
     A**              ('辦事處')
     A          K VQ04
     A**              ('歸屬年月')
     A          K VQ16
     A**              ('發票號碼')
     A
