     A*****************************************************************
     A*          媒體申報檔(SOVTLF01)   KEY=VT03
     A*****************************************************************
     A          R VT0                       PFILE(SOVTPF)
     A          K VT03
     A**              ('流水號')
