     A*****************************************************************
     A*  TEST    銷售訂單明細檔(SOSDPF)   KEY=SD02+SD03
     A*****************************************************************
     A                                      JDFTVAL
     A                                      DYNSLT
     A          R SD0                       JFILE(SOSDPF SOSCPF)
     A          J                           JOIN(SOSDPF SOSCPF)
     A                                      JFLD(SD02 SC02)
     A            SD01      R               COLHDG('公司別')
     A            SD02      R               COLHDG('訂單號碼')
     A            SD03      R               COLHDG('產品編號')
     A            SD04      R               COLHDG('訂貨數量')
     A            SD05      R               COLHDG('搭贈數量')
     A            SD10      R               COLHDG('單位成本-FOB')
     A            SD11      R               COLHDG('單位成本-FHI')
     A            SD12      R               COLHDG('單位成本-DUTY')
B2CHKA            SDXX      R    8 00       COLHDG('異動日期')
     A            SDYY      R               COLHDG('異動時間')
     A            SC02      R               COLHDG('訂單號碼')
     A            SC03      R               COLHDG('單別')
     A            SC13      R               COLHDG('訂單狀態')
B2CHKA            SC39      R    8 00       COLHDG('確認日期')
     A          K SD02
     A          K SD03
     A          S SC03                      COMP(EQ 'S2')
     A            SC13                      COMP(NE '*')
