     A*****************************************************************
     A*          ²£«~µP»ùÀÉ(W1AAPF)   KEY=AA02 +AA03
     A*****************************************************************
     A          R AA0                       PFILE(W1AAPF)
      **
     A          K AA02
     A          K AA03
