     A*****************************************************************
     A*          前台調撥主檔
     A*****************************************************************
     A          R AF0                       PFILE(W1AFPF)
      **
     A          K AF01
     A          K AF04
     A          K AF02
