     A          R WG0
     A            WG01           1A         COLHDG('公司別')
     A            WG02          12A         COLHDG('調撥單號')
     A            WG03           5A         COLHDG('出貨物流點')
     A            WG04           9A         COLHDG('產品代號')
     A            WG05           8S 0       COLHDG('調撥數量')
     A*
     A          K WG01
     A          K WG03
     A          K WG04
