     A*****************************************************************
     A*          «á¥x¾P°â¥DÀÉ
     A*****************************************************************
     A          R BA0                       PFILE(W2BAPF)
      **
     A          K BA02
     A          K BA01                      DESCEND
     A          K BA03
      *
     A          S BA05                      COMP(EQ 'O')
     A          S BA05                      COMP(EQ 'P')
