     A*****************************************************************
     A*          «á¥x¾P°â©ú²ÓÀÉ
     A*****************************************************************
     A          R BB0                       PFILE(W2BBPF)
      **
     A          K BB01
     A          K BB02
      *
     A          S BB09                      COMP(EQ 'O')
     A          S BB09                      COMP(EQ 'B')
