     A*****************************************************************
     A*          «á¥x¾P°â©ú²ÓÀÉ
     A*****************************************************************
     A          R BB0                       PFILE(W2BBPF)
      **
     A          K BB01
     A          K BB02
     A          K BB03
