     A*****************************************************************
     A*          «á¥x­q³f¥DÀÉ
     A*****************************************************************
     A          R BC0                       PFILE(W2BCPF)
      **
     A          K BC02
     A          K BC01                      DESCEND
     A          K BC03
