     A*****************************************************************
     A*          «á¥x­q³f©ú²ÓÀÉ
     A*****************************************************************
     A          R BD0                       PFILE(W2BDPF)
      **
     A          K BD01
     A          K BD03
     A          K BD02
