     A*****************************************************************
     A*          «á¥x±ÄÁÊ¥DÀÉ
     A*****************************************************************
     A          R BE0                       PFILE(W2BEPF)
      **
     A          K BE06
     A          K BE02
     A          K BE01                      DESCEND
     A          K BE03
