     A*****************************************************************
     A*          «á¥x­q³f¥DÀÉ
     A*****************************************************************
     A          R BG0                       PFILE(W2BGPF)
      **
     A          K BG02
     A          K BG01                      DESCEND
     A          K BG03
