     A*****************************************************************
     A*          «á¥x­q³f¥DÀÉ
     A*****************************************************************
     A          R BG0                       PFILE(W2BGPF)
      **
     A          K BG06
     A          K BG03
