     A*****************************************************************
     A                                      UNIQUE
     A          R X10
     A*
     A            X101           9A         COLHDG('產品代號')
     A            X102          11S 2       COLHDG('單位成本')
     A            X103           5A         COLHDG('專櫃')
     A            X104           9S 0       COLHDG('數量')
     A*
     A          K X101
     A          K X103
