     A*****************************************************************
     A*          既郎⌒祇布紀(WFJL22PF)
     A*           KEY=JL2201+JL2202+J1102$+JL2203+JL2204
     A*================================================================
     A* MODI CODE |  AUTHOR  |  DATE  | DESCRIPTION
     A*----------------------------------------------------------------
     A* M004      | MICHELLE |00.05.05|狄皊祙龟琁
     A*----------------------------------------------------------------
     A*****************************************************************
     A                                      REF(RERF)
     A                                      UNIQUE
     A          R WFJL22R
B2CHKA            JL2201    R    8 00       COLHDG('絋粄ら戳')
     A                                      REFFLD(#AXX)
     A            JL2202    R               COLHDG('そ')
     A                                      REFFLD(#B01)
     A*                                     R1/R2/R3/W1/W2/W3
     A            J2202$         1A         COLHDG('快ㄆ矪')
     A*                                     '1'=
     A*                                     '2'=い
     A*                                     '3'=蔼动
     A            J2203$         2A         COLHDG('ヘ')
     A*                                     '1'=
     A            JL2203    R               COLHDG('')
     A                                      REFFLD(SS16)
     A*                                     S01,S02,R01,R02,R03
     A            JL2204    R               COLHDG('璹虫腹絏')
     A                                      REFFLD(SS10)
     A            JL2205    R               COLHDG('参祇布')
     A                                      REFFLD(SS02)
     A            JL2206    R               COLHDG('祇布')
     A                                      REFFLD(SS04)
     A            JL2207    R               COLHDG('め腹')
     A                                      REFFLD(SS08)
     A            JL2208    R               COLHDG('祇布肂')
     A                                      REFFLD(SS27)
     A            JL2209    R               COLHDG('祇布肂')
     A                                      REFFLD(SS25)
     A            JL2210    R               COLHDG('畉钵祇布肂')
     A                                      REFFLD(SS25)
     A            JL2211    R               COLHDG('чΙ肂')
     A                                      REFFLD(SS28)
     A            JL2212    R               COLHDG('чΙ肂')
     A                                      REFFLD(SS26)
     A            JL2213    R               COLHDG('畉钵чΙ肂')
     A                                      REFFLD(SS26)
M004AA            JL2214         7  0       COLHDG('祇布祙肂')
M004AA            JL2215         7  0       COLHDG('祇布祙肂')
M004AA            JL2216         7  0       COLHDG('畉钵祇布祙肂')
     A*
     A          K JL2202
     A          K J2202$
     A          K JL2201
     A          K JL2203
     A          K JL2204
