     A*****************************************************************
     A*          客戶基本資料檔(WOWEPF)   KEY=WE01
     A*****************************************************************
     A          R WE0                       PFILE(WOWEPF)
     A          K WE07
     A          K WE01
