     FMTMDPF  IP  E           K        DISK
     FMTMJPF  O   E           K        DISK
     I           UDS
     I                                      101 110 $USER
     I                                      201 2080$A8YMD
     C                     MOVELMD01      MJ01      P      客戶代號
     C                     MOVEL'N'       MJ02             電子發票
     C                     Z-ADD$A8YMD    MJXX             異動日期
     C                     TIME           MJYY             異動時間
     C                     MOVEL$USER     MJZZ             異動者
     C                     WRITEMJ0
